AcMgd Extension Library- v20.1
LockedTransaction Methods
The LockedTransaction type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
LockedTransaction Class
Autodesk.AutoCAD.Runtime Namespace