AcMgd Extension Library- v20.1
StringExtensions Methods
The StringExtensions type exposes the following members.
Methods
Name | Description
Matches
 Matcheses the specified pattern.
Top
See Also
Reference
StringExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace