AcExtentionLibrary - v20.1
EditorExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.EditorInput.EditorExtensions
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class EditorExtensions
<ExtensionAttribute>
Public NotInheritable Class EditorExtensions
[ExtensionAttribute]
public ref class EditorExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type EditorExtensions =  class end
Methods
Name | Description
GetSelection(Editor, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, PromptSelectionOptions, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, SelectionFilter, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, PromptSelectionOptions, SelectionFilter, AllowedClassFilter)
 Gets the selection.
Write(Editor, ObjectId)
 Writes the specified value.
Write(Editor, Point2d)
 Writes the specified value.
Write(Editor, Point3d)
 Writes the specified value.
Write(Editor, Boolean)
 Writes the text representation of the specified Boolean val to the CommandLine
Write(Editor, Char)
 Writes the specified Unicode character val to the CommandLine
Write(Editor, Char[])
 Writes the specified subarray of Unicode characters to the CommandLine
Write(Editor, IEnumerable<Object>)
 Writes the specified value.
Write(Editor, IEnumerable<String>)
 Writes the specified value.
Write(Editor, Decimal)
 Writes the specified value.
Write(Editor, Double)
 Writes the specified value.
Write(Editor, Int32)
 Writes the specified value.
Write(Editor, Int64)
 Writes the specified value.
Write(Editor, Object)
 Writes the specified value.
Write(Editor, Single)
 Writes the specified value.
Write(Editor, String)
 Writes the specified value.
Write(Editor, String, Object)
 Writes the specified format.
Write(Editor, String, Object[])
 Writes the specified format.
Write(Editor, Char[], Int32, Int32)
 Writes the specified subarray of Unicode characters to the CommandLine
Write(Editor, String, Object, Object)
 Writes the specified format.
Write(Editor, String, Object, Object, Object)
 Writes the specified format.
WriteLine(Editor)
 Writes the line.
WriteLine(Editor, ObjectId)
 Writes the line.
WriteLine(Editor, Point2d)
 Writes the line.
WriteLine(Editor, Point3d)
 Writes the line.
WriteLine(Editor, Boolean)
 Writes the line.
WriteLine(Editor, Char)
 Writes the line.
WriteLine(Editor, Char[])
 Writes the line.
WriteLine(Editor, IEnumerable<Object>)
 Writes the line.
WriteLine(Editor, IEnumerable<String>)
 Writes the line.
WriteLine(Editor, Decimal)
 Writes the line.
WriteLine(Editor, Double)
 Writes the line.
WriteLine(Editor, Int32)
 Writes the line.
WriteLine(Editor, Int64)
 Writes the line.
WriteLine(Editor, Object)
 Writes the line.
WriteLine(Editor, Single)
 Writes the line.
WriteLine(Editor, String)
 Writes the line.
WriteLine(Editor, String, Object)
 Writes the line.
WriteLine(Editor, String, Object[])
 Writes the line.
WriteLine(Editor, Char[], Int32, Int32)
 Writes the line.
WriteLine(Editor, String, Object, Object)
 Writes the line.
WriteLine(Editor, String, Object, Object, Object)
 Writes the line.
WriteLine<T>(Editor, IEnumerable<T>)
 Writes the line.
Top
See Also
Reference
Autodesk.AutoCAD.EditorInput Namespace