Autocad Extension Framework Documentation - v20.1
QNewTemplateFile Properties
The QNewTemplateFile type exposes the following members.
Properties
Name | Description
Path
 Gets or sets the path.
Top
See Also
Reference
QNewTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace