AcExtentionLibrary - v20.1
Preferences.PrinterStyleSheetPath Property
 Gets the printer style sheet path.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PrinterStyleSheetPath PrinterStyleSheetPath { get; }
Public Shared ReadOnly Property PrinterStyleSheetPath As PrinterStyleSheetPath
	Get
public:
static property PrinterStyleSheetPath^ PrinterStyleSheetPath {
	PrinterStyleSheetPath^ get ();
}
static member PrinterStyleSheetPath : PrinterStyleSheetPath with get
Property Value
Type: PrinterStyleSheetPath
 The printer style sheet path.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace