Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.DWGNAME Property
 Gets the dwgname.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string DWGNAME { get; }
Public ReadOnly Property DWGNAME As String
	Get
public:
property String^ DWGNAME {
	String^ get ();
}
member DWGNAME : string with get
Property Value
Type: String
 The dwgname.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace