AcMgd Extension Library- v20.1
PageSetupOverridesTemplateFile Properties
The PageSetupOverridesTemplateFile type exposes the following members.
Properties
Name | Description
Path
 Gets or sets the path.
Top
See Also
Reference
PageSetupOverridesTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace