AcExtensionLibrary - v20.1
DatabaseExtensions.ModelSpace Method
Overload List
Name | Description
ModelSpace(Database, OpenMode)
 Models the space.
ModelSpace(Database, Transaction, OpenMode)
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace