AcMgd Extension Library- v20.1
DBObjectExtensions Methods
The DBObjectExtensions type exposes the following members.
Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
GetExtensionDictionary
 Gets the extension dictionary.
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
HasExtensionDictionary
 Determines whether [has extension dictionary].
TryGetExtensionDictionaryId
 Tries the get extension dictionary ObjectId.
Top
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace