AcMgd Extension Library- v20.1
AcadDirectory Methods
The AcadDirectory type exposes the following members.
Methods
Name | Description
Equals(Object)
 Determines whether the specified Object, is equal to this instance.
 (Overrides Object.Equals(Object).)
Equals(AcadDirectory)
 Equalses the specified other.
GetHashCode
 Returns a hash code for this instance.
 (Overrides Object.GetHashCode().)
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace