AcMgd Extension Library- v20.1
DatabaseExtensions.RegAppTable Method (Database, OpenMode)
 Regs the application table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static RegAppTable RegAppTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function RegAppTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As RegAppTable
public:
[ExtensionAttribute]
static RegAppTable^ RegAppTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member RegAppTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> RegAppTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: RegAppTable
RegAppTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
RegAppTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace