AcExtensionLibrary - v20.1
EditorExtensions.Write Method (Editor, String, Object, Object)
 Writes the specified format.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void Write(
	this Editor ed,
	string format,
	Object arg0,
	Object arg1
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	format As String,
	arg0 As Object,
	arg1 As Object
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	String^ format,
	Object^ arg0,
	Object^ arg1
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        format : string *
        arg0 : Object *
        arg1 : Object -> unit
Parameters
ed
Type: Editor
The ed.
format
Type: System.String
The format.
arg0
Type: System.Object
The arg0.
arg1
Type: System.Object
The arg1.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace