AcMgd Extension Library- v20.1
Settings.SystemVariables.LWUNITS Property
 Gets or sets the lwunits.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short LWUNITS { get; set; }
Public Property LWUNITS As Short
	Get
	Set
public:
property short LWUNITS {
	short get ();
	void set (short value);
}
member LWUNITS : int16 with get, set
Property Value
Type: Int16
 The lwunits.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace