AcMgd Extension Library- v20.1
PageSetupOverridesTemplateFile Constructor
 Initializes a new instance of the PageSetupOverridesTemplateFile class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public PageSetupOverridesTemplateFile(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
PageSetupOverridesTemplateFile(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> PageSetupOverridesTemplateFile
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
PageSetupOverridesTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace