AcExtentionLibrary - v20.1
TextStyleTableExtensions Methods
Methods
Name | Description
GetAllTextStyleTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets all text style table records.
GetAllTextStyleTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets all text style table records.
GetShapeFileTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
GetShapeFileTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
GetTextStyleTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
GetTextStyleTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
Top
See Also
Reference
TextStyleTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace