AcExtensionLibrary - v20.1
TransactedSysytemVariables Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Transaction
 Autodesk.AutoCAD.Runtime.TransactedSysytemVariables
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class TransactedSysytemVariables : Transaction
Public Class TransactedSysytemVariables
	Inherits Transaction
public ref class TransactedSysytemVariables : public Transaction
type TransactedSysytemVariables =
    class
        inherit Transaction
    end
The TransactedSysytemVariables type exposes the following members.
Constructors
Name | Description
TransactedSysytemVariables(Document)
 Initializes a new instance of the TransactedSysytemVariables class.
TransactedSysytemVariables(Database)
 Initializes a new instance of the TransactedSysytemVariables class.
TransactedSysytemVariables(Transaction)
 Initializes a new instance of the TransactedSysytemVariables class.
Top
Properties
Name | Description
TransactedVariables
 Gets the transacted variables.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace