Autocad Extension Framework Documentation - v20.1
Point3dExtension Methods
The Point3dExtension type exposes the following members.
Methods
Name | Description
ToPoint2D
 To the point2 d.
Top
See Also
Reference
Point3dExtension Class
Autodesk.AutoCAD.Geometry Namespace