AcExtensionLibrary - v20.1
CommandClass.Db Property
 Gets the database.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public Database Db { get; }
Public ReadOnly Property Db As Database
	Get
public:
virtual property Database^ Db {
	Database^ get () sealed;
}
abstract Db : Database with get
override Db : Database with get
Property Value
Type: Database
 The database.
Implements
ICommandClass.Db
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace