AcExtentionLibrary - v20.1
CommandClass Constructor
 Initializes a new instance of the CommandClass class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public CommandClass()
Public Sub New
public:
CommandClass()
new : unit -> CommandClass
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace