AcExtentionLibrary - v20.1
WrapperDBDictionary<T> Properties
The WrapperDBDictionary<T> generic type exposes the following members.
Properties
Name | Description
IncludingErased
 Gets a value indicating whether [including erased].
Top
See Also
Reference
WrapperDBDictionary<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace