AcExtensionLibrary - v20.1
Settings.SystemVariables.OSMODE Property
 Gets or sets the osmode.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public OsnapMode OSMODE { get; set; }
Public Property OSMODE As OsnapMode
	Get
	Set
public:
property OsnapMode OSMODE {
	OsnapMode get ();
	void set (OsnapMode value);
}
member OSMODE : OsnapMode with get, set
Property Value
Type: OsnapMode
 The osmode.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace