Autocad Extension Framework Documentation - v20.1
Preferences.EnterpriseMenuFile Property
 Gets the enterprise menu file.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static EnterpriseMenuFile EnterpriseMenuFile { get; }
Public Shared ReadOnly Property EnterpriseMenuFile As EnterpriseMenuFile
	Get
public:
static property EnterpriseMenuFile^ EnterpriseMenuFile {
	EnterpriseMenuFile^ get ();
}
static member EnterpriseMenuFile : EnterpriseMenuFile with get
Property Value
Type: EnterpriseMenuFile
 The enterprise menu file.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace