AcExtentionLibrary - v20.1
WrapperDBDictionary<T> Class
 A generic wrapper class for wrapping the 9 common dictionaries created by AutoCAD. Group, Layout, etc.......
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Drawable
 DBObject
 DBDictionary
 Autodesk.AutoCAD.DatabaseServices.WrapperDBDictionary<T>
 Autodesk.AutoCAD.DatabaseServices.GroupDictionary
 Autodesk.AutoCAD.DatabaseServices.LayoutDictionary
 Autodesk.AutoCAD.DatabaseServices.MLStyleDictionary
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class WrapperDBDictionary<T> : DBDictionary,
	IEnumerable<T>, IEnumerable
where T : DBObject
Public Class WrapperDBDictionary(Of T As DBObject)
	Inherits DBDictionary
	Implements IEnumerable(Of T), IEnumerable
generic<typename T>
where T : DBObject
public ref class WrapperDBDictionary : public DBDictionary,
	IEnumerable<T>, IEnumerable
type WrapperDBDictionary<'T when 'T : DBObject> =
    class
        inherit DBDictionary
        interface IEnumerable<'T>
        interface IEnumerable
    end
Type Parameters
T
The WrapperDBDictionary<T> type exposes the following members.
Properties
Name | Description
IncludingErased
 Gets a value indicating whether [including erased].
Top
Methods
Name | Description
GetEnumerator
 Gets the enumerator.
Top
Extension Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
 (Defined by DBObjectExtensions.)
GetEntries<T>(OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetEntries<T>(Transaction, OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetExtensionDictionary
 Gets the extension dictionary.
 (Defined by DBObjectExtensions.)
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
 (Defined by DBObjectExtensions.)
HasExtensionDictionary
 Determines whether [has extension dictionary].
 (Defined by DBObjectExtensions.)
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
TryGetExtensionDictionaryId
 Tries the get extension dictionary ObjectId.
 (Defined by DBObjectExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace