AcMgd Extension Library- v20.1
PromptKeywords.SetKeywords Method
Overload List
Name | Description
SetKeywords(String)
 Sets the keywords.
SetKeywords(String, String)
 Sets the keywords.
Top
See Also
Reference
PromptKeywords Class
Autodesk.AutoCAD.EditorInput Namespace