AcExtentionLibrary - v20.1
Settings.SystemVariables.STARTUP Property
 Gets or sets the startup.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short STARTUP { get; set; }
Public Property STARTUP As Short
	Get
	Set
public:
property short STARTUP {
	short get ();
	void set (short value);
}
member STARTUP : int16 with get, set
Property Value
Type: Int16
 The startup.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace