AcExtensionLibrary - v20.1
Settings.SystemVariables.TEXTSIZE Property
 Gets or sets the textsize.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public double TEXTSIZE { get; set; }
Public Property TEXTSIZE As Double
	Get
	Set
public:
property double TEXTSIZE {
	double get ();
	void set (double value);
}
member TEXTSIZE : float with get, set
Property Value
Type: Double
 The textsize.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace