Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.LayoutDictionary Method (Database, OpenMode, Boolean)
 Layouts the dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static LayoutDictionary LayoutDictionary(
	this Database database,
	OpenMode openMode = OpenMode.ForRead,
	bool includingErased = false
)
<ExtensionAttribute>
Public Shared Function LayoutDictionary (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false
) As LayoutDictionary
public:
[ExtensionAttribute]
static LayoutDictionary^ LayoutDictionary(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead,
	bool includingErased = false
)
[<ExtensionAttribute>]
static member LayoutDictionary :
        database : Database *
        ?openMode : OpenMode *
        ?includingErased : bool
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
*)
-> LayoutDictionary
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
Return Value
Type: LayoutDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
LayoutDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace