AcExtensionLibrary - v20.1
Settings.SystemVariables.UCSFOLLOW Property
 Gets or sets a value indicating whether this Settings.SystemVariables is ucsfollow.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool UCSFOLLOW { get; set; }
Public Property UCSFOLLOW As Boolean
	Get
	Set
public:
property bool UCSFOLLOW {
	bool get ();
	void set (bool value);
}
member UCSFOLLOW : bool with get, set
Property Value
Type: Boolean
true if ucsfollow; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace