Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.NEXTFIBERWORLD Property
 Gets or sets a value indicating whether this Settings.SystemVariables is nextfiberworld.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public bool NEXTFIBERWORLD { get; set; }
Public Property NEXTFIBERWORLD As Boolean
	Get
	Set
public:
property bool NEXTFIBERWORLD {
	bool get ();
	void set (bool value);
}
member NEXTFIBERWORLD : bool with get, set
Property Value
Type: Boolean
true if nextfiberworld; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace