Autocad Extension Framework Documentation - v20.1
LayerTableExtensions Methods
Methods
Name | Description
GetLayerTableRecords(LayerTable, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
GetLayerTableRecords(LayerTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
Top
See Also
Reference
LayerTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace