AcExtensionLibrary - v20.1
LockedTransaction Constructor
 Initializes a new instance of the LockedTransaction class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public LockedTransaction(
	Transaction trx,
	DocumentLock docLock
)
Public Sub New (
	trx As Transaction,
	docLock As DocumentLock
)
public:
LockedTransaction(
	Transaction^ trx,
	DocumentLock^ docLock
)
new :
        trx : Transaction *
        docLock : DocumentLock -> LockedTransaction
Parameters
trx
Type: Transaction
The TRX.
docLock
Type: DocumentLock
The document lock.
See Also
Reference
LockedTransaction Class
Autodesk.AutoCAD.Runtime Namespace