Autocad Extension Framework Documentation - v20.1
ProxyObjectExtensions.IsErasable Method
 Determines whether this instance is erasable.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static bool IsErasable(
	this ProxyObject proxy
)
<ExtensionAttribute>
Public Shared Function IsErasable (
	proxy As ProxyObject
) As Boolean
public:
[ExtensionAttribute]
static bool IsErasable(
	ProxyObject^ proxy
)
[<ExtensionAttribute>]
static member IsErasable :
        proxy : ProxyObject -> bool
Parameters
proxy
Type: ProxyObject
The proxy.
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ProxyObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ProxyObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace