Autocad Extension Framework Documentation - v20.1
PerDocData Methods
The PerDocData type exposes the following members.
Methods
Name | Description
Create
 Creates the specified document.
Dispose
 Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PerDocData Class
Autodesk.AutoCAD.Runtime Namespace