AcMgd Extension Library- v20.1
TemporarySystemVariables Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.Core.Settings.SystemVariables
 Autodesk.AutoCAD.ApplicationServices.Core.TemporarySystemVariables
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class TemporarySystemVariables : Settings.SystemVariables
Public Class TemporarySystemVariables
	Inherits Settings.SystemVariables
public ref class TemporarySystemVariables : public Settings.SystemVariables
type TemporarySystemVariables =
    class
        inherit Settings.SystemVariables
    end
The TemporarySystemVariables type exposes the following members.
Constructors
Name | Description
TemporarySystemVariables
 Initializes a new instance of the TemporarySystemVariables class.
Top
Properties
Name | Description
Item
 Gets or sets the Object with the specified name.
 (Overrides Settings.SystemVariables.Item[String].)
Top
Methods
Name | Description
Dispose
 Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.Core Namespace