AcMgd Extension Library- v20.1
ObjectOverrule<T> Methods
The ObjectOverrule<T> generic type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
ObjectOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace