AcMgd Extension Library- v20.1
DisplayScrollBars Constructor
 Initializes a new instance of the DisplayScrollBars class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public DisplayScrollBars(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
DisplayScrollBars(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> DisplayScrollBars
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
DisplayScrollBars Class
Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay Namespace