AcExtentionLibrary - v20.1
CommandClass Methods
The CommandClass type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace