Autocad Extension Framework Documentation - v20.1
TemporarySystemVariables Methods
The TemporarySystemVariables type exposes the following members.
Methods
Name | Description
Dispose
 Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
TemporarySystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace