Autocad Extension Framework Documentation - v20.1
EditorExtensions.WriteLine Method
Overload List
Name | Description
WriteLine(Editor)
 Writes the line.
WriteLine(Editor, ObjectId)
 Writes the line.
WriteLine(Editor, Point2d)
 Writes the line.
WriteLine(Editor, Point3d)
 Writes the line.
WriteLine(Editor, Boolean)
 Writes the line.
WriteLine(Editor, Char)
 Writes the line.
WriteLine(Editor, Char[])
 Writes the line.
WriteLine(Editor, IEnumerable<Object>)
 Writes the line.
WriteLine(Editor, IEnumerable<String>)
 Writes the line.
WriteLine<T>(Editor, IEnumerable<T>)
 Writes the line.
WriteLine(Editor, Decimal)
 Writes the line.
WriteLine(Editor, Double)
 Writes the line.
WriteLine(Editor, Int32)
 Writes the line.
WriteLine(Editor, Int64)
 Writes the line.
WriteLine(Editor, Object)
 Writes the line.
WriteLine(Editor, Single)
 Writes the line.
WriteLine(Editor, String)
 Writes the line.
WriteLine(Editor, String, Object)
 Writes the line.
WriteLine(Editor, String, Object[])
 Writes the line.
WriteLine(Editor, Char[], Int32, Int32)
 Writes the line.
WriteLine(Editor, String, Object, Object)
 Writes the line.
WriteLine(Editor, String, Object, Object, Object)
 Writes the line.
Top
See Also
Reference
EditorExtensions Class
Autodesk.AutoCAD.EditorInput Namespace