AcExtensionLibrary - v20.1
DocumentExtensions.CreatePreviewIcon Method
 Creates the preview icon.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void CreatePreviewIcon(
	this BlockTableRecord btr
)
<ExtensionAttribute>
Public Shared Sub CreatePreviewIcon (
	btr As BlockTableRecord
)
public:
[ExtensionAttribute]
static void CreatePreviewIcon(
	BlockTableRecord^ btr
)
[<ExtensionAttribute>]
static member CreatePreviewIcon :
        btr : BlockTableRecord -> unit
Parameters
btr
Type: BlockTableRecord
The BTR.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DocumentExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace