Autocad Extension Framework Documentation - v20.1
SymbolTableRecordFilterExtensions Methods
The SymbolTableRecordFilterExtensions type exposes the following members.
Methods
Name | Description
IsSet
 Determines whether the specified test flag is set.
Top
See Also
Reference
SymbolTableRecordFilterExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace