AcExtensionLibrary - v20.1
OsnapOverrule<T> Properties
The OsnapOverrule<T> generic type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
See Also
Reference
OsnapOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace