Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.CLAYER Property
 Gets or sets the clayer.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string CLAYER { get; set; }
Public Property CLAYER As String
	Get
	Set
public:
property String^ CLAYER {
	String^ get ();
	void set (String^ value);
}
member CLAYER : string with get, set
Property Value
Type: String
 The clayer.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace