Autocad Extension Framework Documentation - v20.1
BlockTableExtensions Methods
Methods
Name | Description
GetBlockTableRecords(BlockTable, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
GetBlockTableRecords(BlockTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
GetUserCreatedBlockTableRecords(BlockTable, OpenMode)
 Gets the user created block table records.
GetUserCreatedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user created block table records.
GetUserDefinedBlockTableRecords(BlockTable, OpenMode)
 Gets the user defined block table records.
GetUserDefinedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user defined block table records.
Top
See Also
Reference
BlockTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace