AcExtensionLibrary - v20.1
DBObjectExtensions.HasExtensionDictionary Method
 Determines whether [has extension dictionary].
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static bool HasExtensionDictionary(
	this DBObject dbObj
)
<ExtensionAttribute>
Public Shared Function HasExtensionDictionary (
	dbObj As DBObject
) As Boolean
public:
[ExtensionAttribute]
static bool HasExtensionDictionary(
	DBObject^ dbObj
)
[<ExtensionAttribute>]
static member HasExtensionDictionary :
        dbObj : DBObject -> bool
Parameters
dbObj
Type: DBObject
The database object.
Return Value
Type: Boolean
true if has a extension dictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace