Autocad Extension Framework Documentation - v20.1
PageSetupOverridesTemplateFile Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PageSetupOverridesTemplateFile
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class PageSetupOverridesTemplateFile
Public Class PageSetupOverridesTemplateFile
public ref class PageSetupOverridesTemplateFile
type PageSetupOverridesTemplateFile =  class end
The PageSetupOverridesTemplateFile type exposes the following members.
Constructors
Name | Description
PageSetupOverridesTemplateFile
 Initializes a new instance of the PageSetupOverridesTemplateFile class.
Top
Properties
Name | Description
Path
 Gets or sets the path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace