Autocad Extension Framework Documentation - v20.1
ProxyEntityExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.ProxyEntityExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class ProxyEntityExtensions
<ExtensionAttribute>
Public NotInheritable Class ProxyEntityExtensions
[ExtensionAttribute]
public ref class ProxyEntityExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type ProxyEntityExtensions =  class end
The ProxyEntityExtensions type exposes the following members.
Methods
Name | Description
IsErasable
 Determines whether this instance is erasable.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace