Autocad Extension Framework Documentation - v20.1
CurveExtensions.GetLength Method
 Slighty modified from original author Tony Tanzillo
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static double GetLength(
	this Curve curve
)
<ExtensionAttribute>
Public Shared Function GetLength (
	curve As Curve
) As Double
public:
[ExtensionAttribute]
static double GetLength(
	Curve^ curve
)
[<ExtensionAttribute>]
static member GetLength :
        curve : Curve -> float
Parameters
curve
Type: Curve
The curve.
Return Value
Type: Double
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentNullException | Curve was Null
See Also
Reference
CurveExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace