AcExtentionLibrary - v20.1
DatabaseExtensions.UcsTable Method (Database, Transaction, OpenMode)
 Ucses the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static UcsTable UcsTable(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function UcsTable (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As UcsTable
public:
[ExtensionAttribute]
static UcsTable^ UcsTable(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member UcsTable :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> UcsTable
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: UcsTable
UcsTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
UcsTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace