AcExtensionLibrary - v20.1
AcadDirectory.GetHashCode Method
 Returns a hash code for this instance.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
public:
virtual int GetHashCode() override
abstract GetHashCode : unit -> int
override GetHashCode : unit -> int
Return Value
Type: Int32
 A hash code for this instance, suitable for use in hashing algorithms and data structures like a hash table.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace