AcExtensionLibrary - v20.1
DatabaseExtensions.LayerTable Method (Database, OpenMode)
 Layers the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static LayerTable LayerTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function LayerTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As LayerTable
public:
[ExtensionAttribute]
static LayerTable^ LayerTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member LayerTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> LayerTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: LayerTable
LayerTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
LayerTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace