AcExtensionLibrary - v20.1
SupportPath.RemoveAll Method
 Removes all.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public int RemoveAll(
	Predicate<string> match
)
Public Function RemoveAll (
	match As Predicate(Of String)
) As Integer
public:
int RemoveAll(
	Predicate<String^>^ match
)
member RemoveAll :
        match : Predicate<string> -> int
Parameters
match
Type: System.Predicate<String>
The match.
Return Value
Type: Int32
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace