AcExtentionLibrary - v20.1
Preferences.TemplateDWGPath Property
 Gets the template DWG path.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static TemplateDWGPath TemplateDWGPath { get; }
Public Shared ReadOnly Property TemplateDWGPath As TemplateDWGPath
	Get
public:
static property TemplateDWGPath^ TemplateDWGPath {
	TemplateDWGPath^ get ();
}
static member TemplateDWGPath : TemplateDWGPath with get
Property Value
Type: TemplateDWGPath
 The template DWG path.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace