AcExtentionLibrary - v20.1
SCMTimeValue.TimeLength Property
 Gets or sets the length of the time.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesUser
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public int TimeLength { get; set; }
Public Property TimeLength As Integer
	Get
	Set
public:
property int TimeLength {
	int get ();
	void set (int value);
}
member TimeLength : int with get, set
Property Value
Type: Int32
 The length of the time.
See Also
Reference
SCMTimeValue Class
Autodesk.AutoCAD.ApplicationServices.PreferencesUser Namespace