AcMgd Extension Library- v20.1
Settings.SystemVariables.ATTREQ Property
 Gets or sets a value indicating whether this Settings.SystemVariables is attreq.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool ATTREQ { get; set; }
Public Property ATTREQ As Boolean
	Get
	Set
public:
property bool ATTREQ {
	bool get ();
	void set (bool value);
}
member ATTREQ : bool with get, set
Property Value
Type: Boolean
true if attreq; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace