AcExtensionLibrary - v20.1
DatabaseExtensions.ViewTable Method (Database, Transaction, OpenMode)
 Views the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ViewTable ViewTable(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function ViewTable (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As ViewTable
public:
[ExtensionAttribute]
static ViewTable^ ViewTable(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member ViewTable :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> ViewTable
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: ViewTable
ViewTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
ViewTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace