AcMgd Extension Library- v20.1
AcTransaction
Required introduction
AcTransaction
          namespace Autodesk.AutoCAD.DatabaseServices
{
    using Autodesk.AutoCAD.Runtime;
    using System;
    using System.Runtime.CompilerServices;
    using System.Runtime.InteropServices;
    [Wrapper("AcTransaction")]
    public class Transaction : RXObject
    {
        protected internal Transaction(IntPtr unmanagedPointer, [MarshalAs(UnmanagedType.U1)] bool autoDelete) : base(unmanagedPointer, autoDelete)
        {
        }
        public virtual unsafe void Abort()
        {
            this.CheckTopTransaction();
            AcDbTransactionManager* modopt(CallConvCdecl) local1 = AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj());
            int num = (int) *local1[0][0x48L](local1);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            base.AutoDelete = false;
        }
        public virtual void AddNewlyCreatedDBObject(DBObject obj, [MarshalAs(UnmanagedType.U1)] bool add)
        {
            this.TransactionManager.AddNewlyCreatedDBObject(obj, add);
        }
        private unsafe void CheckTopTransaction()
        {
            AcDbTransactionManager* managerPtr = AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj());
            if (this.GetImpObj() != **(((long*) managerPtr))[0x58L](managerPtr))
            {
                throw new InvalidOperationException();
            }
        }
        public virtual unsafe void Commit()
        {
            this.CheckTopTransaction();
            AcDbTransactionManager* modopt(CallConvCdecl) local1 = AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj());
            int num = (int) *local1[0][0x40L](local1);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            base.AutoDelete = false;
        }
        protected override unsafe void DeleteUnmanagedObject()
        {
            this.CheckTopTransaction();
            AcDbTransactionManager* modopt(CallConvCdecl) local1 = AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj());
            int num = (int) *local1[0][0x48L](local1);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
        }
        public unsafe DBObjectCollection GetAllObjects()
        {
            DBObjectCollection objects = new DBObjectCollection();
            AcTransaction* impObj = this.GetImpObj();
            int num = (int) **(((long*) impObj))[0x48L](impObj, objects.GetImpObj());
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            return objects;
        }
        internal unsafe AcTransaction* GetImpObj()
        {
            return (AcTransaction*) base.GetImpObj();
        }
        public virtual unsafe DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode)
        {
            this.CheckTopTransaction();
            return Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObjectInternal(AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj()), id, mode, false, false);
        }
        public virtual unsafe DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode, [MarshalAs(UnmanagedType.U1)] bool openErased)
        {
            this.CheckTopTransaction();
            return Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObjectInternal(AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj()), id, mode, openErased, false);
        }
        public virtual unsafe DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode, [MarshalAs(UnmanagedType.U1)] bool openErased, [MarshalAs(UnmanagedType.U1)] bool forceOpenOnLockedLayer)
        {
            this.CheckTopTransaction();
            return Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObjectInternal(AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj()), id, mode, openErased, forceOpenOnLockedLayer);
        }
        public virtual Autodesk.AutoCAD.DatabaseServices.TransactionManager TransactionManager
        {
            get
            {
                IntPtr unmanagedPointer = new IntPtr(AcDbImpTransaction.transactionManager((AcDbImpTransaction* modopt(IsConst) modopt(IsConst)) this.GetImpObj()));
                return (Autodesk.AutoCAD.DatabaseServices.TransactionManager) RXObject.Create(unmanagedPointer, false);
            }
        }
    }
}
AppTransaction
namespace Autodesk.AutoCAD.ApplicationServices
{
    using Autodesk.AutoCAD.DatabaseServices;
    using System;
    using System.Runtime.InteropServices;
    internal sealed class AppTransaction : Transaction
    {
        private Autodesk.AutoCAD.ApplicationServices.TransactionManager m_mgr;
        protected internal AppTransaction(IntPtr unmanagedPointer, [MarshalAs(UnmanagedType.U1)] bool autoDelete, Autodesk.AutoCAD.ApplicationServices.TransactionManager mgr) : base(unmanagedPointer, autoDelete)
        {
            this.m_mgr = mgr;
        }
        public sealed override void Commit()
        {
            base.Commit();
            ((Autodesk.AutoCAD.ApplicationServices.TransactionManager) this.TransactionManager).FlushGraphics();
        }
        public override Autodesk.AutoCAD.DatabaseServices.TransactionManager TransactionManager
        {
            get
            {
                return this.m_mgr;
            }
        }
    }
}