AcMgd Extension Library- v20.1
Settings.SystemVariables.PICKSTYLE Property
 Gets or sets the pickstyle.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short PICKSTYLE { get; set; }
Public Property PICKSTYLE As Short
	Get
	Set
public:
property short PICKSTYLE {
	short get ();
	void set (short value);
}
member PICKSTYLE : int16 with get, set
Property Value
Type: Int16
 The pickstyle.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace