AcExtentionLibrary - v20.1
Settings.SystemVariables.WSAUTOSAVE Property
 Gets or sets a value indicating whether this Settings.SystemVariables is wsautosave.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool WSAUTOSAVE { get; set; }
Public Property WSAUTOSAVE As Boolean
	Get
	Set
public:
property bool WSAUTOSAVE {
	bool get ();
	void set (bool value);
}
member WSAUTOSAVE : bool with get, set
Property Value
Type: Boolean
true if wsautosave; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace