Autocad Extension Framework Documentation - v20.1
AllowedClassFilter Methods
The AllowedClassFilter type exposes the following members.
Methods
Name | Description
AddAllowedClass
 Adds the allowed class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
AllowedClassFilter Class
Autodesk.AutoCAD.EditorInput Namespace