AcMgd Extension Library- v20.1
EnviromentVariables.QnewTemplate Property
 Gets or sets the qnew template.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static string QnewTemplate { get; set; }
Public Shared Property QnewTemplate As String
	Get
	Set
public:
static property String^ QnewTemplate {
	String^ get ();
	void set (String^ value);
}
static member QnewTemplate : string with get, set
Property Value
Type: String
 The qnew template.
See Also
Reference
EnviromentVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace