Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.ViewportTable Method (Database, OpenMode)
 Viewports the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ViewportTable ViewportTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function ViewportTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As ViewportTable
public:
[ExtensionAttribute]
static ViewportTable^ ViewportTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member ViewportTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> ViewportTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: ViewportTable
ViewportTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
ViewportTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace