Autocad Extension Framework Documentation - v20.1
SupportPath.Contains Method
 Determines whether [contains] [the specified path].
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public bool Contains(
	string path
)
Public Function Contains (
	path As String
) As Boolean
public:
virtual bool Contains(
	String^ path
) sealed
abstract Contains :
        path : string -> bool
override Contains :
        path : string -> bool
Parameters
path
Type: System.String
The path.
Return Value
Type: Boolean
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace