AcMgd Extension Library- v20.1
BlockTableRecordExtensions.GetObjectIds<T> Method (BlockTableRecord)
 Returns a enumerable of ObjectsIds contained
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<ObjectId> GetObjectIds<T>(
	this BlockTableRecord btr
)
where T : Entity
<ExtensionAttribute>
Public Shared Function GetObjectIds(Of T As Entity) (
	btr As BlockTableRecord
) As IEnumerable(Of ObjectId)
public:
[ExtensionAttribute]
generic<typename T>
where T : Entity
static IEnumerable<ObjectId>^ GetObjectIds(
	BlockTableRecord^ btr
)
[<ExtensionAttribute>]
static member GetObjectIds :
        btr : BlockTableRecord -> IEnumerable<ObjectId>  when 'T : Entity
Parameters
btr
Type: BlockTableRecord
The BTR.
Type Parameters
T
Return Value
Type: IEnumerable<ObjectId>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
GetObjectIds Overload
Autodesk.AutoCAD.DatabaseServices Namespace