AcExtentionLibrary - v20.1
Settings.SystemVariables.CLAYERID Property
 Gets or sets the clayerid.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public ObjectId CLAYERID { get; set; }
Public Property CLAYERID As ObjectId
	Get
	Set
public:
property ObjectId CLAYERID {
	ObjectId get ();
	void set (ObjectId value);
}
member CLAYERID : ObjectId with get, set
Property Value
Type: ObjectId
 The clayerid.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace