AcMgd Extension Library- v20.1
BlockTableRecordExtensions.GetObjectIds Method
Overload List
Name | Description
GetObjectIds<T>(BlockTableRecord)
 Returns a enumerable of ObjectsIds contained
GetObjectIds(BlockTableRecord)
 Gets the object ids.
Top
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace