AcExtensionLibrary - v20.1
SymbolTableRecordExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class SymbolTableRecordExtensions
<ExtensionAttribute>
Public NotInheritable Class SymbolTableRecordExtensions
[ExtensionAttribute]
public ref class SymbolTableRecordExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type SymbolTableRecordExtensions =  class end
The SymbolTableRecordExtensions type exposes the following members.
Methods
Name | Description
Names
 Nameses the specified source.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace