AcExtentionLibrary - v20.1
ICommandClass.Ed Property
 Gets the ed.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
Editor Ed { get; }
ReadOnly Property Ed As Editor
	Get
property Editor^ Ed {
	Editor^ get ();
}
abstract Ed : Editor with get
Property Value
Type: Editor
 The ed.
See Also
Reference
ICommandClass Interface
Autodesk.AutoCAD.Runtime Namespace