AcMgd Extension Library- v20.1
QNewTemplateFile Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.QNewTemplateFile
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class QNewTemplateFile
Public Class QNewTemplateFile
public ref class QNewTemplateFile
type QNewTemplateFile =  class end
The QNewTemplateFile type exposes the following members.
Constructors
Name | Description
QNewTemplateFile
 Initializes a new instance of the QNewTemplateFile class.
Top
Properties
Name | Description
Path
 Gets or sets the path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace