AcExtentionLibrary - v20.1
DatabaseExtensions.NamedObjectDBDictionary Method
Overload List
Name | Description
NamedObjectDBDictionary(Database, OpenMode)
 Nameds the object database dictionary.
NamedObjectDBDictionary(Database, Transaction, OpenMode)
 Nameds the object database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace