AcMgd Extension Library- v20.1
SupportPath Constructor
 Initializes a new instance of the SupportPath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public SupportPath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
SupportPath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> SupportPath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace