Autocad Extension Framework Documentation - v20.1
LinetypeTableExtensions.GetLinetypeTableRecords Method
Overload List
Name | Description
GetLinetypeTableRecords(LinetypeTable, OpenMode, SymbolTableRecordFilter)
 Gets the linetype table records.
GetLinetypeTableRecords(LinetypeTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the linetype table records.
Top
See Also
Reference
LinetypeTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace