AcMgd Extension Library- v20.1
Preferences.DisplayScrollBars Property
 Gets the display scroll bars.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static DisplayScrollBars DisplayScrollBars { get; }
Public Shared ReadOnly Property DisplayScrollBars As DisplayScrollBars
	Get
public:
static property DisplayScrollBars^ DisplayScrollBars {
	DisplayScrollBars^ get ();
}
static member DisplayScrollBars : DisplayScrollBars with get
Property Value
Type: DisplayScrollBars
 The display scroll bars.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace