Autocad Extension Framework Documentation - v20.1
TransactionManagerExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.TransactionManagerExtensions
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class TransactionManagerExtensions
<ExtensionAttribute>
Public NotInheritable Class TransactionManagerExtensions
[ExtensionAttribute]
public ref class TransactionManagerExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type TransactionManagerExtensions =  class end
Methods
Name | Description
StartLockedTransaction(TransactionManager)
 Stars the locked transaction.
StartLockedTransaction(TransactionManager, DocumentLockMode, String, String, Boolean)
 Stars the locked transaction.
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices Namespace