AcExtensionLibrary - v20.1
MenuFile Constructor
 Initializes a new instance of the MenuFile class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public MenuFile(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
MenuFile(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> MenuFile
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
MenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace