AcExtentionLibrary - v20.1
EnviromentVariables Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.Core.EnviromentVariables
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class EnviromentVariables
Public NotInheritable Class EnviromentVariables
public ref class EnviromentVariables abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type EnviromentVariables =  class end
The EnviromentVariables type exposes the following members.
Properties
Name | Description
ACAD
 Gets or sets the acad.
QnewTemplate
 Gets or sets the qnew template.
SheetSetTemplatePath
 Gets or sets the sheet set template path.
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.Core Namespace