AcExtentionLibrary - v20.1
DatabaseExtensions.UcsTable Method
Overload List
Name | Description
UcsTable(Database, OpenMode)
 Ucses the table.
UcsTable(Database, Transaction, OpenMode)
 Ucses the table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace