Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.STARTMODE Property
 Gets or sets a value indicating whether this Settings.SystemVariables is startmode.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public bool STARTMODE { get; set; }
Public Property STARTMODE As Boolean
	Get
	Set
public:
property bool STARTMODE {
	bool get ();
	void set (bool value);
}
member STARTMODE : bool with get, set
Property Value
Type: Boolean
true if startmode; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace