AcExtentionLibrary - v20.1
DatabaseExtensions.StandardTextStyle Method
 Standards the text style.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ObjectId StandardTextStyle(
	this Database database
)
<ExtensionAttribute>
Public Shared Function StandardTextStyle (
	database As Database
) As ObjectId
public:
[ExtensionAttribute]
static ObjectId StandardTextStyle(
	Database^ database
)
[<ExtensionAttribute>]
static member StandardTextStyle :
        database : Database -> ObjectId
Parameters
database
Type: Database
The database.
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace