AcExtensionLibrary - v20.1
LinetypeTableExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.LinetypeTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class LinetypeTableExtensions
<ExtensionAttribute>
Public NotInheritable Class LinetypeTableExtensions
[ExtensionAttribute]
public ref class LinetypeTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type LinetypeTableExtensions =  class end
Methods
Name | Description
GetLinetypeTableRecords(LinetypeTable, OpenMode, SymbolTableRecordFilter)
 Gets the linetype table records.
GetLinetypeTableRecords(LinetypeTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the linetype table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace