AcExtensionLibrary - v20.1
BlockTableExtensions.GetUserCreatedBlockTableRecords Method (BlockTable, Transaction, OpenMode)
 Gets the user created block table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<BlockTableRecord> GetUserCreatedBlockTableRecords(
	this BlockTable symbolTbl,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function GetUserCreatedBlockTableRecords (
	symbolTbl As BlockTable,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead
) As IEnumerable(Of BlockTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<BlockTableRecord^>^ GetUserCreatedBlockTableRecords(
	BlockTable^ symbolTbl,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member GetUserCreatedBlockTableRecords :
        symbolTbl : BlockTable *
        trx : Transaction *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> IEnumerable<BlockTableRecord>
Parameters
symbolTbl
Type: BlockTable
The symbol table.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: IEnumerable<BlockTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableExtensions Class
GetUserCreatedBlockTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace