AcMgd Extension Library- v20.1
Settings.SystemVariables.MENUNAME Property
 Gets the menuname.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string MENUNAME { get; }
Public ReadOnly Property MENUNAME As String
	Get
public:
property String^ MENUNAME {
	String^ get ();
}
member MENUNAME : string with get
Property Value
Type: String
 The menuname.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace