AcExtensionLibrary - v20.1
DatabaseExtensions.StandardMLeaderStyle Method (Database, Transaction)
 Standards the m leader style.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ObjectId StandardMLeaderStyle(
	this Database database,
	Transaction transaction
)
<ExtensionAttribute>
Public Shared Function StandardMLeaderStyle (
	database As Database,
	transaction As Transaction
) As ObjectId
public:
[ExtensionAttribute]
static ObjectId StandardMLeaderStyle(
	Database^ database,
	Transaction^ transaction
)
[<ExtensionAttribute>]
static member StandardMLeaderStyle :
        database : Database *
        transaction : Transaction -> ObjectId
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
StandardMLeaderStyle Overload
Autodesk.AutoCAD.DatabaseServices Namespace