Autocad Extension Framework Documentation - v20.1
OsnapOverrule<T>.Status Property
 Gets or sets the status.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public OverruleStatus Status { get; set; }
Public Property Status As OverruleStatus
	Get
	Set
public:
property OverruleStatus Status {
	OverruleStatus get ();
	void set (OverruleStatus value);
}
member Status : OverruleStatus with get, set
Property Value
Type: OverruleStatus
 The status.
See Also
Reference
OsnapOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace