AcExtentionLibrary - v20.1
EditorExtensions.Write Method (Editor, IEnumerable<String>)
 Writes the specified value.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void Write(
	this Editor ed,
	IEnumerable<string> value
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	value As IEnumerable(Of String)
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	IEnumerable<String^>^ value
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        value : IEnumerable<string> -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: System.Collections.Generic.IEnumerable<String>
The value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace