Autocad Extension Framework Documentation - v20.1
LayerTableRecordExtensions.LayerNameTypedValue Method
 Layers the name typed value.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static TypedValue LayerNameTypedValue(
	this Entity ent
)
<ExtensionAttribute>
Public Shared Function LayerNameTypedValue (
	ent As Entity
) As TypedValue
public:
[ExtensionAttribute]
static TypedValue LayerNameTypedValue(
	Entity^ ent
)
[<ExtensionAttribute>]
static member LayerNameTypedValue :
        ent : Entity -> TypedValue
Parameters
ent
Type: Entity
The ent.
Return Value
Type: TypedValue
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Entity. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
LayerTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace