Autocad Extension Framework Documentation - v20.1
Extents3dExtensions Methods
The Extents3dExtensions type exposes the following members.
Methods
Name | Description
CenterPoint
 Centers the point.
Top
See Also
Reference
Extents3dExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace