AcMgd Extension Library- v20.1
Settings.SystemVariables.TEXTEVAL Property
 Gets or sets a value indicating whether this Settings.SystemVariables is texteval.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool TEXTEVAL { get; set; }
Public Property TEXTEVAL As Boolean
	Get
	Set
public:
property bool TEXTEVAL {
	bool get ();
	void set (bool value);
}
member TEXTEVAL : bool with get, set
Property Value
Type: Boolean
true if texteval; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace