Autocad Extension Framework Documentation - v20.1
EnviromentVariables Properties
The EnviromentVariables type exposes the following members.
Properties
Name | Description
ACAD
 Gets or sets the acad.
QnewTemplate
 Gets or sets the qnew template.
SheetSetTemplatePath
 Gets or sets the sheet set template path.
Top
See Also
Reference
EnviromentVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace