AcExtentionLibrary - v20.1
DBObjectExtensions.TryGetExtensionDictionaryId Method
 Tries the get extension dictionary ObjectId.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static bool TryGetExtensionDictionaryId(
	this DBObject dbObj,
	out ObjectId id
)
<ExtensionAttribute>
Public Shared Function TryGetExtensionDictionaryId (
	dbObj As DBObject,
	<OutAttribute> ByRef id As ObjectId
) As Boolean
public:
[ExtensionAttribute]
static bool TryGetExtensionDictionaryId(
	DBObject^ dbObj,
	[OutAttribute] ObjectId% id
)
[<ExtensionAttribute>]
static member TryGetExtensionDictionaryId :
        dbObj : DBObject *
        id : ObjectId byref -> bool
Parameters
dbObj
Type: DBObject
The database object.
id
Type: ObjectId
The identifier.
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace