Autocad Extension Framework Documentation - v20.1
DisplayScrollBars Methods
The DisplayScrollBars type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
DisplayScrollBars Class
Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay Namespace