Autocad Extension Framework Documentation - v20.1
LockedTransaction Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Transaction
 Autodesk.AutoCAD.Runtime.LockedTransaction
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class LockedTransaction : Transaction
Public Class LockedTransaction
	Inherits Transaction
public ref class LockedTransaction : public Transaction
type LockedTransaction =
    class
        inherit Transaction
    end
The LockedTransaction type exposes the following members.
Constructors
Name | Description
LockedTransaction
 Initializes a new instance of the LockedTransaction class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace