AcExtentionLibrary - v20.1
BlockTableExtensions.GetUserCreatedBlockTableRecords Method
Overload List
Name | Description
GetUserCreatedBlockTableRecords(BlockTable, OpenMode)
 Gets the user created block table records.
GetUserCreatedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user created block table records.
Top
See Also
Reference
BlockTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace