AcExtensionLibrary - v20.1
LayerTableExtensions.GetLayerTableRecords Method
Overload List
Name | Description
GetLayerTableRecords(LayerTable, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
GetLayerTableRecords(LayerTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
Top
See Also
Reference
LayerTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace