AcExtentionLibrary - v20.1
BlockTableRecordExtensions.UserCreatedBlocks Method
 User Created Blocks are any blocks that are created by user or from a user block created by a user. It This includes anonymous blocks
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<BlockTableRecord> UserCreatedBlocks(
	this IEnumerable<BlockTableRecord> source
)
<ExtensionAttribute>
Public Shared Function UserCreatedBlocks (
	source As IEnumerable(Of BlockTableRecord)
) As IEnumerable(Of BlockTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<BlockTableRecord^>^ UserCreatedBlocks(
	IEnumerable<BlockTableRecord^>^ source
)
[<ExtensionAttribute>]
static member UserCreatedBlocks :
        source : IEnumerable<BlockTableRecord> -> IEnumerable<BlockTableRecord>
Parameters
source
Type: System.Collections.Generic.IEnumerable<BlockTableRecord>
The source.
Return Value
Type: IEnumerable<BlockTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<BlockTableRecord>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace