AcMgd Extension Library- v20.1
Settings.SystemVariables.APERTURE Property
 Gets or sets the aperture.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short APERTURE { get; set; }
Public Property APERTURE As Short
	Get
	Set
public:
property short APERTURE {
	short get ();
	void set (short value);
}
member APERTURE : int16 with get, set
Property Value
Type: Int16
 The aperture.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace