AcMgd Extension Library- v20.1
ICommandClass.Db Property
 Gets the database.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
Database Db { get; }
ReadOnly Property Db As Database
	Get
property Database^ Db {
	Database^ get ();
}
abstract Db : Database with get
Property Value
Type: Database
 The database.
See Also
Reference
ICommandClass Interface
Autodesk.AutoCAD.Runtime Namespace