AcExtentionLibrary - v20.1
ObjectIdCollectionExtensions.Where Method
Overload List
Name | Description
Where<T>(ObjectIdCollection, Func<T, Boolean>)
 Wheres the specified predicate.
Where<T>(ObjectIdCollection, Transaction, Func<T, Boolean>)
 Wheres the specified TRX.
Top
See Also
Reference
ObjectIdCollectionExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace