AcExtentionLibrary - v20.1
AcadDirectory.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines whether the specified Object, is equal to this instance.
 (Overrides Object.Equals(Object).)
Equals(AcadDirectory)
 Equalses the specified other.
Top
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace