AcExtentionLibrary - v20.1
PerDocData Constructor
 Initializes a new instance of the PerDocData class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public PerDocData(
	Document doc
)
Public Sub New (
	doc As Document
)
public:
PerDocData(
	Document^ doc
)
new :
        doc : Document -> PerDocData
Parameters
doc
Type: Document
The document.
See Also
Reference
PerDocData Class
Autodesk.AutoCAD.Runtime Namespace