Autocad Extension Framework Documentation - v20.1
GroupDictionary Constructor
 Initializes a new instance of the GroupDictionary class.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public GroupDictionary(
	Transaction trx,
	DBDictionary dic,
	bool includingErased
)
Public Sub New (
	trx As Transaction,
	dic As DBDictionary,
	includingErased As Boolean
)
public:
GroupDictionary(
	Transaction^ trx,
	DBDictionary^ dic,
	bool includingErased
)
new :
        trx : Transaction *
        dic : DBDictionary *
        includingErased : bool -> GroupDictionary
Parameters
trx
Type: Transaction
The TRX.
dic
Type: DBDictionary
The dic.
includingErased
Type: System.Boolean
if set to true [including erased].
See Also
Reference
GroupDictionary Class
Autodesk.AutoCAD.DatabaseServices Namespace