Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.Core.Settings.SystemVariables
 Autodesk.AutoCAD.ApplicationServices.Core.TemporarySystemVariables
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class SystemVariables
Public Class SystemVariables
public ref class SystemVariables
type SystemVariables =  class end
The Settings.SystemVariables type exposes the following members.
Properties
Name | Description
APERTURE
 Gets or sets the aperture.
ATTDIA
 Gets or sets a value indicating whether this Settings.SystemVariables is attdia.
ATTREQ
 Gets or sets a value indicating whether this Settings.SystemVariables is attreq.
BLOCKEDITOR
 Gets a value indicating whether this Settings.SystemVariables is blockeditor.
CLAYER
 Gets or sets the clayer.
CLAYERID
 Gets or sets the clayerid.
CMDECHO
 Gets or sets a value indicating whether this Settings.SystemVariables is cmdecho.
CMDNAMES
 Gets the cmdnames.
CMLEADERSTYLE
 Gets or sets the cmleaderstyle.
CTAB
 Gets or sets the ctab.
CURSORSIZE
 Gets or sets the cursorsize.
CVPORT
 Gets or sets the cvport.
DCTCUST
 Gets or sets the dctcust.
DWGNAME
 Gets the dwgname.
DWGPREFIX
 Gets the dwgprefix.
DWGTITLED
 Gets a value indicating whether this Settings.SystemVariables is dwgtitled.
FILEDIA
 Gets or sets a value indicating whether this Settings.SystemVariables is filedia.
GROUPDISPLAYMODE
 Gets or sets the groupdisplaymode.
INSUNITS
 Gets or sets the insunits.
Item
 Gets or sets the Object with the specified name.
LWUNITS
 Gets or sets the lwunits.
MENUNAME
 Gets the menuname.
MLEADERSCALE
 Gets or sets the mleaderscale.
NEXTFIBERWORLD
 Gets or sets a value indicating whether this Settings.SystemVariables is nextfiberworld.
OSMODE
 Gets or sets the osmode.
PICKSTYLE
 Gets or sets the pickstyle.
SAVETIME
 Gets or sets the savetime.
SHORTCUTMENU
 Gets or sets the shortcutmenu.
STARTMODE
 Gets or sets a value indicating whether this Settings.SystemVariables is startmode.
STARTUP
 Gets or sets the startup.
TEXTALLCAPS
 Gets or sets a value indicating whether this Settings.SystemVariables is textallcaps.
TEXTEVAL
 Gets or sets a value indicating whether this Settings.SystemVariables is texteval.
TEXTSIZE
 Gets or sets the textsize.
TEXTSTYLE
 Gets or sets the textstyle.
UCSFOLLOW
 Gets or sets a value indicating whether this Settings.SystemVariables is ucsfollow.
WSAUTOSAVE
 Gets or sets a value indicating whether this Settings.SystemVariables is wsautosave.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.Core Namespace