AcMgd Extension Library- v20.1
LayerTableExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.LayerTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class LayerTableExtensions
<ExtensionAttribute>
Public NotInheritable Class LayerTableExtensions
[ExtensionAttribute]
public ref class LayerTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type LayerTableExtensions =  class end
Methods
Name | Description
GetLayerTableRecords(LayerTable, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
GetLayerTableRecords(LayerTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace