AcExtentionLibrary - v20.1
Settings.SystemVariables.DWGPREFIX Property
 Gets the dwgprefix.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string DWGPREFIX { get; }
Public ReadOnly Property DWGPREFIX As String
	Get
public:
property String^ DWGPREFIX {
	String^ get ();
}
member DWGPREFIX : string with get
Property Value
Type: String
 The dwgprefix.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace