AcExtensionLibrary - v20.1
BlockTableRecordExtensions Class
 Extension Methods for BlockTableRecord class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.BlockTableRecordExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class BlockTableRecordExtensions
<ExtensionAttribute>
Public NotInheritable Class BlockTableRecordExtensions
[ExtensionAttribute]
public ref class BlockTableRecordExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type BlockTableRecordExtensions =  class end
The BlockTableRecordExtensions type exposes the following members.
Methods
Name | Description
GetAllBlockReferenceIds(BlockTableRecord, Boolean, Boolean)
 Gets all block reference ids.
GetAllBlockReferenceIds(BlockTableRecord, Transaction, Boolean, Boolean)
 Method for getting all blockreference Ids
GetAllBlockReferences(BlockTableRecord, Boolean, Boolean)
 Gets all block references.
GetAllBlockReferences(BlockTableRecord, Transaction, Boolean, Boolean)
 Gets all block references.
GetAttributeDefinitions(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the attribute definitions.
GetAttributeDefinitions(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute definitions.
GetEntities(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
GetEntities<T>(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities<T>(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
GetEntitiesAssignableFrom<T>(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the entities assignable from.
GetEntitiesAssignableFrom<T>(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
GetObjectIds(BlockTableRecord)
 Gets the object ids.
GetObjectIds<T>(BlockTableRecord)
 Returns a enumerable of ObjectsIds contained
NonDependent
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464529#msg464529 Use instead of UserDefinedBlocks when anonymous blocks are needed
UserCreatedBlocks
 User Created Blocks are any blocks that are created by user or from a user block created by a user. It This includes anonymous blocks
UserDefinedBlocks
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464529#msg464529
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace