AcMgd Extension Library- v20.1
ColorIndex Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum ColorIndex
Public Enumeration ColorIndex
public enum class ColorIndex
type ColorIndex
Members
Member name | Value | Description
BYBLOCK | 0 |  The byblock
Red | 1 |  The red
Yellow | 2 |  The yellow
Green | 3 |  The green
Cyan | 4 |  The cyan
Blue | 5 |  The blue
Magenta | 6 |  The magenta
White | 7 |  The white
BYLAYER | 256 |  The bylayer
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace