AcExtentionLibrary - v20.1
DatabaseExtensions.MLeaderStyleDBDictionary Method
Overload List
Name | Description
MLeaderStyleDBDictionary(Database, OpenMode)
 ms the leader style database dictionary.
MLeaderStyleDBDictionary(Database, Transaction, OpenMode)
 ms the leader style database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace