AcExtensionLibrary - v20.1
EditorExtensions.Write Method
Overload List
Name | Description
Write(Editor, ObjectId)
 Writes the specified value.
Write(Editor, Point2d)
 Writes the specified value.
Write(Editor, Point3d)
 Writes the specified value.
Write(Editor, Boolean)
 Writes the text representation of the specified Boolean val to the CommandLine
Write(Editor, Char)
 Writes the specified Unicode character val to the CommandLine
Write(Editor, Char[])
 Writes the specified subarray of Unicode characters to the CommandLine
Write(Editor, IEnumerable<Object>)
 Writes the specified value.
Write(Editor, IEnumerable<String>)
 Writes the specified value.
Write(Editor, Decimal)
 Writes the specified value.
Write(Editor, Double)
 Writes the specified value.
Write(Editor, Int32)
 Writes the specified value.
Write(Editor, Int64)
 Writes the specified value.
Write(Editor, Object)
 Writes the specified value.
Write(Editor, Single)
 Writes the specified value.
Write(Editor, String)
 Writes the specified value.
Write(Editor, String, Object)
 Writes the specified format.
Write(Editor, String, Object[])
 Writes the specified format.
Write(Editor, Char[], Int32, Int32)
 Writes the specified subarray of Unicode characters to the CommandLine
Write(Editor, String, Object, Object)
 Writes the specified format.
Write(Editor, String, Object, Object, Object)
 Writes the specified format.
Top
See Also
Reference
EditorExtensions Class
Autodesk.AutoCAD.EditorInput Namespace