AcMgd Extension Library- v20.1
ExtensionApplication Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.Runtime.ExtensionApplication
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public abstract class ExtensionApplication : IExtensionApplication
Public MustInherit Class ExtensionApplication
	Implements IExtensionApplication
public ref class ExtensionApplication abstract : IExtensionApplication
[<AbstractClassAttribute>]
type ExtensionApplication =
    class
        interface IExtensionApplication
    end
The ExtensionApplication type exposes the following members.
Methods
Name | Description
Initialize
 Initializes this instance.
Terminate
 Terminates this instance.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace