AcExtentionLibrary - v20.1
BlockTableRecordExtensions.NonDependent Method
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464529#msg464529 Use instead of UserDefinedBlocks when anonymous blocks are needed
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<BlockTableRecord> NonDependent(
	this IEnumerable<BlockTableRecord> source
)
<ExtensionAttribute>
Public Shared Function NonDependent (
	source As IEnumerable(Of BlockTableRecord)
) As IEnumerable(Of BlockTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<BlockTableRecord^>^ NonDependent(
	IEnumerable<BlockTableRecord^>^ source
)
[<ExtensionAttribute>]
static member NonDependent :
        source : IEnumerable<BlockTableRecord> -> IEnumerable<BlockTableRecord>
Parameters
source
Type: System.Collections.Generic.IEnumerable<BlockTableRecord>
The source.
Return Value
Type: IEnumerable<BlockTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<BlockTableRecord>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace