Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.GroupDBDictionary Method
Overload List
Name | Description
GroupDBDictionary(Database, OpenMode)
 Groups the database dictionary.
GroupDBDictionary(Database, Transaction, OpenMode)
 Groups the database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace