AcMgd Extension Library- v20.1
ObjectIdExtensions.GetDBObjects Method (IEnumerable<ObjectId>, OpenMode, Boolean)
 Gets the database objects.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<DBObject> GetDBObjects(
	this IEnumerable<ObjectId> ids,
	OpenMode mode = OpenMode.ForRead,
	bool openErased = false
)
<ExtensionAttribute>
Public Shared Function GetDBObjects (
	ids As IEnumerable(Of ObjectId),
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional openErased As Boolean = false
) As IEnumerable(Of DBObject)
public:
[ExtensionAttribute]
static IEnumerable<DBObject^>^ GetDBObjects(
	IEnumerable<ObjectId>^ ids,
	OpenMode mode = OpenMode::ForRead,
	bool openErased = false
)
[<ExtensionAttribute>]
static member GetDBObjects :
        ids : IEnumerable<ObjectId> *
        ?mode : OpenMode *
        ?openErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _openErased = defaultArg openErased false
*)
-> IEnumerable<DBObject>
Parameters
ids
Type: System.Collections.Generic.IEnumerable<ObjectId>
The ids.
mode (Optional)
Type: OpenMode
The mode.
openErased (Optional)
Type: System.Boolean
if set to true [open erased].
Return Value
Type: IEnumerable<DBObject>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<ObjectId>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentNullException | id is null
See Also
Reference
ObjectIdExtensions Class
GetDBObjects Overload
Autodesk.AutoCAD.DatabaseServices Namespace