AcExtensionLibrary - v20.1
AnnotationScaleExtensions.GetScaleFactor Method
 Returns Scale Factor(1.0 / AnnotationScale.Scale)
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static double GetScaleFactor(
	this AnnotationScale annoScale
)
<ExtensionAttribute>
Public Shared Function GetScaleFactor (
	annoScale As AnnotationScale
) As Double
public:
[ExtensionAttribute]
static double GetScaleFactor(
	AnnotationScale^ annoScale
)
[<ExtensionAttribute>]
static member GetScaleFactor :
        annoScale : AnnotationScale -> float
Parameters
annoScale
Type: AnnotationScale
Return Value
Type: Double
doubl that equals (1.0 / AnnotationScale.Scale)
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type AnnotationScale. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
AnnotationScaleExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace