AcExtentionLibrary - v20.1
ExtensionApplication.Initialize Method
 Initializes this instance.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public abstract void Initialize()
Public MustOverride Sub Initialize
public:
virtual void Initialize() abstract
abstract Initialize : unit -> unit
See Also
Reference
ExtensionApplication Class
Autodesk.AutoCAD.Runtime Namespace