AcExtentionLibrary - v20.1
AcadDirectory.Equals Method (Object)
 Determines whether the specified Object, is equal to this instance.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
Parameters
obj
Type: System.Object
The Object to compare with this instance.
Return Value
Type: Boolean
true if the specified Object is equal to this instance; otherwise, false.
See Also
Reference
AcadDirectory Class
Equals Overload
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace