AcExtentionLibrary - v20.1
DatabaseExtensions.GroupDictionary Method
Overload List
Name | Description
GroupDictionary(Database, OpenMode, Boolean)
 Groups the dictionary.
GroupDictionary(Database, Transaction, OpenMode, Boolean)
 Groups the dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace