Autocad Extension Framework Documentation - v20.1
BlockReferenceExtensions.GetAttributeReferences Method (BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute references.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<AttributeReference> GetAttributeReferences(
	this BlockReference bref,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
<ExtensionAttribute>
Public Shared Function GetAttributeReferences (
	bref As BlockReference,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false,
	Optional openObjectsOnLockedLayers As Boolean = false
) As IEnumerable(Of AttributeReference)
public:
[ExtensionAttribute]
static IEnumerable<AttributeReference^>^ GetAttributeReferences(
	BlockReference^ bref,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
[<ExtensionAttribute>]
static member GetAttributeReferences :
        bref : BlockReference *
        ?mode : OpenMode *
        ?includingErased : bool *
        ?openObjectsOnLockedLayers : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
        let _openObjectsOnLockedLayers = defaultArg openObjectsOnLockedLayers false
*)
-> IEnumerable<AttributeReference>
Parameters
bref
Type: BlockReference
The bref.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
openObjectsOnLockedLayers (Optional)
Type: System.Boolean
if set to true [open objects on locked layers].
Return Value
Type: IEnumerable<AttributeReference>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockReference. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockReferenceExtensions Class
GetAttributeReferences Overload
Autodesk.AutoCAD.DatabaseServices Namespace