Autocad Extension Framework Documentation - v20.1
ObjectIdCollectionExtensions.Add Method (ObjectIdCollection, ObjectIdCollection)
 Adds the specified ids.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void Add(
	this ObjectIdCollection thisIds,
	ObjectIdCollection ids
)
<ExtensionAttribute>
Public Shared Sub Add (
	thisIds As ObjectIdCollection,
	ids As ObjectIdCollection
)
public:
[ExtensionAttribute]
static void Add(
	ObjectIdCollection^ thisIds,
	ObjectIdCollection^ ids
)
[<ExtensionAttribute>]
static member Add :
        thisIds : ObjectIdCollection *
        ids : ObjectIdCollection -> unit
Parameters
thisIds
Type: ObjectIdCollection
The this ids.
ids
Type: ObjectIdCollection
The ids.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectIdCollection. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdCollectionExtensions Class
Add Overload
Autodesk.AutoCAD.DatabaseServices Namespace