AcExtensionLibrary - v20.1
EditorExtensions.Write Method (Editor, Int64)
 Writes the specified value.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void Write(
	this Editor ed,
	long value
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	value As Long
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	long long value
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        value : int64 -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: System.Int64
The value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace