AcMgd Extension Library- v20.1
ToolPalettePath Methods
The ToolPalettePath type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
ToolPalettePath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace