AcExtentionLibrary - v20.1
DatabaseExtensions.CurrentSpace Method (Database, Transaction, OpenMode)
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static BlockTableRecord CurrentSpace(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function CurrentSpace (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As BlockTableRecord
public:
[ExtensionAttribute]
static BlockTableRecord^ CurrentSpace(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member CurrentSpace :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> BlockTableRecord
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: BlockTableRecord
Returns the BlockTableRecord for the database's Current Space
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
CurrentSpace Overload
Autodesk.AutoCAD.DatabaseServices Namespace