Autocad Extension Framework Documentation - v20.1
BlockTableRecordExtensions.GetAllBlockReferenceIds Method (BlockTableRecord, Boolean, Boolean)
 Gets all block reference ids.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectIdCollection GetAllBlockReferenceIds(
	this BlockTableRecord btr,
	bool directOnly,
	bool forceValidity
)
<ExtensionAttribute>
Public Shared Function GetAllBlockReferenceIds (
	btr As BlockTableRecord,
	directOnly As Boolean,
	forceValidity As Boolean
) As ObjectIdCollection
public:
[ExtensionAttribute]
static ObjectIdCollection^ GetAllBlockReferenceIds(
	BlockTableRecord^ btr,
	bool directOnly,
	bool forceValidity
)
[<ExtensionAttribute>]
static member GetAllBlockReferenceIds :
        btr : BlockTableRecord *
        directOnly : bool *
        forceValidity : bool -> ObjectIdCollection
Parameters
btr
Type: BlockTableRecord
The BTR.
directOnly
Type: System.Boolean
if set to true [direct only].
forceValidity
Type: System.Boolean
if set to true [force validity].
Return Value
Type: ObjectIdCollection
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
GetAllBlockReferenceIds Overload
Autodesk.AutoCAD.DatabaseServices Namespace