AcExtensionLibrary - v20.1
SymbolTableExtensions Methods
The SymbolTableExtensions type exposes the following members.
Methods
Name | Description
GetErasedObjectIds
 Gets the erased object ids.
GetObjectIds
 Gets the object ids of the SymbolTable.
Top
See Also
Reference
SymbolTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace