AcExtensionLibrary - v20.1
TemplateDWGPath Constructor
 Initializes a new instance of the TemplateDWGPath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public TemplateDWGPath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
TemplateDWGPath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> TemplateDWGPath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
TemplateDWGPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace