AcMgd Extension Library- v20.1
SupportPath.Clear Method
 Clears this instance.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public void Clear()
Public Sub Clear
public:
void Clear()
member Clear : unit -> unit
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace