AcExtentionLibrary - v20.1
Settings.SystemVariables.CMDECHO Property
 Gets or sets a value indicating whether this Settings.SystemVariables is cmdecho.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool CMDECHO { get; set; }
Public Property CMDECHO As Boolean
	Get
	Set
public:
property bool CMDECHO {
	bool get ();
	void set (bool value);
}
member CMDECHO : bool with get, set
Property Value
Type: Boolean
true if cmdecho; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace