AcExtentionLibrary - v20.1
DatabaseExtensions.BlockTable Method
Overload List
Name | Description
BlockTable(Database, OpenMode)
 Opens the BlockTable
BlockTable(Database, Transaction, OpenMode)
 Opens the BlockTable
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace