Autocad Extension Framework Documentation - v20.1
BlockTableExtensions.GetUserDefinedBlockTableRecords Method (BlockTable, OpenMode)
 Gets the user defined block table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<BlockTableRecord> GetUserDefinedBlockTableRecords(
	this BlockTable symbolTbl,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function GetUserDefinedBlockTableRecords (
	symbolTbl As BlockTable,
	Optional mode As OpenMode = OpenMode.ForRead
) As IEnumerable(Of BlockTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<BlockTableRecord^>^ GetUserDefinedBlockTableRecords(
	BlockTable^ symbolTbl,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member GetUserDefinedBlockTableRecords :
        symbolTbl : BlockTable *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> IEnumerable<BlockTableRecord>
Parameters
symbolTbl
Type: BlockTable
The symbol table.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: IEnumerable<BlockTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableExtensions Class
GetUserDefinedBlockTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace