AcExtentionLibrary - v20.1
SymbolTableExtensions.GetObjectIds Method
 Gets the object ids of the SymbolTable.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<ObjectId> GetObjectIds(
	this SymbolTable st
)
<ExtensionAttribute>
Public Shared Function GetObjectIds (
	st As SymbolTable
) As IEnumerable(Of ObjectId)
public:
[ExtensionAttribute]
static IEnumerable<ObjectId>^ GetObjectIds(
	SymbolTable^ st
)
[<ExtensionAttribute>]
static member GetObjectIds :
        st : SymbolTable -> IEnumerable<ObjectId>
Parameters
st
Type: SymbolTable
Return Value
Type: IEnumerable<ObjectId>
IEnumerable{ObjectId} the ObjectIds in SymbolTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type SymbolTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
SymbolTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace