AcExtensionLibrary - v20.1
AcadDirectory Operators
The AcadDirectory type exposes the following members.
Operators
Name | Description
Equality
 Implements the operator ==.
Inequality
 Implements the operator !=.
Top
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace