AcExtentionLibrary - v20.1
DocumentExtensions.SendCancel Method
 Sends the cancel.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void SendCancel(
	this Document doc
)
<ExtensionAttribute>
Public Shared Sub SendCancel (
	doc As Document
)
public:
[ExtensionAttribute]
static void SendCancel(
	Document^ doc
)
[<ExtensionAttribute>]
static member SendCancel :
        doc : Document -> unit
Parameters
doc
Type: Document
The document.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Document. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DocumentExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace