AcMgd Extension Library- v20.1
TemplateDWGPath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.TemplateDWGPath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class TemplateDWGPath
Public Class TemplateDWGPath
public ref class TemplateDWGPath
type TemplateDWGPath =  class end
The TemplateDWGPath type exposes the following members.
Constructors
Name | Description
TemplateDWGPath
 Initializes a new instance of the TemplateDWGPath class.
Top
Properties
Name | Description
Path
 Gets or sets the path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace