AcMgd Extension Library- v20.1
BlockTableRecordExtensions.GetAllBlockReferences Method (BlockTableRecord, Transaction, Boolean, Boolean)
 Gets all block references.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<BlockReference> GetAllBlockReferences(
	this BlockTableRecord btr,
	Transaction trx,
	bool directOnly,
	bool forceValidity
)
<ExtensionAttribute>
Public Shared Function GetAllBlockReferences (
	btr As BlockTableRecord,
	trx As Transaction,
	directOnly As Boolean,
	forceValidity As Boolean
) As IEnumerable(Of BlockReference)
public:
[ExtensionAttribute]
static IEnumerable<BlockReference^>^ GetAllBlockReferences(
	BlockTableRecord^ btr,
	Transaction^ trx,
	bool directOnly,
	bool forceValidity
)
[<ExtensionAttribute>]
static member GetAllBlockReferences :
        btr : BlockTableRecord *
        trx : Transaction *
        directOnly : bool *
        forceValidity : bool -> IEnumerable<BlockReference>
Parameters
btr
Type: BlockTableRecord
The BTR.
trx
Type: Transaction
The TRX.
directOnly
Type: System.Boolean
if set to true [direct only].
forceValidity
Type: System.Boolean
if set to true [force validity].
Return Value
Type: IEnumerable<BlockReference>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
GetAllBlockReferences Overload
Autodesk.AutoCAD.DatabaseServices Namespace