AcExtentionLibrary - v20.1
DocumentExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.DocumentExtensions
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class DocumentExtensions
<ExtensionAttribute>
Public NotInheritable Class DocumentExtensions
[ExtensionAttribute]
public ref class DocumentExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type DocumentExtensions =  class end
The DocumentExtensions type exposes the following members.
Methods
Name | Description
CreatePreviewIcon
 Creates the preview icon.
Save
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=42016.msg471429#msg471429
SendCancel
 Sends the cancel.
SendCommand
 Sends the command.
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices Namespace