AcExtentionLibrary - v20.1
Settings.Variables Property
 Gets the variables.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static Settings.SystemVariables Variables { get; }
Public Shared ReadOnly Property Variables As Settings.SystemVariables
	Get
public:
static property Settings.SystemVariables^ Variables {
	Settings.SystemVariables^ get ();
}
static member Variables : Settings.SystemVariables with get
Property Value
Type: Settings.SystemVariables
 The variables.
See Also
Reference
Settings Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace