AcExtentionLibrary - v20.1
BlockTableRecordExtensions.GetEntities Method
Overload List
Name | Description
GetEntities(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities<T>(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
GetEntities<T>(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
Top
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace