AcExtensionLibrary - v20.1
TypeCode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum TypeCode
Public Enumeration TypeCode
public enum class TypeCode
type TypeCode
Members
Member name | Value | Description
Invalid | -9999 |  The invalid
XDictionary | -6 |  The x dictionary
PReactors | -5 |  The p reactors
Operator | -4 |  The operator
XDataStart | -3 |  The x data start
FirstEntityId | -2 |  The first entity identifier
HeaderId | -2 |  The header identifier
End | -1 |  The end
Start | 0 |  The start
XRefPath | 1 |  The x reference path
Text | 1 |  The text
AttributeTag | 2 |  The attribute tag
ShapeName | 2 |  The shape name
BlockName | 2 |  The block name
SymbolTableName | 2 |  The symbol table name
MlineStyleName | 2 |  The mline style name
SymbolTableRecordName | 2 |  The symbol table record name
Description | 3 |  The description
TextFontFile | 3 |  The text font file
AttributePrompt | 3 |  The attribute prompt
LinetypeProse | 3 |  The linetype prose
DimStyleName | 3 |  The dim style name
DimPostString | 3 |  The dim post string
CLShapeName | 4 |  The cl shape name
DimensionAlternativePrefixSuffix | 4 |  The dimension alternative prefix suffix
TextBigFontFile | 4 |  The text big font file
SymbolTableRecordComments | 4 |  The symbol table record comments
Handle | 5 |  The handle
DimensionBlock | 5 |  The dimension block
LinetypeName | 6 |  The linetype name
DimBlk1 | 6 |  The dim BLK1
DimBlk2 | 7 |  The dim BLK2
TextStyleName | 7 |  The text style name
LayerName | 8 |  The layer name
CLShapeText | 9 |  The cl shape text
XCoordinate | 10 |  The x coordinate
YCoordinate | 20 |  The y coordinate
ZCoordinate | 30 |  The z coordinate
Elevation | 38 |  The elevation
Thickness | 39 |  The thickness
TxtSize | 40 |  The text size
ViewportHeight | 40 |  The viewport height
Real | 40 |  The real
ViewWidth | 41 |  The view width
TxtStyleXScale | 41 |  The text style x scale
ViewportAspect | 41 |  The viewport aspect
TxtStylePSize | 42 |  The text style p size
ViewLensLength | 42 |  The view lens length
ViewFrontClip | 43 |  The view front clip
ViewBackClip | 44 |  The view back clip
ShapeXOffset | 44 |  The shape x offset
ViewHeight | 45 |  The view height
ShapeYOffset | 45 |  The shape y offset
ShapeScale | 46 |  The shape scale
PixelScale | 47 |  The pixel scale
LinetypeScale | 48 |  The linetype scale
DashLength | 49 |  The dash length
MlineOffset | 49 |  The mline offset
LinetypeElement | 49 |  The linetype element
ViewportSnapAngle | 50 |  The viewport snap angle
Angle | 50 |  The angle
ViewportTwist | 51 |  The viewport twist
Visibility | 60 |  The visibility
LayerLinetype | 61 |  The layer linetype
Color | 62 |  The color
HasSubentities | 66 |  The has subentities
ViewportVisibility | 67 |  The viewport visibility
ViewportActive | 68 |  The viewport active
ViewportNumber | 69 |  The viewport number
Int16 | 70 |  The int16
ViewMode | 71 |  The view mode
TxtStyleFlags | 71 |  The text style flags
RegAppFlags | 71 |  The reg application flags
CircleSides | 72 |  The circle sides
LinetypeAlign | 72 |  The linetype align
ViewportZoom | 73 |  The viewport zoom
LinetypePdc | 73 |  The linetype PDC
ViewportIcon | 74 |  The viewport icon
ViewportSnap | 75 |  The viewport snap
ViewportGrid | 76 |  The viewport grid
ViewportSnapStyle | 77 |  The viewport snap style
ViewportSnapPair | 78 |  The viewport snap pair
Int32 | 90 |  The int32
Subclass | 100 |  The subclass
EmbeddedObjectStart | 101 |  The embedded object start
ControlString | 102 |  The control string
DimVarHandle | 105 |  The dim variable handle
UcsOrg | 110 |  The ucs org
UcsOrientationX | 111 |  The ucs orientation x
UcsOrientationY | 112 |  The ucs orientation y
XReal | 140 |  The x real
ViewBrightness | 141 |  The view brightness
ViewContrast | 142 |  The view contrast
Int64 | 160 |  The int64
XInt16 | 170 |  The x int16
NormalX | 210 |  The normal x
NormalY | 220 |  The normal y
NormalZ | 230 |  The normal z
XXInt16 | 270 |  The xx int16
Int8 | 280 |  The int8
RenderMode | 281 |  The render mode
Bool | 290 |  The bool
XTextString | 300 |  The x text string
BinaryChunk | 310 |  The binary chunk
ArbitraryHandle | 320 |  The arbitrary handle
SoftPointerId | 330 |  The soft pointer identifier
HardPointerId | 340 |  The hard pointer identifier
SoftOwnershipId | 350 |  The soft ownership identifier
HardOwnershipId | 360 |  The hard ownership identifier
LineWeight | 370 |  The line weight
PlotStyleNameType | 380 |  The plot style name type
PlotStyleNameId | 390 |  The plot style name identifier
ExtendedInt16 | 400 |  The extended int16
LayoutName | 410 |  The layout name
ColorRgb | 420 |  The color RGB
ColorName | 430 |  The color name
Alpha | 440 |  The alpha
GradientObjType | 450 |  The gradient object type
GradientPatType | 451 |  The gradient pat type
GradientTintType | 452 |  The gradient tint type
GradientColCount | 453 |  The gradient col count
GradientAngle | 460 |  The gradient angle
GradientShift | 461 |  The gradient shift
GradientTintVal | 462 |  The gradient tint value
GradientColVal | 463 |  The gradient col value
GradientName | 470 |  The gradient name
Comment | 999 |  The comment
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace