AcExtensionLibrary - v20.1
BlockTableRecordExtensions.GetObjectIds Method (BlockTableRecord)
 Gets the object ids.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<ObjectId> GetObjectIds(
	this BlockTableRecord btr
)
<ExtensionAttribute>
Public Shared Function GetObjectIds (
	btr As BlockTableRecord
) As IEnumerable(Of ObjectId)
public:
[ExtensionAttribute]
static IEnumerable<ObjectId>^ GetObjectIds(
	BlockTableRecord^ btr
)
[<ExtensionAttribute>]
static member GetObjectIds :
        btr : BlockTableRecord -> IEnumerable<ObjectId>
Parameters
btr
Type: BlockTableRecord
The BTR.
Return Value
Type: IEnumerable<ObjectId>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
GetObjectIds Overload
Autodesk.AutoCAD.DatabaseServices Namespace