AcExtentionLibrary - v20.1
ObjectIdExtensions.GetDBObject<T> Method (ObjectId, Transaction, OpenMode, Boolean)
 Gets the database object.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static T GetDBObject<T>(
	this ObjectId id,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool openErased = false
)
where T : DBObject
<ExtensionAttribute>
Public Shared Function GetDBObject(Of T As DBObject) (
	id As ObjectId,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional openErased As Boolean = false
) As T
public:
[ExtensionAttribute]
generic<typename T>
where T : DBObject
static T GetDBObject(
	ObjectId id,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool openErased = false
)
[<ExtensionAttribute>]
static member GetDBObject :
        id : ObjectId *
        trx : Transaction *
        ?mode : OpenMode *
        ?openErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _openErased = defaultArg openErased false
*)
-> 'T  when 'T : DBObject
Parameters
id
Type: ObjectId
The identifier.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
openErased (Optional)
Type: System.Boolean
if set to true [open erased].
Type Parameters
T
Return Value
Type: T
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectId. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentNullException | id is null
Exception
See Also
Reference
ObjectIdExtensions Class
GetDBObject Overload
Autodesk.AutoCAD.DatabaseServices Namespace