AcExtentionLibrary - v20.1
PageSetupOverridesTemplateFile Methods
The PageSetupOverridesTemplateFile type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PageSetupOverridesTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace