AcExtensionLibrary - v20.1
DatabaseExtensions.BlockTable Method (Database, Transaction, OpenMode)
 Opens the BlockTable
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static BlockTable BlockTable(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function BlockTable (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As BlockTable
public:
[ExtensionAttribute]
static BlockTable^ BlockTable(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member BlockTable :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> BlockTable
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: BlockTable
BlockTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
Examples
[CommandMethod("BlockTableTrx")]
public void BlockTableTrx()
{
    using (Transaction trx = Db.TransactionManager.StartTransaction())
    {
        BlockTable bt = Db.BlockTable(trx);
        Ed.WriteLine(bt.ObjectId);
    }
}
<CommandMethod("BlockTableTrx")>
Public Sub BlockTableTrx()
    Using trx As Transaction = Db.TransactionManager.StartTransaction
        Dim bt As BlockTable = Db.BlockTable(trx)
        Ed.WriteLine(bt.ObjectId)
    End Using
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
DatabaseExtensions Class
BlockTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace