AcMgd Extension Library- v20.1
ObjectOverrule<T> Class
 Object
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Overrule
 ObjectOverrule
 Autodesk.AutoCAD.DatabaseServices.ObjectOverrule<T>
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public abstract class ObjectOverrule<T> : ObjectOverrule
where T : DBObject
Public MustInherit Class ObjectOverrule(Of T As DBObject)
	Inherits ObjectOverrule
generic<typename T>
where T : DBObject
public ref class ObjectOverrule abstract : public ObjectOverrule
[<AbstractClassAttribute>]
type ObjectOverrule<'T when 'T : DBObject> =
    class
        inherit ObjectOverrule
    end
Type Parameters
T
The ObjectOverrule<T> type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace