AcMgd Extension Library- v20.1
ToolPalettePath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.SupportPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.ToolPalettePath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class ToolPalettePath : SupportPath
Public Class ToolPalettePath
	Inherits SupportPath
public ref class ToolPalettePath : public SupportPath
type ToolPalettePath =
    class
        inherit SupportPath
    end
The ToolPalettePath type exposes the following members.
Constructors
Name | Description
ToolPalettePath
 Initializes a new instance of the ToolPalettePath class.
Top
Properties
Name | Description
DefaultPath
 Gets the default path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace