Autocad Extension Framework Documentation - v20.1
ObjectIdCollectionExtensions.ToObjectIdCollection Method
Overload List
Name | Description
ToObjectIdCollection(IEnumerable<DBObject>)
 To the object identifier collection.
ToObjectIdCollection(IEnumerable<ObjectId>)
 To the object identifier collection.
Top
See Also
Reference
ObjectIdCollectionExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace