AcExtensionLibrary - v20.1
PrinterConfigPath Constructor
 Initializes a new instance of the PrinterConfigPath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public PrinterConfigPath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
PrinterConfigPath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> PrinterConfigPath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
PrinterConfigPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace