AcExtensionLibrary - v20.1
Preferences.SupportPaths Property
 Gets the support paths.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static SupportPath SupportPaths { get; }
Public Shared ReadOnly Property SupportPaths As SupportPath
	Get
public:
static property SupportPath^ SupportPaths {
	SupportPath^ get ();
}
static member SupportPaths : SupportPath with get
Property Value
Type: SupportPath
 The support paths.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace