AcMgd Extension Library- v20.1
ObjectIdExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.ObjectIdExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class ObjectIdExtensions
<ExtensionAttribute>
Public NotInheritable Class ObjectIdExtensions
[ExtensionAttribute]
public ref class ObjectIdExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type ObjectIdExtensions =  class end
Methods
Name | Description
GetDBObject(ObjectId, OpenMode, Boolean)
 Gets the database object.
GetDBObject(ObjectId, Transaction, OpenMode, Boolean)
 Gets the database object.
GetDBObject<T>(ObjectId, OpenMode, Boolean)
 Gets the database object.
GetDBObject<T>(ObjectId, Transaction, OpenMode, Boolean)
 Gets the database object.
GetDBObjects(IEnumerable<ObjectId>, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects<T>(IEnumerable<ObjectId>, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects<T>(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean)
 Gets the database objects.
GetEntities(IEnumerable<ObjectId>, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities<T>(IEnumerable<ObjectId>, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities<T>(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntity(ObjectId, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity(ObjectId, Transaction, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity<T>(ObjectId, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity<T>(ObjectId, Transaction, OpenMode, Boolean, Boolean)
 Gets the entity.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace