AcMgd Extension Library- v20.1
EditorExtensions.Write Method (Editor, Char)
 Writes the specified Unicode character val to the CommandLine
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void Write(
	this Editor ed,
	char value
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	value As Char
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	wchar_t value
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        value : char -> unit
Parameters
ed
Type: Editor
Extension method of Editor
value
Type: System.Char
The val to write.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace