AcExtensionLibrary - v20.1
BlockTableExtensions.GetBlockTableRecords Method (BlockTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<BlockTableRecord> GetBlockTableRecords(
	this BlockTable symbolTbl,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter.None
)
<ExtensionAttribute>
Public Shared Function GetBlockTableRecords (
	symbolTbl As BlockTable,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional filter As SymbolTableRecordFilter = SymbolTableRecordFilter.None
) As IEnumerable(Of BlockTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<BlockTableRecord^>^ GetBlockTableRecords(
	BlockTable^ symbolTbl,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter::None
)
[<ExtensionAttribute>]
static member GetBlockTableRecords :
        symbolTbl : BlockTable *
        trx : Transaction *
        ?mode : OpenMode *
        ?filter : SymbolTableRecordFilter
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _filter = defaultArg filter SymbolTableRecordFilter.None
*)
-> IEnumerable<BlockTableRecord>
Parameters
symbolTbl
Type: BlockTable
The symbol table.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
filter (Optional)
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
Return Value
Type: IEnumerable<BlockTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableExtensions Class
GetBlockTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace