Autocad Extension Framework Documentation - v20.1
AcadDirectory.Name Property
 Gets the name.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
Type: String
 The name.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace