AcMgd Extension Library- v20.1
OverruleStatus Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum OverruleStatus
Public Enumeration OverruleStatus
public enum class OverruleStatus
type OverruleStatus
Members
Member name | Value | Description
Off | 0 |  The off
On | 1 |  The on
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace