AcExtensionLibrary - v20.1
LayerTableRecordExtensions Methods
The LayerTableRecordExtensions type exposes the following members.
Methods
Name | Description
LayerNameTypedValue
 Layers the name typed value.
Top
See Also
Reference
LayerTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace