Autocad Extension Framework Documentation - v20.1
SCMTimeValue Properties
The SCMTimeValue type exposes the following members.
Properties
Name | Description
TimeLength
 Gets or sets the length of the time.
Top
See Also
Reference
SCMTimeValue Class
Autodesk.AutoCAD.ApplicationServices.PreferencesUser Namespace