Autocad Extension Framework Documentation - v20.1
AcadDirectory.Path Property
 Gets the path.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
member Path : string with get
Property Value
Type: String
 The path.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace