AcExtentionLibrary - v20.1
DatabaseExtensions.MLStyleDBDictionary Method
Overload List
Name | Description
MLStyleDBDictionary(Database, OpenMode)
 Mls the style database dictionary.
MLStyleDBDictionary(Database, Transaction, OpenMode)
 Mls the style database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace