AcExtensionLibrary - v20.1
TemporarySystemVariables.Item Property
 Gets or sets the Object with the specified name.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public override Object this[
	string name
] { get; set; }
Public Overrides Default Property Item (
	name As String
) As Object
	Get
	Set
public:
virtual property Object^ default[String^ name] {
	Object^ get (String^ name) override;
	void set (String^ name, Object^ value) override;
}
abstract Item : Object with get, set
override Item : Object with get, set
Parameters
name
Type: System.String
The name.
Property Value
Type: Object
 The Object.
Return Value
Type: Object
See Also
Reference
TemporarySystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace