AcExtensionLibrary - v20.1
Preferences.ToolPalettePaths Property
 Gets the tool palette paths.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ToolPalettePath ToolPalettePaths { get; }
Public Shared ReadOnly Property ToolPalettePaths As ToolPalettePath
	Get
public:
static property ToolPalettePath^ ToolPalettePaths {
	ToolPalettePath^ get ();
}
static member ToolPalettePaths : ToolPalettePath with get
Property Value
Type: ToolPalettePath
 The tool palette paths.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace