AcExtentionLibrary - v20.1
DatabaseExtensions.BlockTable Method (Database, OpenMode)
 Opens the BlockTable
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static BlockTable BlockTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function BlockTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As BlockTable
public:
[ExtensionAttribute]
static BlockTable^ BlockTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member BlockTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> BlockTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
Return Value
Type: BlockTable
BlockTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
Examples
[CommandMethod("BlockTable")]
public void BlockTable()
{
    using (Transaction trx = Db.TransactionManager.StartTransaction())
    {
        BlockTable bt = Db.BlockTable();
        Ed.WriteLine(bt.ObjectId);
    }
}
<CommandMethod("BlockTable")>
Public Sub BlockTable()
    Using trx As Transaction = Db.TransactionManager.StartTransaction
        Dim bt As BlockTable = Db.BlockTable
        Ed.WriteLine(bt.ObjectId)
    End Using
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
DatabaseExtensions Class
BlockTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace