AcMgd Extension Library- v20.1
WrapperDBDictionary<T>.IncludingErased Property
 Gets a value indicating whether [including erased].
Namespace: Autodesk.AutoCAD.DatabaseServices.Wrapper
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool IncludingErased { get; }
Public ReadOnly Property IncludingErased As Boolean
	Get
public:
property bool IncludingErased {
	bool get ();
}
member IncludingErased : bool with get
Property Value
Type: Boolean
true if [including erased]; otherwise, false.
See Also
Reference
WrapperDBDictionary<T> Class
Autodesk.AutoCAD.DatabaseServices.Wrapper Namespace