AcExtensionLibrary - v20.1
Extents3dExtensions.CenterPoint Method
 Centers the point.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static Point3d CenterPoint(
	this Extents3d exts
)
<ExtensionAttribute>
Public Shared Function CenterPoint (
	exts As Extents3d
) As Point3d
public:
[ExtensionAttribute]
static Point3d CenterPoint(
	Extents3d exts
)
[<ExtensionAttribute>]
static member CenterPoint :
        exts : Extents3d -> Point3d
Parameters
exts
Type: Extents3d
The exts.
Return Value
Type: Point3d
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Extents3d. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
Extents3dExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace