AcMgd Extension Library- v20.1
BlockTableRecordExtensions.GetAttributeDefinitions Method
Overload List
Name | Description
GetAttributeDefinitions(BlockTableRecord, OpenMode, Boolean, Boolean)
 Gets the attribute definitions.
GetAttributeDefinitions(BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute definitions.
Top
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace