Autocad Extension Framework Documentation - v20.1
EnterpriseMenuFile Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.EnterpriseMenuFile
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class EnterpriseMenuFile
Public Class EnterpriseMenuFile
public ref class EnterpriseMenuFile
type EnterpriseMenuFile =  class end
The EnterpriseMenuFile type exposes the following members.
Constructors
Name | Description
EnterpriseMenuFile
 Initializes a new instance of the EnterpriseMenuFile class.
Top
Properties
Name | Description
Path
 Gets or sets the path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace