AcExtentionLibrary - v20.1
Settings.SystemVariables.DCTCUST Property
 Gets or sets the dctcust.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string DCTCUST { get; set; }
Public Property DCTCUST As String
	Get
	Set
public:
property String^ DCTCUST {
	String^ get ();
	void set (String^ value);
}
member DCTCUST : string with get, set
Property Value
Type: String
 The dctcust.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace