AcMgd Extension Library- v20.1
ProxyObjectExtensions Methods
The ProxyObjectExtensions type exposes the following members.
Methods
Name | Description
IsErasable
 Determines whether this instance is erasable.
Top
See Also
Reference
ProxyObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace