Autocad Extension Framework Documentation - v20.1
ObjectIdCollectionExtensions.ToObjectIdCollection Method (IEnumerable<ObjectId>)
 To the object identifier collection.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectIdCollection ToObjectIdCollection(
	this IEnumerable<ObjectId> source
)
<ExtensionAttribute>
Public Shared Function ToObjectIdCollection (
	source As IEnumerable(Of ObjectId)
) As ObjectIdCollection
public:
[ExtensionAttribute]
static ObjectIdCollection^ ToObjectIdCollection(
	IEnumerable<ObjectId>^ source
)
[<ExtensionAttribute>]
static member ToObjectIdCollection :
        source : IEnumerable<ObjectId> -> ObjectIdCollection
Parameters
source
Type: System.Collections.Generic.IEnumerable<ObjectId>
The source.
Return Value
Type: ObjectIdCollection
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<ObjectId>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdCollectionExtensions Class
ToObjectIdCollection Overload
Autodesk.AutoCAD.DatabaseServices Namespace