AcExtentionLibrary - v20.1
StringExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.StringExtensions
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class StringExtensions
<ExtensionAttribute>
Public NotInheritable Class StringExtensions
[ExtensionAttribute]
public ref class StringExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type StringExtensions =  class end
The StringExtensions type exposes the following members.
Methods
Name | Description
Matches
 Matcheses the specified pattern.
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices Namespace