Autocad Extension Framework Documentation - v20.1
ObjectIdExtensions.GetEntities Method (IEnumerable<ObjectId>, Transaction, OpenMode, Boolean, Boolean)
 Gets the entities.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<Entity> GetEntities(
	this IEnumerable<ObjectId> ids,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool openErased = false,
	bool forceOpenOnLockedLayer = false
)
<ExtensionAttribute>
Public Shared Function GetEntities (
	ids As IEnumerable(Of ObjectId),
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional openErased As Boolean = false,
	Optional forceOpenOnLockedLayer As Boolean = false
) As IEnumerable(Of Entity)
public:
[ExtensionAttribute]
static IEnumerable<Entity^>^ GetEntities(
	IEnumerable<ObjectId>^ ids,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool openErased = false,
	bool forceOpenOnLockedLayer = false
)
[<ExtensionAttribute>]
static member GetEntities :
        ids : IEnumerable<ObjectId> *
        trx : Transaction *
        ?mode : OpenMode *
        ?openErased : bool *
        ?forceOpenOnLockedLayer : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _openErased = defaultArg openErased false
        let _forceOpenOnLockedLayer = defaultArg forceOpenOnLockedLayer false
*)
-> IEnumerable<Entity>
Parameters
ids
Type: System.Collections.Generic.IEnumerable<ObjectId>
The ids.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
openErased (Optional)
Type: System.Boolean
if set to true [open erased].
forceOpenOnLockedLayer (Optional)
Type: System.Boolean
if set to true [force open on locked layer].
Return Value
Type: IEnumerable<Entity>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<ObjectId>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdExtensions Class
GetEntities Overload
Autodesk.AutoCAD.DatabaseServices Namespace