Autocad Extension Framework Documentation - v20.1
EditorExtensions.WriteLine Method (Editor, Char[], Int32, Int32)
 Writes the line.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void WriteLine(
	this Editor ed,
	char[] buffer,
	int index,
	int count
)
<ExtensionAttribute>
Public Shared Sub WriteLine (
	ed As Editor,
	buffer As Char(),
	index As Integer,
	count As Integer
)
public:
[ExtensionAttribute]
static void WriteLine(
	Editor^ ed,
	array<wchar_t>^ buffer,
	int index,
	int count
)
[<ExtensionAttribute>]
static member WriteLine :
        ed : Editor *
        buffer : char[] *
        index : int *
        count : int -> unit
Parameters
ed
Type: Editor
The ed.
buffer
Type: System.Char[]
The buffer.
index
Type: System.Int32
The index.
count
Type: System.Int32
The count.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
WriteLine Overload
Autodesk.AutoCAD.EditorInput Namespace