Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.StandardDimStyle Method
Overload List
Name | Description
StandardDimStyle(Database)
 Standards the dim style.
StandardDimStyle(Database, Transaction)
 Standards the dim style.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace