AcMgd Extension Library- v20.1
LayerTableExtensions.GetLayerTableRecords Method (LayerTable, OpenMode, SymbolTableRecordFilter)
 Gets the layer table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<LayerTableRecord> GetLayerTableRecords(
	this LayerTable symbolTbl,
	OpenMode mode = OpenMode.ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter.None
)
<ExtensionAttribute>
Public Shared Function GetLayerTableRecords (
	symbolTbl As LayerTable,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional filter As SymbolTableRecordFilter = SymbolTableRecordFilter.None
) As IEnumerable(Of LayerTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<LayerTableRecord^>^ GetLayerTableRecords(
	LayerTable^ symbolTbl,
	OpenMode mode = OpenMode::ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter::None
)
[<ExtensionAttribute>]
static member GetLayerTableRecords :
        symbolTbl : LayerTable *
        ?mode : OpenMode *
        ?filter : SymbolTableRecordFilter
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _filter = defaultArg filter SymbolTableRecordFilter.None
*)
-> IEnumerable<LayerTableRecord>
Parameters
symbolTbl
Type: LayerTable
The symbol table.
mode (Optional)
Type: OpenMode
The mode.
filter (Optional)
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
Return Value
Type: IEnumerable<LayerTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type LayerTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
LayerTableExtensions Class
GetLayerTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace