AcExtentionLibrary - v20.1
CommandClass Class
 Just refactored into own class from Author: Kerry Brown Source: http://www.theswamp.org/index.php?topic=37686.msg427172#msg427172
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.Runtime.CommandClass
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public abstract class CommandClass : ICommandClass
Public MustInherit Class CommandClass
	Implements ICommandClass
public ref class CommandClass abstract : ICommandClass
[<AbstractClassAttribute>]
type CommandClass =
    class
        interface ICommandClass
    end
The CommandClass type exposes the following members.
Constructors
Name | Description
CommandClass
 Initializes a new instance of the CommandClass class.
Top
Properties
Name | Description
Db
 Gets the database.
Doc
 Gets the document.
Ed
 Gets the ed.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace