AcExtentionLibrary - v20.1
Preferences.PageSetupOverridesTemplateFile Property
 Gets the page setup overrides template file.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PageSetupOverridesTemplateFile PageSetupOverridesTemplateFile { get; }
Public Shared ReadOnly Property PageSetupOverridesTemplateFile As PageSetupOverridesTemplateFile
	Get
public:
static property PageSetupOverridesTemplateFile^ PageSetupOverridesTemplateFile {
	PageSetupOverridesTemplateFile^ get ();
}
static member PageSetupOverridesTemplateFile : PageSetupOverridesTemplateFile with get
Property Value
Type: PageSetupOverridesTemplateFile
 The page setup overrides template file.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace