AcExtensionLibrary - v20.1
Settings.SystemVariables.ATTDIA Property
 Gets or sets a value indicating whether this Settings.SystemVariables is attdia.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool ATTDIA { get; set; }
Public Property ATTDIA As Boolean
	Get
	Set
public:
property bool ATTDIA {
	bool get ();
	void set (bool value);
}
member ATTDIA : bool with get, set
Property Value
Type: Boolean
true if attdia; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace