AcExtentionLibrary - v20.1
SupportPath.Remove Method
 Removes the specified path.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool Remove(
	string path
)
Public Function Remove (
	path As String
) As Boolean
public:
virtual bool Remove(
	String^ path
) sealed
abstract Remove :
        path : string -> bool
override Remove :
        path : string -> bool
Parameters
path
Type: System.String
The path.
Return Value
Type: Boolean
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace