AcExtensionLibrary - v20.1
PrinterStyleSheetPath Constructor
 Initializes a new instance of the PrinterStyleSheetPath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public PrinterStyleSheetPath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
PrinterStyleSheetPath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> PrinterStyleSheetPath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
PrinterStyleSheetPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace