Autocad Extension Framework Documentation - v20.1
DrawableOverrule<T> Methods
The DrawableOverrule<T> generic type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
DrawableOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace