Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.CMLEADERSTYLE Property
 Gets or sets the cmleaderstyle.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string CMLEADERSTYLE { get; set; }
Public Property CMLEADERSTYLE As String
	Get
	Set
public:
property String^ CMLEADERSTYLE {
	String^ get ();
	void set (String^ value);
}
member CMLEADERSTYLE : string with get, set
Property Value
Type: String
 The cmleaderstyle.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace