AcExtensionLibrary - v20.1
Settings.SystemVariables.CMDNAMES Property
 Gets the cmdnames.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string CMDNAMES { get; }
Public ReadOnly Property CMDNAMES As String
	Get
public:
property String^ CMDNAMES {
	String^ get ();
}
member CMDNAMES : string with get
Property Value
Type: String
 The cmdnames.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace