Autocad Extension Framework Documentation - v20.1
TransactedSysytemVariables Methods
The TransactedSysytemVariables type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
TransactedSysytemVariables Class
Autodesk.AutoCAD.Runtime Namespace