Autocad Extension Framework Documentation - v20.1
BlockReferenceExtensions.GetAttributeReferenceDictionary Method
Overload List
Name | Description
GetAttributeReferenceDictionary(BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
GetAttributeReferenceDictionary(BlockReference, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
Top
See Also
Reference
BlockReferenceExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace