Autocad Extension Framework Documentation - v20.1
SupportPath Methods
The SupportPath type exposes the following members.
Methods
Name | Description
Add
 Adds the specified path.
Clear
 Clears this instance.
Contains
 Determines whether [contains] [the specified path].
GetPaths
 Gets the paths.
Insert
 Inserts the specified index.
Remove
 Removes the specified path.
RemoveAll
 Removes all.
RemoveAt
 Removes at.
RemoveRange
 Removes the range.
SaveChanges
 Saves the changes.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace