AcExtentionLibrary - v20.1
EnterpriseMenuFile Methods
The EnterpriseMenuFile type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
EnterpriseMenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace