AcExtensionLibrary - v20.1
Preferences Properties
The Preferences type exposes the following members.
Properties
Name | Description
DisplayScrollBars
 Gets the display scroll bars.
EnterpriseMenuFile
 Gets the enterprise menu file.
MenuFile
 Gets the menu file.
PageSetupOverridesTemplateFile
 Gets the page setup overrides template file.
PrinterConfigPath
 Gets the printer configuration path.
PrinterDescPath
 Gets the printer desc path.
PrinterStyleSheetPath
 Gets the printer style sheet path.
QNewTemplateFile
 Gets the q new template file.
SCMTimeValue
 Gets the SCM time value.
SupportPaths
 Gets the support paths.
TemplateDWGPath
 Gets the template DWG path.
ToolPalettePaths
 Gets the tool palette paths.
Top
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace