Autocad Extension Framework Documentation - v20.1
ObjectIdCollectionExtensions.ToArray Method
 To the array.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectId[] ToArray(
	this ObjectIdCollection ids
)
<ExtensionAttribute>
Public Shared Function ToArray (
	ids As ObjectIdCollection
) As ObjectId()
public:
[ExtensionAttribute]
static array<ObjectId>^ ToArray(
	ObjectIdCollection^ ids
)
[<ExtensionAttribute>]
static member ToArray :
        ids : ObjectIdCollection -> ObjectId[]
Parameters
ids
Type: ObjectIdCollection
The ids.
Return Value
Type: ObjectId[]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectIdCollection. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdCollectionExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace