AcMgd Extension Library- v20.1
MenuFile Properties
The MenuFile type exposes the following members.
Properties
Name | Description
Path
 Gets or sets the path.
Top
See Also
Reference
MenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace