AcExtentionLibrary - v20.1
EnviromentVariables.SheetSetTemplatePath Property
 Gets or sets the sheet set template path.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static string SheetSetTemplatePath { get; set; }
Public Shared Property SheetSetTemplatePath As String
	Get
	Set
public:
static property String^ SheetSetTemplatePath {
	String^ get ();
	void set (String^ value);
}
static member SheetSetTemplatePath : string with get, set
Property Value
Type: String
 The sheet set template path.
See Also
Reference
EnviromentVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace