AcExtensionLibrary - v20.1
Preferences.QNewTemplateFile Property
 Gets the q new template file.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static QNewTemplateFile QNewTemplateFile { get; }
Public Shared ReadOnly Property QNewTemplateFile As QNewTemplateFile
	Get
public:
static property QNewTemplateFile^ QNewTemplateFile {
	QNewTemplateFile^ get ();
}
static member QNewTemplateFile : QNewTemplateFile with get
Property Value
Type: QNewTemplateFile
 The q new template file.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace