AcMgd Extension Library- v20.1
SupportPath.GetPaths Method
 Gets the paths.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public IEnumerable<string> GetPaths()
Public Function GetPaths As IEnumerable(Of String)
public:
virtual IEnumerable<String^>^ GetPaths() sealed
abstract GetPaths : unit -> IEnumerable<string>
override GetPaths : unit -> IEnumerable<string>
Return Value
Type: IEnumerable<String>
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace