AcExtentionLibrary - v20.1
QNewTemplateFile Constructor
 Initializes a new instance of the QNewTemplateFile class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public QNewTemplateFile(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
QNewTemplateFile(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> QNewTemplateFile
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
QNewTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace