Autocad Extension Framework Documentation - v20.1
ObjectIdCollectionExtensions.Where<T> Method (ObjectIdCollection, Func<T, Boolean>)
 Wheres the specified predicate.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<ObjectId> Where<T>(
	this ObjectIdCollection source,
	Func<T, bool> predicate
)
where T : DBObject
<ExtensionAttribute>
Public Shared Function Where(Of T As DBObject) (
	source As ObjectIdCollection,
	predicate As Func(Of T, Boolean)
) As IEnumerable(Of ObjectId)
public:
[ExtensionAttribute]
generic<typename T>
where T : DBObject
static IEnumerable<ObjectId>^ Where(
	ObjectIdCollection^ source,
	Func<T, bool>^ predicate
)
[<ExtensionAttribute>]
static member Where :
        source : ObjectIdCollection *
        predicate : Func<'T, bool> -> IEnumerable<ObjectId>  when 'T : DBObject
Parameters
source
Type: ObjectIdCollection
The source.
predicate
Type: System.Func<T, Boolean>
The predicate.
Type Parameters
T
Return Value
Type: IEnumerable<ObjectId>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectIdCollection. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdCollectionExtensions Class
Where Overload
Autodesk.AutoCAD.DatabaseServices Namespace