Autocad Extension Framework Documentation - v20.1
PromptKeywords Constructor
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public PromptKeywords()
Public Sub New
public:
PromptKeywords()
new : unit -> PromptKeywords
See Also
Reference
PromptKeywords Class
Autodesk.AutoCAD.EditorInput Namespace