AcMgd Extension Library- v20.1
TextStyleTableExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.TextStyleTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class TextStyleTableExtensions
<ExtensionAttribute>
Public NotInheritable Class TextStyleTableExtensions
[ExtensionAttribute]
public ref class TextStyleTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type TextStyleTableExtensions =  class end
Methods
Name | Description
GetAllTextStyleTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets all text style table records.
GetAllTextStyleTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets all text style table records.
GetShapeFileTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
GetShapeFileTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
GetTextStyleTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
GetTextStyleTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace