AcExtensionLibrary - v20.1
BlockReferenceExtensions.GetEffectiveBlockTableRecord Method (BlockReference, Transaction)
 Gets the effective block table record.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static BlockTableRecord GetEffectiveBlockTableRecord(
	this BlockReference blockref,
	Transaction trx
)
<ExtensionAttribute>
Public Shared Function GetEffectiveBlockTableRecord (
	blockref As BlockReference,
	trx As Transaction
) As BlockTableRecord
public:
[ExtensionAttribute]
static BlockTableRecord^ GetEffectiveBlockTableRecord(
	BlockReference^ blockref,
	Transaction^ trx
)
[<ExtensionAttribute>]
static member GetEffectiveBlockTableRecord :
        blockref : BlockReference *
        trx : Transaction -> BlockTableRecord
Parameters
blockref
Type: BlockReference
The blockref.
trx
Type: Transaction
The TRX.
Return Value
Type: BlockTableRecord
The BlockTableRecord used to create
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockReference. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockReferenceExtensions Class
GetEffectiveBlockTableRecord Overload
Autodesk.AutoCAD.DatabaseServices Namespace