AcExtentionLibrary - v20.1
ExtensionApplication.Terminate Method
 Terminates this instance.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public abstract void Terminate()
Public MustOverride Sub Terminate
public:
virtual void Terminate() abstract
abstract Terminate : unit -> unit
See Also
Reference
ExtensionApplication Class
Autodesk.AutoCAD.Runtime Namespace