AcMgd Extension Library- v20.1
SupportPath.RemoveAt Method
 Removes at.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
public:
void RemoveAt(
	int index
)
member RemoveAt :
        index : int -> unit
Parameters
index
Type: System.Int32
The index.
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace