Autocad Extension Framework Documentation - v20.1
ProxyEntityExtensions Methods
The ProxyEntityExtensions type exposes the following members.
Methods
Name | Description
IsErasable
 Determines whether this instance is erasable.
Top
See Also
Reference
ProxyEntityExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace