AcExtentionLibrary - v20.1
PromptKeywords.SetKeywords Method (String, String)
 Sets the keywords.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PromptKeywordOptions SetKeywords(
	string meassageAndKeywords,
	string defaultKeyword
)
Public Shared Function SetKeywords (
	meassageAndKeywords As String,
	defaultKeyword As String
) As PromptKeywordOptions
public:
static PromptKeywordOptions^ SetKeywords(
	String^ meassageAndKeywords,
	String^ defaultKeyword
)
static member SetKeywords :
        meassageAndKeywords : string *
        defaultKeyword : string -> PromptKeywordOptions
Parameters
meassageAndKeywords
Type: System.String
The meassage and keywords.
defaultKeyword
Type: System.String
The default keyword.
Return Value
Type: PromptKeywordOptions
See Also
Reference
PromptKeywords Class
SetKeywords Overload
Autodesk.AutoCAD.EditorInput Namespace