AcExtensionLibrary - v20.1
BlockReferenceExtensions.GetAttributeReferenceDictionary Method (BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static Dictionary<string, AttributeReference> GetAttributeReferenceDictionary(
	this BlockReference bref,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
<ExtensionAttribute>
Public Shared Function GetAttributeReferenceDictionary (
	bref As BlockReference,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false,
	Optional openObjectsOnLockedLayers As Boolean = false
) As Dictionary(Of String, AttributeReference)
public:
[ExtensionAttribute]
static Dictionary<String^, AttributeReference^>^ GetAttributeReferenceDictionary(
	BlockReference^ bref,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
[<ExtensionAttribute>]
static member GetAttributeReferenceDictionary :
        bref : BlockReference *
        ?mode : OpenMode *
        ?includingErased : bool *
        ?openObjectsOnLockedLayers : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
        let _openObjectsOnLockedLayers = defaultArg openObjectsOnLockedLayers false
*)
-> Dictionary<string, AttributeReference>
Parameters
bref
Type: BlockReference
The bref.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
openObjectsOnLockedLayers (Optional)
Type: System.Boolean
if set to true [open objects on locked layers].
Return Value
Type: Dictionary<String, AttributeReference>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockReference. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockReferenceExtensions Class
GetAttributeReferenceDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace