AcMgd Extension Library- v20.1
DatabaseExtensions.ModelSpace Method (Database, OpenMode)
 Models the space.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static BlockTableRecord ModelSpace(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function ModelSpace (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As BlockTableRecord
public:
[ExtensionAttribute]
static BlockTableRecord^ ModelSpace(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member ModelSpace :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> BlockTableRecord
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: BlockTableRecord
Returns the BlockTableRecord for "ModelSpace"
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
ModelSpace Overload
Autodesk.AutoCAD.DatabaseServices Namespace