AcExtensionLibrary - v20.1
Settings Methods
The Settings type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Settings Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace