AcExtentionLibrary - v20.1
CommandClass.Ed Property
 Gets the ed.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public Editor Ed { get; }
Public ReadOnly Property Ed As Editor
	Get
public:
virtual property Editor^ Ed {
	Editor^ get () sealed;
}
abstract Ed : Editor with get
override Ed : Editor with get
Property Value
Type: Editor
 The ed.
Implements
ICommandClass.Ed
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace