AcExtensionLibrary - v20.1
AcadDirectory.Exists Property
 Gets a value indicating whether this AcadDirectory is exists.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool Exists { get; }
Public ReadOnly Property Exists As Boolean
	Get
public:
property bool Exists {
	bool get ();
}
member Exists : bool with get
Property Value
Type: Boolean
true if exists; otherwise, false.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace