AcExtensionLibrary - v20.1
TypedValueExtensions.ToResultTypedValue Method (Object)
 To the result typed value.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static TypedValue ToResultTypedValue(
	this Object value
)
<ExtensionAttribute>
Public Shared Function ToResultTypedValue (
	value As Object
) As TypedValue
public:
[ExtensionAttribute]
static TypedValue ToResultTypedValue(
	Object^ value
)
[<ExtensionAttribute>]
static member ToResultTypedValue :
        value : Object -> TypedValue
Parameters
value
Type: System.Object
The value.
Return Value
Type: TypedValue
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Object. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TypedValueExtensions Class
ToResultTypedValue Overload
Autodesk.AutoCAD.DatabaseServices Namespace