AcExtentionLibrary - v20.1
OsnapOverrule<T> Methods
The OsnapOverrule<T> generic type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
OsnapOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace