AcMgd Extension Library- v20.1
Settings.SystemVariables.TEXTALLCAPS Property
 Gets or sets a value indicating whether this Settings.SystemVariables is textallcaps.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool TEXTALLCAPS { get; set; }
Public Property TEXTALLCAPS As Boolean
	Get
	Set
public:
property bool TEXTALLCAPS {
	bool get ();
	void set (bool value);
}
member TEXTALLCAPS : bool with get, set
Property Value
Type: Boolean
true if textallcaps; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace