Autocad Extension Framework Documentation - v20.1
ObjectIdExtensions.GetEntities Method
Overload List
Name | Description
GetEntities<T>(IEnumerable<ObjectId>, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities(IEnumerable<ObjectId>, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities<T>(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean, Boolean)
 Gets the entities.
GetEntities(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean, Boolean)
 Gets the entities.
Top
See Also
Reference
ObjectIdExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace