AcExtensionLibrary - v20.1
Settings.SystemVariables.MLEADERSCALE Property
 Gets or sets the mleaderscale.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public double MLEADERSCALE { get; set; }
Public Property MLEADERSCALE As Double
	Get
	Set
public:
property double MLEADERSCALE {
	double get ();
	void set (double value);
}
member MLEADERSCALE : float with get, set
Property Value
Type: Double
 The mleaderscale.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace