Autocad Extension Framework Documentation - v20.1
PromptKeywords Methods
The PromptKeywords type exposes the following members.
Methods
Name | Description
SetKeywords(String)
 Sets the keywords.
SetKeywords(String, String)
 Sets the keywords.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PromptKeywords Class
Autodesk.AutoCAD.EditorInput Namespace