AcExtentionLibrary - v20.1
DimStyleTableExtensions Class
 Extension class for DimStyleTable object
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.DimStyleTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class DimStyleTableExtensions
<ExtensionAttribute>
Public NotInheritable Class DimStyleTableExtensions
[ExtensionAttribute]
public ref class DimStyleTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type DimStyleTableExtensions =  class end
Methods
Name | Description
GetDimStyleTableRecords(DimStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the dim style table records.
GetDimStyleTableRecords(DimStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the dim style table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace