Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.SHORTCUTMENU Property
 Gets or sets the shortcutmenu.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public short SHORTCUTMENU { get; set; }
Public Property SHORTCUTMENU As Short
	Get
	Set
public:
property short SHORTCUTMENU {
	short get ();
	void set (short value);
}
member SHORTCUTMENU : int16 with get, set
Property Value
Type: Int16
 The shortcutmenu.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace