AcExtentionLibrary - v20.1
EditorExtensions.WriteLine Method (Editor, Decimal)
 Writes the line.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void WriteLine(
	this Editor ed,
	decimal value
)
<ExtensionAttribute>
Public Shared Sub WriteLine (
	ed As Editor,
	value As Decimal
)
public:
[ExtensionAttribute]
static void WriteLine(
	Editor^ ed,
	Decimal value
)
[<ExtensionAttribute>]
static member WriteLine :
        ed : Editor *
        value : decimal -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: System.Decimal
The value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
WriteLine Overload
Autodesk.AutoCAD.EditorInput Namespace