AcExtensionLibrary - v20.1
MenuFile Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.MenuFile
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class MenuFile
Public Class MenuFile
public ref class MenuFile
type MenuFile =  class end
The MenuFile type exposes the following members.
Constructors
Name | Description
MenuFile
 Initializes a new instance of the MenuFile class.
Top
Properties
Name | Description
Path
 Gets or sets the path.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace