AcExtentionLibrary - v20.1
TypedValueExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.TypedValueExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class TypedValueExtensions
<ExtensionAttribute>
Public NotInheritable Class TypedValueExtensions
[ExtensionAttribute]
public ref class TypedValueExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type TypedValueExtensions =  class end
Methods
Name | Description
ToResultTypedValue(ObjectId)
 To the result typed value.
ToResultTypedValue(Point2d)
 To the result typed value.
ToResultTypedValue(Point3d)
 To the result typed value.
ToResultTypedValue(Double)
 To the result typed value.
ToResultTypedValue(Int16)
 To the result typed value.
ToResultTypedValue(Int32)
 To the result typed value.
ToResultTypedValue(Int64)
 To the result typed value.
ToResultTypedValue(Object)
 To the result typed value.
ToResultTypedValue(String)
 To the result typed value.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace