AcExtensionLibrary - v20.1
SCMTimeValue Methods
The SCMTimeValue type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
SCMTimeValue Class
Autodesk.AutoCAD.ApplicationServices.PreferencesUser Namespace