AcMgd Extension Library- v20.1
EditorExtensions.GetSelection Method (Editor, AllowedClassFilter)
 Gets the selection.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PromptSelectionResult GetSelection(
	this Editor ed,
	AllowedClassFilter classFilter
)
<ExtensionAttribute>
Public Shared Function GetSelection (
	ed As Editor,
	classFilter As AllowedClassFilter
) As PromptSelectionResult
public:
[ExtensionAttribute]
static PromptSelectionResult^ GetSelection(
	Editor^ ed,
	AllowedClassFilter^ classFilter
)
[<ExtensionAttribute>]
static member GetSelection :
        ed : Editor *
        classFilter : AllowedClassFilter -> PromptSelectionResult
Parameters
ed
Type: Editor
The ed.
classFilter
Type: Autodesk.AutoCAD.EditorInput.AllowedClassFilter
The class filter.
Return Value
Type: PromptSelectionResult
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
GetSelection Overload
Autodesk.AutoCAD.EditorInput Namespace