Autocad Extension Framework Documentation - v20.1
DocumentExtensions.Save Method
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=42016.msg471429#msg471429
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void Save(
	this Document doc
)
<ExtensionAttribute>
Public Shared Sub Save (
	doc As Document
)
public:
[ExtensionAttribute]
static void Save(
	Document^ doc
)
[<ExtensionAttribute>]
static member Save :
        doc : Document -> unit
Parameters
doc
Type: Document
The document.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Document. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DocumentExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace