AcExtensionLibrary - v20.1
SCMTimeValue Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesUser.SCMTimeValue
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesUser
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class SCMTimeValue
Public Class SCMTimeValue
public ref class SCMTimeValue
type SCMTimeValue =  class end
The SCMTimeValue type exposes the following members.
Constructors
Name | Description
SCMTimeValue
 Initializes a new instance of the SCMTimeValue class.
Top
Properties
Name | Description
TimeLength
 Gets or sets the length of the time.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesUser Namespace