AcMgd Extension Library- v20.1
MLStyleDictionary Constructor
 Initializes a new instance of the MLStyleDictionary class.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public MLStyleDictionary(
	Transaction trx,
	DBDictionary dic,
	bool includingErased
)
Public Sub New (
	trx As Transaction,
	dic As DBDictionary,
	includingErased As Boolean
)
public:
MLStyleDictionary(
	Transaction^ trx,
	DBDictionary^ dic,
	bool includingErased
)
new :
        trx : Transaction *
        dic : DBDictionary *
        includingErased : bool -> MLStyleDictionary
Parameters
trx
Type: Transaction
The TRX.
dic
Type: DBDictionary
The dic.
includingErased
Type: System.Boolean
if set to true [including erased].
See Also
Reference
MLStyleDictionary Class
Autodesk.AutoCAD.DatabaseServices Namespace