AcExtentionLibrary - v20.1
DimStyleTableExtensions.GetDimStyleTableRecords Method (DimStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the dim style table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<DimStyleTableRecord> GetDimStyleTableRecords(
	this DimStyleTable symbolTbl,
	OpenMode mode = OpenMode.ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter.None
)
<ExtensionAttribute>
Public Shared Function GetDimStyleTableRecords (
	symbolTbl As DimStyleTable,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional filter As SymbolTableRecordFilter = SymbolTableRecordFilter.None
) As IEnumerable(Of DimStyleTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<DimStyleTableRecord^>^ GetDimStyleTableRecords(
	DimStyleTable^ symbolTbl,
	OpenMode mode = OpenMode::ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter::None
)
[<ExtensionAttribute>]
static member GetDimStyleTableRecords :
        symbolTbl : DimStyleTable *
        ?mode : OpenMode *
        ?filter : SymbolTableRecordFilter
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _filter = defaultArg filter SymbolTableRecordFilter.None
*)
-> IEnumerable<DimStyleTableRecord>
Parameters
symbolTbl
Type: DimStyleTable
The symbol table.
mode (Optional)
Type: OpenMode
The mode.
filter (Optional)
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
Return Value
Type: IEnumerable<DimStyleTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DimStyleTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DimStyleTableExtensions Class
GetDimStyleTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace