Autocad Extension Framework Documentation - v20.1
TransactionManagerExtensions.StartLockedTransaction Method (TransactionManager)
 Stars the locked transaction.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static LockedTransaction StartLockedTransaction(
	this TransactionManager tm
)
<ExtensionAttribute>
Public Shared Function StartLockedTransaction (
	tm As TransactionManager
) As LockedTransaction
public:
[ExtensionAttribute]
static LockedTransaction^ StartLockedTransaction(
	TransactionManager^ tm
)
[<ExtensionAttribute>]
static member StartLockedTransaction :
        tm : TransactionManager -> LockedTransaction
Parameters
tm
Type: TransactionManager
The tm.
Return Value
Type: LockedTransaction
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TransactionManager. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TransactionManagerExtensions Class
StartLockedTransaction Overload
Autodesk.AutoCAD.ApplicationServices Namespace