AcExtentionLibrary - v20.1
ObjectIdCollectionExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.ObjectIdCollectionExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class ObjectIdCollectionExtensions
<ExtensionAttribute>
Public NotInheritable Class ObjectIdCollectionExtensions
[ExtensionAttribute]
public ref class ObjectIdCollectionExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type ObjectIdCollectionExtensions =  class end
The ObjectIdCollectionExtensions type exposes the following members.
Methods
Name | Description
Add(ObjectIdCollection, ObjectIdCollection)
 Adds the specified ids.
Add(ObjectIdCollection, IEnumerable<ObjectId>)
 Adds the specified ids.
ToArray
 To the array.
ToObjectIdCollection(IEnumerable<DBObject>)
 To the object identifier collection.
ToObjectIdCollection(IEnumerable<ObjectId>)
 To the object identifier collection.
Where<T>(ObjectIdCollection, Func<T, Boolean>)
 Wheres the specified predicate.
Where<T>(ObjectIdCollection, Transaction, Func<T, Boolean>)
 Wheres the specified TRX.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace