AcExtensionLibrary - v20.1
ProxyObjectExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.ProxyObjectExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class ProxyObjectExtensions
<ExtensionAttribute>
Public NotInheritable Class ProxyObjectExtensions
[ExtensionAttribute]
public ref class ProxyObjectExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type ProxyObjectExtensions =  class end
The ProxyObjectExtensions type exposes the following members.
Methods
Name | Description
IsErasable
 Determines whether this instance is erasable.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace