AcMgd Extension Library- v20.1
MLStyleDictionary Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Drawable
 DBObject
 DBDictionary
 Autodesk.AutoCAD.DatabaseServices.WrapperDBDictionary<MLeaderStyle>
 Autodesk.AutoCAD.DatabaseServices.MLStyleDictionary
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class MLStyleDictionary : WrapperDBDictionary<MLeaderStyle>
Public Class MLStyleDictionary
	Inherits WrapperDBDictionary(Of MLeaderStyle)
public ref class MLStyleDictionary : public WrapperDBDictionary<MLeaderStyle^>
type MLStyleDictionary =
    class
        inherit WrapperDBDictionary<MLeaderStyle>
    end
The MLStyleDictionary type exposes the following members.
Constructors
Name | Description
MLStyleDictionary
 Initializes a new instance of the MLStyleDictionary class.
Top
Extension Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
 (Defined by DBObjectExtensions.)
GetEntries<T>(OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetEntries<T>(Transaction, OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetExtensionDictionary
 Gets the extension dictionary.
 (Defined by DBObjectExtensions.)
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
 (Defined by DBObjectExtensions.)
HasExtensionDictionary
 Determines whether [has extension dictionary].
 (Defined by DBObjectExtensions.)
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
TryGetExtensionDictionaryId
 Tries the get extension dictionary ObjectId.
 (Defined by DBObjectExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace