Autocad Extension Framework Documentation - v20.1
LinetypeTableExtensions.GetLinetypeTableRecords Method (LinetypeTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the linetype table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<LinetypeTableRecord> GetLinetypeTableRecords(
	this LinetypeTable symbolTbl,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter.None
)
<ExtensionAttribute>
Public Shared Function GetLinetypeTableRecords (
	symbolTbl As LinetypeTable,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional filter As SymbolTableRecordFilter = SymbolTableRecordFilter.None
) As IEnumerable(Of LinetypeTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<LinetypeTableRecord^>^ GetLinetypeTableRecords(
	LinetypeTable^ symbolTbl,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter::None
)
[<ExtensionAttribute>]
static member GetLinetypeTableRecords :
        symbolTbl : LinetypeTable *
        trx : Transaction *
        ?mode : OpenMode *
        ?filter : SymbolTableRecordFilter
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _filter = defaultArg filter SymbolTableRecordFilter.None
*)
-> IEnumerable<LinetypeTableRecord>
Parameters
symbolTbl
Type: LinetypeTable
The symbol table.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
filter (Optional)
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
Return Value
Type: IEnumerable<LinetypeTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type LinetypeTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
LinetypeTableExtensions Class
GetLinetypeTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace