AcExtentionLibrary - v20.1
ObjectIdExtensions.GetDBObject Method
Overload List
Name | Description
GetDBObject<T>(ObjectId, OpenMode, Boolean)
 Gets the database object.
GetDBObject(ObjectId, OpenMode, Boolean)
 Gets the database object.
GetDBObject<T>(ObjectId, Transaction, OpenMode, Boolean)
 Gets the database object.
GetDBObject(ObjectId, Transaction, OpenMode, Boolean)
 Gets the database object.
Top
See Also
Reference
ObjectIdExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace