Autocad Extension Framework Documentation - v20.1
Settings Constructor
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public Settings()
Public Sub New
public:
Settings()
new : unit -> Settings
See Also
Reference
Settings Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace