AcMgd Extension Library- v20.1
EnterpriseMenuFile Constructor
 Initializes a new instance of the EnterpriseMenuFile class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public EnterpriseMenuFile(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
EnterpriseMenuFile(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> EnterpriseMenuFile
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
EnterpriseMenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace