AcExtensionLibrary - v20.1
BlockTableRecordExtensions.GetAttributeDefinitions Method (BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute definitions.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<AttributeDefinition> GetAttributeDefinitions(
	this BlockTableRecord btr,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
<ExtensionAttribute>
Public Shared Function GetAttributeDefinitions (
	btr As BlockTableRecord,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false,
	Optional openObjectsOnLockedLayers As Boolean = false
) As IEnumerable(Of AttributeDefinition)
public:
[ExtensionAttribute]
static IEnumerable<AttributeDefinition^>^ GetAttributeDefinitions(
	BlockTableRecord^ btr,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
[<ExtensionAttribute>]
static member GetAttributeDefinitions :
        btr : BlockTableRecord *
        trx : Transaction *
        ?mode : OpenMode *
        ?includingErased : bool *
        ?openObjectsOnLockedLayers : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
        let _openObjectsOnLockedLayers = defaultArg openObjectsOnLockedLayers false
*)
-> IEnumerable<AttributeDefinition>
Parameters
btr
Type: BlockTableRecord
The BTR.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
openObjectsOnLockedLayers (Optional)
Type: System.Boolean
if set to true [open objects on locked layers].
Return Value
Type: IEnumerable<AttributeDefinition>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockTableRecordExtensions Class
GetAttributeDefinitions Overload
Autodesk.AutoCAD.DatabaseServices Namespace