AcExtentionLibrary - v20.1
DatabaseExtensions.GroupDBDictionary Method (Database, OpenMode)
 Groups the database dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static DBDictionary GroupDBDictionary(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function GroupDBDictionary (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As DBDictionary
public:
[ExtensionAttribute]
static DBDictionary^ GroupDBDictionary(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member GroupDBDictionary :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> DBDictionary
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: DBDictionary
Returns the DbDictionary for Groups
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
GroupDBDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace