Autocad Extension Framework Documentation - v20.1
BlockReferenceExtensions.GetEffectiveBlockTableRecord Method
Overload List
Name | Description
GetEffectiveBlockTableRecord(BlockReference)
 Gets the effective block table record.
GetEffectiveBlockTableRecord(BlockReference, Transaction)
 Gets the effective block table record.
Top
See Also
Reference
BlockReferenceExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace