AcExtentionLibrary - v20.1
DatabaseExtensions.LayoutDBDictionary Method
Overload List
Name | Description
LayoutDBDictionary(Database, OpenMode)
 Layouts the database dictionary.
LayoutDBDictionary(Database, Transaction, OpenMode)
 Layouts the database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace