AcMgd Extension Library- v20.1
ObjectOverrule<T> Properties
The ObjectOverrule<T> generic type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
See Also
Reference
ObjectOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace