AcExtensionLibrary - v20.1
ICommandClass.Doc Property
 Gets the document.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
Document Doc { get; }
ReadOnly Property Doc As Document
	Get
property Document^ Doc {
	Document^ get ();
}
abstract Doc : Document with get
Property Value
Type: Document
 The document.
See Also
Reference
ICommandClass Interface
Autodesk.AutoCAD.Runtime Namespace