Autocad Extension Framework Documentation - v20.1
Preferences.PrinterConfigPath Property
 Gets the printer configuration path.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static PrinterConfigPath PrinterConfigPath { get; }
Public Shared ReadOnly Property PrinterConfigPath As PrinterConfigPath
	Get
public:
static property PrinterConfigPath^ PrinterConfigPath {
	PrinterConfigPath^ get ();
}
static member PrinterConfigPath : PrinterConfigPath with get
Property Value
Type: PrinterConfigPath
 The printer configuration path.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace