AcMgd Extension Library- v20.1
TransactedSysytemVariables Constructor
Overload List
Name | Description
TransactedSysytemVariables(Document)
 Initializes a new instance of the TransactedSysytemVariables class.
TransactedSysytemVariables(Database)
 Initializes a new instance of the TransactedSysytemVariables class.
TransactedSysytemVariables(Transaction)
 Initializes a new instance of the TransactedSysytemVariables class.
Top
See Also
Reference
TransactedSysytemVariables Class
Autodesk.AutoCAD.Runtime Namespace