AcExtentionLibrary - v20.1
TransactedSysytemVariables Constructor (Database)
 Initializes a new instance of the TransactedSysytemVariables class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public TransactedSysytemVariables(
	Database db
)
Public Sub New (
	db As Database
)
public:
TransactedSysytemVariables(
	Database^ db
)
new :
        db : Database -> TransactedSysytemVariables
Parameters
db
Type: Database
The database.
See Also
Reference
TransactedSysytemVariables Class
TransactedSysytemVariables Overload
Autodesk.AutoCAD.Runtime Namespace