AcMgd Extension Library- v20.1
QNewTemplateFile.Path Property
 Gets or sets the path.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string Path { get; set; }
Public Property Path As String
	Get
	Set
public:
property String^ Path {
	String^ get ();
	void set (String^ value);
}
member Path : string with get, set
Property Value
Type: String
 The path.
See Also
Reference
QNewTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace