AcExtensionLibrary - v20.1
TextStyleTableExtensions.GetTextStyleTableRecords Method
Overload List
Name | Description
GetTextStyleTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
GetTextStyleTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the text style table records.
Top
See Also
Reference
TextStyleTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace