AcExtentionLibrary - v20.1
EditorExtensions.WriteLine Method (Editor, Boolean)
 Writes the line.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void WriteLine(
	this Editor ed,
	bool value
)
<ExtensionAttribute>
Public Shared Sub WriteLine (
	ed As Editor,
	value As Boolean
)
public:
[ExtensionAttribute]
static void WriteLine(
	Editor^ ed,
	bool value
)
[<ExtensionAttribute>]
static member WriteLine :
        ed : Editor *
        value : bool -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: System.Boolean
if set to true [value].
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
WriteLine Overload
Autodesk.AutoCAD.EditorInput Namespace