AcExtensionLibrary - v20.1
ObjectIdCollectionExtensions.Add Method
Overload List
Name | Description
Add(ObjectIdCollection, ObjectIdCollection)
 Adds the specified ids.
Add(ObjectIdCollection, IEnumerable<ObjectId>)
 Adds the specified ids.
Top
See Also
Reference
ObjectIdCollectionExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace