AcMgd Extension Library- v20.1
PromptKeywords Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.EditorInput.PromptKeywords
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class PromptKeywords
Public Class PromptKeywords
public ref class PromptKeywords
type PromptKeywords =  class end
The PromptKeywords type exposes the following members.
Constructors
Name | Description
PromptKeywords
Top
Methods
Name | Description
SetKeywords(String)
 Sets the keywords.
SetKeywords(String, String)
 Sets the keywords.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.EditorInput Namespace