AcExtensionLibrary - v20.1
DatabaseExtensions.MLStyleDictionary Method (Database, OpenMode, Boolean)
 Mls the style dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static MLStyleDictionary MLStyleDictionary(
	this Database database,
	OpenMode openMode = OpenMode.ForRead,
	bool includingErased = false
)
<ExtensionAttribute>
Public Shared Function MLStyleDictionary (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false
) As MLStyleDictionary
public:
[ExtensionAttribute]
static MLStyleDictionary^ MLStyleDictionary(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead,
	bool includingErased = false
)
[<ExtensionAttribute>]
static member MLStyleDictionary :
        database : Database *
        ?openMode : OpenMode *
        ?includingErased : bool
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
*)
-> MLStyleDictionary
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
Return Value
Type: MLStyleDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
MLStyleDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace