AcExtentionLibrary - v20.1
TemporarySystemVariables Properties
The TemporarySystemVariables type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the Object with the specified name.
 (Overrides Settings.SystemVariables.Item[String].)
Top
See Also
Reference
TemporarySystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace