AcExtentionLibrary - v20.1
BlockReferenceExtensions Methods
Methods
Name | Description
GetAttributeReferenceDictionary(BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
GetAttributeReferenceDictionary(BlockReference, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
GetAttributeReferences(BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute references.
GetAttributeReferences(BlockReference, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute references.
GetEffectiveBlockTableRecord(BlockReference)
 Gets the effective block table record.
GetEffectiveBlockTableRecord(BlockReference, Transaction)
 Gets the effective block table record.
GetEffectiveName(BlockReference)
 Gets the name of the effective.
GetEffectiveName(BlockReference, Transaction)
 Gets the name of the effective.
Top
See Also
Reference
BlockReferenceExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace