AcExtentionLibrary - v20.1
CurveExtensions Methods
The CurveExtensions type exposes the following members.
Methods
Name | Description
GetLength
 Slighty modified from original author Tony Tanzillo
Top
See Also
Reference
CurveExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace