AcExtentionLibrary - v20.1
AcadDirectory.Equals Method (AcadDirectory)
 Equalses the specified other.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool Equals(
	AcadDirectory other
)
Public Function Equals (
	other As AcadDirectory
) As Boolean
public:
virtual bool Equals(
	AcadDirectory^ other
) sealed
abstract Equals :
        other : AcadDirectory -> bool
override Equals :
        other : AcadDirectory -> bool
Parameters
other
Type: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.AcadDirectory
The other.
Return Value
Type: Boolean
See Also
Reference
AcadDirectory Class
Equals Overload
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace