AcMgd Extension Library- v20.1
PrinterDescPath Methods
The PrinterDescPath type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PrinterDescPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace