AcExtentionLibrary - v20.1
AcadDirectory Constructor
 Initializes a new instance of the AcadDirectory class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public AcadDirectory(
	string path
)
Public Sub New (
	path As String
)
public:
AcadDirectory(
	String^ path
)
new :
        path : string -> AcadDirectory
Parameters
path
Type: System.String
The path.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace