AcExtensionLibrary - v20.1
Settings.SystemVariables.BLOCKEDITOR Property
 Gets a value indicating whether this Settings.SystemVariables is blockeditor.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool BLOCKEDITOR { get; }
Public ReadOnly Property BLOCKEDITOR As Boolean
	Get
public:
property bool BLOCKEDITOR {
	bool get ();
}
member BLOCKEDITOR : bool with get
Property Value
Type: Boolean
true if blockeditor; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace