AcMgd Extension Library- v20.1
BlockTableExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.BlockTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class BlockTableExtensions
<ExtensionAttribute>
Public NotInheritable Class BlockTableExtensions
[ExtensionAttribute]
public ref class BlockTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type BlockTableExtensions =  class end
Methods
Name | Description
GetBlockTableRecords(BlockTable, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
GetBlockTableRecords(BlockTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
GetUserCreatedBlockTableRecords(BlockTable, OpenMode)
 Gets the user created block table records.
GetUserCreatedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user created block table records.
GetUserDefinedBlockTableRecords(BlockTable, OpenMode)
 Gets the user defined block table records.
GetUserDefinedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user defined block table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace