AcMgd Extension Library- v20.1
GripOverrule<T> Methods
The GripOverrule<T> generic type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
GripOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace