AcMgd Extension Library- v20.1
ResultTypeCode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum ResultTypeCode
Public Enumeration ResultTypeCode
public enum class ResultTypeCode
type ResultTypeCode
Members
Member name | Value | Description
RTNONE | 5000 |  The rtnone
RTREAL | 5001 |  The rtreal
RTPOINT | 5002 |  The rtpoint
RTSHORT | 5003 |  The rtshort
RTANG | 5004 |  The rtang
RTSTR | 5005 |  The RTSTR
RTENAME | 5006 |  The rtename
RTPICKS | 5007 |  The rtpicks
RTORINT | 5008 |  The rtorint
RT3DPOINT | 5009 |  The r t3 dpoint
RTLONG | 5010 |  The rtlong
RTVOID | 5014 |  The rtvoid
RTLB | 5016 |  The RTLB
RTLE | 5017 |  The rtle
RTDOTE | 5018 |  The rtdote
RTNIL | 5019 |  The rtnil
RTDXF0 | 5020 |  The RTDX f0
RTT | 5021 |  The RTT
RTRESBUF | 5023 |  The rtresbuf
RTMODELESS | 5027 |  The rtmodeless
RTINT64 | 5031 |  The rtin T64
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace