AcExtensionLibrary - v20.1
ToolPalettePath Constructor
 Initializes a new instance of the ToolPalettePath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public ToolPalettePath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
ToolPalettePath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> ToolPalettePath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
ToolPalettePath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace