AcExtentionLibrary - v20.1
SCMTimeValue Constructor
 Initializes a new instance of the SCMTimeValue class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesUser
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public SCMTimeValue(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
SCMTimeValue(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> SCMTimeValue
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
SCMTimeValue Class
Autodesk.AutoCAD.ApplicationServices.PreferencesUser Namespace