AcMgd Extension Library- v20.1
SupportPath.Insert Method
 Inserts the specified index.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public void Insert(
	int index,
	string path
)
Public Sub Insert (
	index As Integer,
	path As String
)
public:
virtual void Insert(
	int index,
	String^ path
) sealed
abstract Insert :
        index : int *
        path : string -> unit
override Insert :
        index : int *
        path : string -> unit
Parameters
index
Type: System.Int32
The index.
path
Type: System.String
The path.
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace