AcExtentionLibrary - v20.1
DBDictionaryExtensions.GetEntries Method
Overload List
Name | Description
GetEntries<T>(DBDictionary, OpenMode, Boolean)
 Gets the entries.
GetEntries<T>(DBDictionary, Transaction, OpenMode, Boolean)
 Gets the entries.
Top
See Also
Reference
DBDictionaryExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace