Autocad Extension Framework Documentation - v20.1
QNewTemplateFile Methods
The QNewTemplateFile type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
QNewTemplateFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace