Autocad Extension Framework Documentation - v20.1
BlockTableRecordExtensions.GetAllBlockReferences Method
Overload List
Name | Description
GetAllBlockReferences(BlockTableRecord, Boolean, Boolean)
 Gets all block references.
GetAllBlockReferences(BlockTableRecord, Transaction, Boolean, Boolean)
 Gets all block references.
Top
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace