AcExtensionLibrary - v20.1
ObjectIdCollectionExtensions Methods
The ObjectIdCollectionExtensions type exposes the following members.
Methods
Name | Description
Add(ObjectIdCollection, ObjectIdCollection)
 Adds the specified ids.
Add(ObjectIdCollection, IEnumerable<ObjectId>)
 Adds the specified ids.
ToArray
 To the array.
ToObjectIdCollection(IEnumerable<DBObject>)
 To the object identifier collection.
ToObjectIdCollection(IEnumerable<ObjectId>)
 To the object identifier collection.
Where<T>(ObjectIdCollection, Func<T, Boolean>)
 Wheres the specified predicate.
Where<T>(ObjectIdCollection, Transaction, Func<T, Boolean>)
 Wheres the specified TRX.
Top
See Also
Reference
ObjectIdCollectionExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace