AcExtentionLibrary - v20.1
SupportPath.SaveChanges Method
 Saves the changes.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public void SaveChanges()
Public Sub SaveChanges
public:
virtual void SaveChanges() sealed
abstract SaveChanges : unit -> unit
override SaveChanges : unit -> unit
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace