AcExtensionLibrary - v20.1
TemplateDWGPath Methods
The TemplateDWGPath type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
TemplateDWGPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace