Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.ViewTable Method
Overload List
Name | Description
ViewTable(Database, OpenMode)
 Views the table.
ViewTable(Database, Transaction, OpenMode)
 Views the table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace