AcExtentionLibrary - v20.1
MenuFile Methods
The MenuFile type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
MenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace