Autocad Extension Framework Documentation - v20.1
LayoutDictionary Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Drawable
 DBObject
 DBDictionary
 Autodesk.AutoCAD.DatabaseServices.WrapperDBDictionary<Layout>
 Autodesk.AutoCAD.DatabaseServices.LayoutDictionary
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class LayoutDictionary : WrapperDBDictionary<Layout>
Public Class LayoutDictionary
	Inherits WrapperDBDictionary(Of Layout)
public ref class LayoutDictionary : public WrapperDBDictionary<Layout^>
type LayoutDictionary =
    class
        inherit WrapperDBDictionary<Layout>
    end
The LayoutDictionary type exposes the following members.
Constructors
Name | Description
LayoutDictionary
 Initializes a new instance of the LayoutDictionary class.
Top
Extension Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
 (Defined by DBObjectExtensions.)
GetEntries<T>(OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetEntries<T>(Transaction, OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetExtensionDictionary
 Gets the extension dictionary.
 (Defined by DBObjectExtensions.)
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
 (Defined by DBObjectExtensions.)
HasExtensionDictionary
 Determines whether [has extension dictionary].
 (Defined by DBObjectExtensions.)
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
TryGetExtensionDictionaryId
 Tries the get extension dictionary ObjectId.
 (Defined by DBObjectExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace