AcExtensionLibrary - v20.1
TransactedSysytemVariables Constructor (Document)
 Initializes a new instance of the TransactedSysytemVariables class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public TransactedSysytemVariables(
	Document doc
)
Public Sub New (
	doc As Document
)
public:
TransactedSysytemVariables(
	Document^ doc
)
new :
        doc : Document -> TransactedSysytemVariables
Parameters
doc
Type: Document
The document.
See Also
Reference
TransactedSysytemVariables Class
TransactedSysytemVariables Overload
Autodesk.AutoCAD.Runtime Namespace