AcMgd Extension Library- v20.1
PrinterConfigPath Methods
The PrinterConfigPath type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PrinterConfigPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace