Autocad Extension Framework Documentation - v20.1
PrinterStyleSheetPath Methods
The PrinterStyleSheetPath type exposes the following members.
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
PrinterStyleSheetPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace