AcMgd Extension Library- v20.1
PromptKeywords.SetKeywords Method (String)
 Sets the keywords.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PromptKeywordOptions SetKeywords(
	string meassageAndKeywords
)
Public Shared Function SetKeywords (
	meassageAndKeywords As String
) As PromptKeywordOptions
public:
static PromptKeywordOptions^ SetKeywords(
	String^ meassageAndKeywords
)
static member SetKeywords :
        meassageAndKeywords : string -> PromptKeywordOptions
Parameters
meassageAndKeywords
Type: System.String
The meassage and keywords.
Return Value
Type: PromptKeywordOptions
Exceptions
Exception | Condition
ArgumentNullException | meassageAndKeywords is empty, whitespaces, or null
ArgumentException |  meassageAndKeywords must contain \[\ or meassageAndKeywords must contain \]\
ArgumentOutOfRangeException | \[\ must be before \]\
See Also
Reference
PromptKeywords Class
SetKeywords Overload
Autodesk.AutoCAD.EditorInput Namespace