AcExtensionLibrary - v20.1
SupportPath.RemoveRange Method
 Removes the range.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public void RemoveRange(
	int index,
	int count
)
Public Sub RemoveRange (
	index As Integer,
	count As Integer
)
public:
void RemoveRange(
	int index,
	int count
)
member RemoveRange :
        index : int *
        count : int -> unit
Parameters
index
Type: System.Int32
The index.
count
Type: System.Int32
The count.
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace