AcExtentionLibrary - v20.1
DatabaseExtensions.ViewportTable Method
Overload List
Name | Description
ViewportTable(Database, OpenMode)
 Viewports the table.
ViewportTable(Database, Transaction, OpenMode)
 Viewports the table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace