AcMgd Extension Library- v20.1
TypedValueExtensions.ToResultTypedValue Method (ObjectId)
 To the result typed value.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static TypedValue ToResultTypedValue(
	this ObjectId value
)
<ExtensionAttribute>
Public Shared Function ToResultTypedValue (
	value As ObjectId
) As TypedValue
public:
[ExtensionAttribute]
static TypedValue ToResultTypedValue(
	ObjectId value
)
[<ExtensionAttribute>]
static member ToResultTypedValue :
        value : ObjectId -> TypedValue
Parameters
value
Type: ObjectId
The value.
Return Value
Type: TypedValue
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectId. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TypedValueExtensions Class
ToResultTypedValue Overload
Autodesk.AutoCAD.DatabaseServices Namespace