AcMgd Extension Library- v20.1
EditorExtensions.WriteLine<T> Method (Editor, IEnumerable<T>)
 Writes the line.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static void WriteLine<T>(
	this Editor ed,
	IEnumerable<T> items
)
<ExtensionAttribute>
Public Shared Sub WriteLine(Of T) (
	ed As Editor,
	items As IEnumerable(Of T)
)
public:
[ExtensionAttribute]
generic<typename T>
static void WriteLine(
	Editor^ ed,
	IEnumerable<T>^ items
)
[<ExtensionAttribute>]
static member WriteLine :
        ed : Editor *
        items : IEnumerable<'T> -> unit
Parameters
ed
Type: Editor
The ed.
items
Type: System.Collections.Generic.IEnumerable<T>
The items.
Type Parameters
T
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
WriteLine Overload
Autodesk.AutoCAD.EditorInput Namespace