Autocad Extension Framework Documentation - v20.1
Preferences.SCMTimeValue Property
 Gets the SCM time value.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static SCMTimeValue SCMTimeValue { get; }
Public Shared ReadOnly Property SCMTimeValue As SCMTimeValue
	Get
public:
static property SCMTimeValue^ SCMTimeValue {
	SCMTimeValue^ get ();
}
static member SCMTimeValue : SCMTimeValue with get
Property Value
Type: SCMTimeValue
 The SCM time value.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace