AcExtentionLibrary - v20.1
LayerTableRecordExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.LayerTableRecordExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class LayerTableRecordExtensions
<ExtensionAttribute>
Public NotInheritable Class LayerTableRecordExtensions
[ExtensionAttribute]
public ref class LayerTableRecordExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type LayerTableRecordExtensions =  class end
The LayerTableRecordExtensions type exposes the following members.
Methods
Name | Description
LayerNameTypedValue
 Layers the name typed value.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace