Autocad Extension Framework Documentation - v20.1
PerDocData.Create Method
 Creates the specified document.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static PerDocData Create(
	Document doc
)
Public Shared Function Create (
	doc As Document
) As PerDocData
public:
static PerDocData^ Create(
	Document^ doc
)
static member Create :
        doc : Document -> PerDocData
Parameters
doc
Type: Document
The document.
Return Value
Type: PerDocData
See Also
Reference
PerDocData Class
Autodesk.AutoCAD.Runtime Namespace