AcExtensionLibrary - v20.1
Settings.SystemVariables.CTAB Property
 Gets or sets the ctab.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public string CTAB { get; set; }
Public Property CTAB As String
	Get
	Set
public:
property String^ CTAB {
	String^ get ();
	void set (String^ value);
}
member CTAB : string with get, set
Property Value
Type: String
 The ctab.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace