AcMgd Extension Library- v20.1
DBObjectExtensions.ExtensionDictionaryContains Method
 Extensions the dictionary contains.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static bool ExtensionDictionaryContains(
	this DBObject dbObj,
	string name
)
<ExtensionAttribute>
Public Shared Function ExtensionDictionaryContains (
	dbObj As DBObject,
	name As String
) As Boolean
public:
[ExtensionAttribute]
static bool ExtensionDictionaryContains(
	DBObject^ dbObj,
	String^ name
)
[<ExtensionAttribute>]
static member ExtensionDictionaryContains :
        dbObj : DBObject *
        name : string -> bool
Parameters
dbObj
Type: DBObject
The database object.
name
Type: System.String
The name.
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace