AcExtensionLibrary - v20.1
AnnotationScaleExtensions Methods
The AnnotationScaleExtensions type exposes the following members.
Methods
Name | Description
GetScaleFactor
 Returns Scale Factor(1.0 / AnnotationScale.Scale)
Top
See Also
Reference
AnnotationScaleExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace