AcExtensionLibrary - v20.1
DBObjectExtensions.GetExtensionDictionary Method
 Gets the extension dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static DBDictionary GetExtensionDictionary(
	this DBObject dbObj,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function GetExtensionDictionary (
	dbObj As DBObject,
	Optional openMode As OpenMode = OpenMode.ForRead
) As DBDictionary
public:
[ExtensionAttribute]
static DBDictionary^ GetExtensionDictionary(
	DBObject^ dbObj,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member GetExtensionDictionary :
        dbObj : DBObject *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> DBDictionary
Parameters
dbObj
Type: DBObject
The database object.
openMode (Optional)
Type: OpenMode
The open mode.
Return Value
Type: DBDictionary
 The existing extension dictionary or creates and add one if needed. use HasExtensionDictionary(DBObject) if only checking to see if it exist is needed
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace