AcExtentionLibrary - v20.1
DisplayScrollBars Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay.DisplayScrollBars
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class DisplayScrollBars
Public Class DisplayScrollBars
public ref class DisplayScrollBars
type DisplayScrollBars =  class end
The DisplayScrollBars type exposes the following members.
Constructors
Name | Description
DisplayScrollBars
 Initializes a new instance of the DisplayScrollBars class.
Top
Properties
Name | Description
Display
 Gets or sets a value indicating whether this DisplayScrollBars is display.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay Namespace