AcMgd Extension Library- v20.1
Extents3dExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.Extents3dExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class Extents3dExtensions
<ExtensionAttribute>
Public NotInheritable Class Extents3dExtensions
[ExtensionAttribute]
public ref class Extents3dExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type Extents3dExtensions =  class end
The Extents3dExtensions type exposes the following members.
Methods
Name | Description
CenterPoint
 Centers the point.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace