AcMgd Extension Library- v20.1
XrecordTypeCode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum XrecordTypeCode
Public Enumeration XrecordTypeCode
public enum class XrecordTypeCode
type XrecordTypeCode
Members
Member name | Value | Description
String | 1 |  The string
Point3d | 10 |  The point3d
Integer | 90 |  The integer
Double | 140 |  The double
Int64 | 160 |  The int64
Int16 | 170 |  The int16
Int8 | 280 |  The int8
Handle | 320 |  The handle
SoftPointerId | 330 |  The soft pointer identifier
HardPointerId | 340 |  The hard pointer identifier
SoftOwnershipId | 350 |  The soft ownership identifier
HardOwnershipId | 360 |  The hard ownership identifier
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace