AcMgd Extension Library- v20.1
TransactionManagerExtensions.StartLockedTransaction Method
Overload List
Name | Description
StartLockedTransaction(TransactionManager)
 Stars the locked transaction.
StartLockedTransaction(TransactionManager, DocumentLockMode, String, String, Boolean)
 Stars the locked transaction.
Top
See Also
Reference
TransactionManagerExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace