AcExtentionLibrary - v20.1
DisplayScrollBars.Display Property
 Gets or sets a value indicating whether this DisplayScrollBars is display.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public bool Display { get; set; }
Public Property Display As Boolean
	Get
	Set
public:
property bool Display {
	bool get ();
	void set (bool value);
}
member Display : bool with get, set
Property Value
Type: Boolean
true if display; otherwise, false.
See Also
Reference
DisplayScrollBars Class
Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay Namespace