Autocad Extension Framework Documentation - v20.1
BlockTableRecordExtensions.GetEntities Method (BlockTableRecord, Transaction, OpenMode, Boolean, Boolean)
 Author: Tony Tanzillo A combination of code written by Tony Tanzillo from 2 sources below Source1: http://www.theswamp.org/index.php?topic=42197.msg474011#msg474011 Source2: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<Entity> GetEntities(
	this BlockTableRecord btr,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
<ExtensionAttribute>
Public Shared Function GetEntities (
	btr As BlockTableRecord,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false,
	Optional openObjectsOnLockedLayers As Boolean = false
) As IEnumerable(Of Entity)
public:
[ExtensionAttribute]
static IEnumerable<Entity^>^ GetEntities(
	BlockTableRecord^ btr,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false,
	bool openObjectsOnLockedLayers = false
)
[<ExtensionAttribute>]
static member GetEntities :
        btr : BlockTableRecord *
        trx : Transaction *
        ?mode : OpenMode *
        ?includingErased : bool *
        ?openObjectsOnLockedLayers : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
        let _openObjectsOnLockedLayers = defaultArg openObjectsOnLockedLayers false
*)
-> IEnumerable<Entity>
Parameters
btr
Type: BlockTableRecord
The BTR.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
openObjectsOnLockedLayers (Optional)
Type: System.Boolean
if set to true [open objects on locked layers].
Return Value
Type: IEnumerable<Entity>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockTableRecord. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
BlockTableRecordExtensions Class
GetEntities Overload
Autodesk.AutoCAD.DatabaseServices Namespace