AcExtentionLibrary - v20.1
DatabaseExtensions.LayerTable Method (Database, Transaction, OpenMode)
 Layers the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static LayerTable LayerTable(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function LayerTable (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As LayerTable
public:
[ExtensionAttribute]
static LayerTable^ LayerTable(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member LayerTable :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> LayerTable
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: LayerTable
LayerTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
Examples
[CommandMethod("LayerTableTrx")]
public void LayerTableTrx()
{
    using (Transaction trx = Db.TransactionManager.StartTransaction())
    {
        LayerTable lt = Db.LayerTable(trx);
        Ed.WriteLine(lt.ObjectId);
    }
}
<CommandMethod("LayerTableTrx")>
Public Sub LayerTableTrx()
    Using trx As Transaction = Db.TransactionManager.StartTransaction
        Dim lt As LayerTable = Db.LayerTable(trx)
        Ed.WriteLine(lt.ObjectId)
    End Using
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
DatabaseExtensions Class
LayerTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace