AcMgd Extension Library- v20.1
ObjectIdTypeCode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum ObjectIdTypeCode
Public Enumeration ObjectIdTypeCode
public enum class ObjectIdTypeCode
type ObjectIdTypeCode
Members
Member name | Value | Description
SoftPointerId | 330 |  The soft pointer identifier
HardPointerId | 340 |  The hard pointer identifier
SoftOwnershipId | 350 |  The soft ownership identifier
HardOwnershipId | 360 |  The hard ownership identifier
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace