Autocad Extension Framework Documentation - v20.1
Point3dExtension.ToPoint2D Method
 To the point2 d.
Namespace: Autodesk.AutoCAD.Geometry
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static Point2d ToPoint2D(
	this Point3d pnt
)
<ExtensionAttribute>
Public Shared Function ToPoint2D (
	pnt As Point3d
) As Point2d
public:
[ExtensionAttribute]
static Point2d ToPoint2D(
	Point3d pnt
)
[<ExtensionAttribute>]
static member ToPoint2D :
        pnt : Point3d -> Point2d
Parameters
pnt
Type: Point3d
The PNT.
Return Value
Type: Point2d
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Point3d. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
Point3dExtension Class
Autodesk.AutoCAD.Geometry Namespace