AcMgd Extension Library- v20.1
Preferences.PrinterDescPath Property
 Gets the printer desc path.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static PrinterDescPath PrinterDescPath { get; }
Public Shared ReadOnly Property PrinterDescPath As PrinterDescPath
	Get
public:
static property PrinterDescPath^ PrinterDescPath {
	PrinterDescPath^ get ();
}
static member PrinterDescPath : PrinterDescPath with get
Property Value
Type: PrinterDescPath
 The printer desc path.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace