Autocad Extension Framework Documentation - v20.1
DocumentExtensions.SendCommand Method
 Sends the command.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void SendCommand(
	this Document doc,
	string command
)
<ExtensionAttribute>
Public Shared Sub SendCommand (
	doc As Document,
	command As String
)
public:
[ExtensionAttribute]
static void SendCommand(
	Document^ doc,
	String^ command
)
[<ExtensionAttribute>]
static member SendCommand :
        doc : Document *
        command : string -> unit
Parameters
doc
Type: Document
The document.
command
Type: System.String
The command.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Document. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DocumentExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace