AcExtensionLibrary - v20.1
DatabaseExtensions.RegAppTable Method
Overload List
Name | Description
RegAppTable(Database, OpenMode)
 Regs the application table.
RegAppTable(Database, Transaction, OpenMode)
 Regs the application table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace