AcMgd Extension Library- v20.1
XDataTypeCode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public enum XDataTypeCode
Public Enumeration XDataTypeCode
public enum class XDataTypeCode
type XDataTypeCode
Members
Member name | Value | Description
AsciiString | 1000 |  The ASCII string
RegAppName | 1001 |  The reg application name
ControlString | 1002 |  The control string
LayerName | 1003 |  The layer name
BinaryChunk | 1004 |  The binary chunk
Handle | 1005 |  The handle
XCoordinate | 1010 |  The x coordinate
WorldXCoordinate | 1011 |  The world x coordinate
WorldXDisp | 1012 |  The world x disp
WorldXDir | 1013 |  The world x dir
YCoordinate | 1020 |  The y coordinate
WorldYCoordinate | 1021 |  The world y coordinate
WorldYDisp | 1022 |  The world y disp
WorldYDir | 1023 |  The world y dir
ZCoordinate | 1030 |  The z coordinate
WorldZCoordinate | 1031 |  The world z coordinate
WorldZDisp | 1032 |  The world z disp
WorldZDir | 1033 |  The world z dir
Real | 1040 |  The real
Dist | 1041 |  The dist
Scale | 1042 |  The scale
Integer16 | 1070 |  The integer16
Integer32 | 1071 |  The integer32
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace