AcExtensionLibrary - v20.1
CurveExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.CurveExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class CurveExtensions
<ExtensionAttribute>
Public NotInheritable Class CurveExtensions
[ExtensionAttribute]
public ref class CurveExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type CurveExtensions =  class end
The CurveExtensions type exposes the following members.
Methods
Name | Description
GetLength
 Slighty modified from original author Tony Tanzillo
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace