AcExtensionLibrary - v20.1
DatabaseExtensions Class
 Extension class for Database object
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.DatabaseExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class DatabaseExtensions
<ExtensionAttribute>
Public NotInheritable Class DatabaseExtensions
[ExtensionAttribute]
public ref class DatabaseExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type DatabaseExtensions =  class end
The DatabaseExtensions type exposes the following members.
Methods
Name | Description
BlockTable(Database, OpenMode)
 Opens the BlockTable
BlockTable(Database, Transaction, OpenMode)
 Opens the BlockTable
ContinuousLinetypeId
 Continuouses the linetype identifier.
CurrentSpace(Database, OpenMode)
 Currents the space.
CurrentSpace(Database, Transaction, OpenMode)
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
DimStyleTable(Database, OpenMode)
 Dims the style table.
DimStyleTable(Database, Transaction, OpenMode)
 Dims the style table.
GroupDBDictionary(Database, OpenMode)
 Groups the database dictionary.
GroupDBDictionary(Database, Transaction, OpenMode)
 Groups the database dictionary.
GroupDictionary(Database, OpenMode, Boolean)
 Groups the dictionary.
GroupDictionary(Database, Transaction, OpenMode, Boolean)
 Groups the dictionary.
LayerTable(Database, OpenMode)
 Layers the table.
LayerTable(Database, Transaction, OpenMode)
 Layers the table.
LayoutDBDictionary(Database, OpenMode)
 Layouts the database dictionary.
LayoutDBDictionary(Database, Transaction, OpenMode)
 Layouts the database dictionary.
LayoutDictionary(Database, OpenMode, Boolean)
 Layouts the dictionary.
LayoutDictionary(Database, Transaction, OpenMode, Boolean)
 Layouts the dictionary.
LinetypeTable(Database, OpenMode)
 Linetypes the table.
LinetypeTable(Database, Transaction, OpenMode)
 Linetypes the table.
MLeaderStyleDBDictionary(Database, OpenMode)
 ms the leader style database dictionary.
MLeaderStyleDBDictionary(Database, Transaction, OpenMode)
 ms the leader style database dictionary.
MLStyleDBDictionary(Database, OpenMode)
 Mls the style database dictionary.
MLStyleDBDictionary(Database, Transaction, OpenMode)
 Mls the style database dictionary.
MLStyleDictionary(Database, OpenMode, Boolean)
 Mls the style dictionary.
MLStyleDictionary(Database, Transaction, OpenMode, Boolean)
 Mls the style dictionary.
ModelSpace(Database, OpenMode)
 Models the space.
ModelSpace(Database, Transaction, OpenMode)
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
NamedObjectDBDictionary(Database, OpenMode)
 Nameds the object database dictionary.
NamedObjectDBDictionary(Database, Transaction, OpenMode)
 Nameds the object database dictionary.
PlotSettingsDBDictionary(Database, OpenMode)
 Plots the settings database dictionary.
PlotSettingsDBDictionary(Database, Transaction, OpenMode)
 Plots the settings database dictionary.
RegAppTable(Database, OpenMode)
 Regs the application table.
RegAppTable(Database, Transaction, OpenMode)
 Regs the application table.
StandardDimStyle(Database)
 Standards the dim style.
StandardDimStyle(Database, Transaction)
 Standards the dim style.
StandardMLeaderStyle(Database)
 Standards the m leader style.
StandardMLeaderStyle(Database, Transaction)
 Standards the m leader style.
StandardMLStyle(Database)
 Standards the ml style.
StandardMLStyle(Database, Transaction)
 Standards the ml style.
StandardTextStyle
 Standards the text style.
TableStyleDBDictionary(Database, OpenMode)
 Tables the style database dictionary.
TableStyleDBDictionary(Database, Transaction, OpenMode)
 Tables the style database dictionary.
TextStyleTable(Database, OpenMode)
 Texts the style table.
TextStyleTable(Database, Transaction, OpenMode)
 Texts the style table.
UcsTable(Database, OpenMode)
 Ucses the table.
UcsTable(Database, Transaction, OpenMode)
 Ucses the table.
ViewportTable(Database, OpenMode)
 Viewports the table.
ViewportTable(Database, Transaction, OpenMode)
 Viewports the table.
ViewTable(Database, OpenMode)
 Views the table.
ViewTable(Database, Transaction, OpenMode)
 Views the table.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace