AcExtensionLibrary - v20.1
Settings Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.Core.Settings
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class Settings
Public Class Settings
public ref class Settings
type Settings =  class end
The Settings type exposes the following members.
Constructors
Name | Description
Settings
Top
Properties
Name | Description
Variables
 Gets the variables.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.Core Namespace