AcExtentionLibrary - v20.1
PrinterConfigPath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.SupportPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterConfigPath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class PrinterConfigPath : SupportPath
Public Class PrinterConfigPath
	Inherits SupportPath
public ref class PrinterConfigPath : public SupportPath
type PrinterConfigPath =
    class
        inherit SupportPath
    end
The PrinterConfigPath type exposes the following members.
Constructors
Name | Description
PrinterConfigPath
 Initializes a new instance of the PrinterConfigPath class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace