AcExtensionLibrary - v20.1
TransactedSysytemVariables Properties
The TransactedSysytemVariables type exposes the following members.
Properties
Name | Description
TransactedVariables
 Gets the transacted variables.
Top
See Also
Reference
TransactedSysytemVariables Class
Autodesk.AutoCAD.Runtime Namespace