AcMgd Extension Library- v20.1
SymbolTableRecordExtensions.Names Method
 Nameses the specified source.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<string> Names(
	this IEnumerable<SymbolTableRecord> source
)
<ExtensionAttribute>
Public Shared Function Names (
	source As IEnumerable(Of SymbolTableRecord)
) As IEnumerable(Of String)
public:
[ExtensionAttribute]
static IEnumerable<String^>^ Names(
	IEnumerable<SymbolTableRecord^>^ source
)
[<ExtensionAttribute>]
static member Names :
        source : IEnumerable<SymbolTableRecord> -> IEnumerable<string>
Parameters
source
Type: System.Collections.Generic.IEnumerable<SymbolTableRecord>
The source.
Return Value
Type: IEnumerable<String>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<SymbolTableRecord>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
SymbolTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace