Autocad Extension Framework Documentation - v20.1
Settings.SystemVariables.DWGTITLED Property
 Gets a value indicating whether this Settings.SystemVariables is dwgtitled.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public bool DWGTITLED { get; }
Public ReadOnly Property DWGTITLED As Boolean
	Get
public:
property bool DWGTITLED {
	bool get ();
}
member DWGTITLED : bool with get
Property Value
Type: Boolean
true if dwgtitled; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace