AcExtensionLibrary - v20.1
DatabaseExtensions.MLeaderStyleDBDictionary Method (Database, Transaction, OpenMode)
 ms the leader style database dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static DBDictionary MLeaderStyleDBDictionary(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function MLeaderStyleDBDictionary (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As DBDictionary
public:
[ExtensionAttribute]
static DBDictionary^ MLeaderStyleDBDictionary(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member MLeaderStyleDBDictionary :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> DBDictionary
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: DBDictionary
Returns the DbDictionary for MLeaderStyles
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
MLeaderStyleDBDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace