AcExtensionLibrary - v20.1
Preferences.MenuFile Property
 Gets the menu file.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static MenuFile MenuFile { get; }
Public Shared ReadOnly Property MenuFile As MenuFile
	Get
public:
static property MenuFile^ MenuFile {
	MenuFile^ get ();
}
static member MenuFile : MenuFile with get
Property Value
Type: MenuFile
 The menu file.
See Also
Reference
Preferences Class
Autodesk.AutoCAD.ApplicationServices Namespace