AcMgd Extension Library- v20.1
TransactedSysytemVariables.TransactedVariables Property
 Gets the transacted variables.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public TemporarySystemVariables TransactedVariables { get; }
Public ReadOnly Property TransactedVariables As TemporarySystemVariables
	Get
public:
property TemporarySystemVariables^ TransactedVariables {
	TemporarySystemVariables^ get ();
}
member TransactedVariables : TemporarySystemVariables with get
Property Value
Type: TemporarySystemVariables
 The transacted variables.
See Also
Reference
TransactedSysytemVariables Class
Autodesk.AutoCAD.Runtime Namespace