AcExtentionLibrary - v20.1
DatabaseExtensions.ViewTable Method (Database, OpenMode)
 Views the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ViewTable ViewTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function ViewTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As ViewTable
public:
[ExtensionAttribute]
static ViewTable^ ViewTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member ViewTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> ViewTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: ViewTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
ViewTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace