AcExtentionLibrary - v20.1
PrinterDescPath Constructor
 Initializes a new instance of the PrinterDescPath class.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public PrinterDescPath(
	Object acadPreferences
)
Public Sub New (
	acadPreferences As Object
)
public:
PrinterDescPath(
	Object^ acadPreferences
)
new :
        acadPreferences : Object -> PrinterDescPath
Parameters
acadPreferences
Type: System.Object
The acad preferences.
See Also
Reference
PrinterDescPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace