AcExtensionLibrary - v20.1
SymbolTableRecordFilterExtensions.IsSet Method
 Determines whether the specified test flag is set.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static bool IsSet(
	this SymbolTableRecordFilter filter,
	SymbolTableRecordFilter testFlag
)
<ExtensionAttribute>
Public Shared Function IsSet (
	filter As SymbolTableRecordFilter,
	testFlag As SymbolTableRecordFilter
) As Boolean
public:
[ExtensionAttribute]
static bool IsSet(
	SymbolTableRecordFilter filter,
	SymbolTableRecordFilter testFlag
)
[<ExtensionAttribute>]
static member IsSet :
        filter : SymbolTableRecordFilter *
        testFlag : SymbolTableRecordFilter -> bool
Parameters
filter
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
testFlag
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The test flag.
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type SymbolTableRecordFilter. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentNullException | testFlag
See Also
Reference
SymbolTableRecordFilterExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace