AcExtensionLibrary - v20.1
AcTransactionManager
Transaction Manager
AcDbTransactionManager
namespace Autodesk.AutoCAD.DatabaseServices
{
    using Autodesk.AutoCAD.Runtime;
    using System;
    using System.Runtime.InteropServices;
    [Wrapper("AcDbTransactionManager")]
    public class TransactionManager : RXObject
    {
        protected internal TransactionManager(IntPtr unmanagedPointer, [MarshalAs(UnmanagedType.U1)] bool autoDelete) : base(unmanagedPointer, autoDelete)
        {
        }
        public virtual unsafe void AddNewlyCreatedDBObject(DBObject obj, [MarshalAs(UnmanagedType.U1)] bool add)
        {
            AcDbTransactionManager* impObj = this.GetImpObj();
            int num = (int) **(((long*) impObj))[0x60L](impObj, obj.GetImpObj(), add);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            obj.AutoDelete = false;
        }
        public virtual unsafe DBObjectCollection GetAllObjects()
        {
            DBObjectCollection objects = new DBObjectCollection();
            AcDbTransactionManager* impObj = this.GetImpObj();
            int num = (int) **(((long*) impObj))[0x68L](impObj, objects.GetImpObj());
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            return objects;
        }
        internal unsafe AcDbTransactionManager* GetImpObj()
        {
            return (AcDbTransactionManager*) base.GetImpObj();
        }
        public virtual DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode)
        {
            return GetObjectInternal(this.GetImpObj(), id, mode, false, false);
        }
        public virtual DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode, [MarshalAs(UnmanagedType.U1)] bool openErased)
        {
            return GetObjectInternal(this.GetImpObj(), id, mode, openErased, false);
        }
        public virtual DBObject GetObject(ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode, [MarshalAs(UnmanagedType.U1)] bool openErased, [MarshalAs(UnmanagedType.U1)] bool forceOpenOnLockedLayer)
        {
            return GetObjectInternal(this.GetImpObj(), id, mode, openErased, forceOpenOnLockedLayer);
        }
        internal static unsafe DBObject GetObjectInternal(AcDbTransactionManager* pTM, ObjectId id, Autodesk.AutoCAD.DatabaseServices.OpenMode mode, [MarshalAs(UnmanagedType.U1)] bool openErased, [MarshalAs(UnmanagedType.U1)] bool forceOpenOnLockedLayer)
        {
            AcDbObject* objPtr;
            int num = GetObjectInTransaction(&objPtr, pTM, (AcDbObjectId) ((long) &id), (AcDb.OpenMode) mode, openErased, forceOpenOnLockedLayer);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
            IntPtr unmanagedPointer = new IntPtr((void*) objPtr);
            return (DBObject) RXObject.Create(unmanagedPointer, false);
        }
        public virtual unsafe void QueueForGraphicsFlush()
        {
            AcDbTransactionManager* impObj = this.GetImpObj();
            int num = (int) **(((long*) impObj))[0x90L](impObj);
            if (num != 0)
            {
                throw new Autodesk.AutoCAD.Runtime.Exception((Autodesk.AutoCAD.Runtime.ErrorStatus) num);
            }
        }
        public virtual OpenCloseTransaction StartOpenCloseTransaction()
        {
            return new OpenCloseTransaction();
        }
        public virtual unsafe Transaction StartTransaction()
        {
            AcDbTransactionManager* impObj = this.GetImpObj();
            AcTransaction* transactionPtr = (AcTransaction*) **(((long*) impObj))[0x38L](impObj);
            IntPtr returnValue = new IntPtr((void*) transactionPtr);
            Interop.CheckNull(returnValue);
            return new Transaction(new IntPtr((void*) transactionPtr), true);
        }
        public virtual int NumberOfActiveTransactions
        {
            get
            {
                AcDbTransactionManager* impObj = this.GetImpObj();
                return (int) **(((long*) impObj))[80L](impObj);
            }
        }
        public virtual Transaction TopTransaction
        {
            get
            {
                AcDbTransactionManager* impObj = this.GetImpObj();
                AcTransaction* transactionPtr = (AcTransaction*) **(((long*) impObj))[0x58L](impObj);
                if (transactionPtr != null)
                {
                    return new Transaction(new IntPtr((void*) transactionPtr), false);
                }
                return null;
            }
        }
    }
}
AcTransactionManager
namespace Autodesk.AutoCAD.ApplicationServices
{
    using Autodesk.AutoCAD.DatabaseServices;
    using Autodesk.AutoCAD.Runtime;
    using System;
    using System.Runtime.InteropServices;
    [Wrapper("AcTransactionManager")]
    public sealed class TransactionManager : Autodesk.AutoCAD.DatabaseServices.TransactionManager
    {
        internal TransactionManager(IntPtr unmanagedObject, [MarshalAs(UnmanagedType.U1)] bool bAutoDelete) : base(unmanagedObject, bAutoDelete)
        {
        }
        protected sealed override void DeleteUnmanagedObject()
        {
        }
        public unsafe void EnableGraphicsFlush([MarshalAs(UnmanagedType.U1)] bool doEnable)
        {
            AcTransactionManager* impObj = this.GetImpObj();
            Interop.Check((int) **(((long*) impObj))[0x98L](impObj, doEnable));
        }
        public unsafe void FlushGraphics()
        {
            AcTransactionManager* impObj = this.GetImpObj();
            **(((long*) impObj))[160L](impObj);
        }
        internal unsafe AcTransactionManager* GetImpObj()
        {
            return (AcTransactionManager*) base.UnmanagedObject.ToPointer();
        }
        public sealed override unsafe Transaction StartTransaction()
        {
            AcTransactionManager* impObj = this.GetImpObj();
            AcTransaction* transactionPtr = (AcTransaction*) **(((long*) impObj))[0x38L](impObj);
            IntPtr returnValue = new IntPtr((void*) transactionPtr);
            Interop.CheckNull(returnValue);
            return new AppTransaction(new IntPtr((void*) transactionPtr), true, this);
        }
        public override Transaction TopTransaction
        {
            get
            {
                AcTransactionManager* impObj = this.GetImpObj();
                AcTransaction* transactionPtr = (AcTransaction*) **(((long*) impObj))[0x58L](impObj);
                if (transactionPtr != null)
                {
                    return new AppTransaction(new IntPtr((void*) transactionPtr), false, this);
                }
                return null;
            }
        }
    }
}