Autocad Extension Framework Documentation - v20.1
SymbolTableRecordFilter Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
[FlagsAttribute]
public enum SymbolTableRecordFilter
<FlagsAttribute>
Public Enumeration SymbolTableRecordFilter
[FlagsAttribute]
public enum class SymbolTableRecordFilter
[<FlagsAttribute>]
type SymbolTableRecordFilter
Members
Member name | Value | Description
None | 0 |  No filter is used
IncludedErased | 1 |  Includes erased entities
IncludeDependent | 2 |  This returns symboltablerecords from xref's
IncludedErasedAndDependent | 3 |  The included erased and dependent
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace