Autocad Extension Framework Documentation - v20.1
ObjectIdExtensions.GetDBObject Method (ObjectId, OpenMode, Boolean)
 Gets the database object.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static DBObject GetDBObject(
	this ObjectId id,
	OpenMode mode = OpenMode.ForRead,
	bool openErased = false
)
<ExtensionAttribute>
Public Shared Function GetDBObject (
	id As ObjectId,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional openErased As Boolean = false
) As DBObject
public:
[ExtensionAttribute]
static DBObject^ GetDBObject(
	ObjectId id,
	OpenMode mode = OpenMode::ForRead,
	bool openErased = false
)
[<ExtensionAttribute>]
static member GetDBObject :
        id : ObjectId *
        ?mode : OpenMode *
        ?openErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _openErased = defaultArg openErased false
*)
-> DBObject
Parameters
id
Type: ObjectId
The identifier.
mode (Optional)
Type: OpenMode
The mode.
openErased (Optional)
Type: System.Boolean
if set to true [open erased].
Return Value
Type: DBObject
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectId. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdExtensions Class
GetDBObject Overload
Autodesk.AutoCAD.DatabaseServices Namespace