AcExtentionLibrary - v20.1
GripOverrule<T> Properties
The GripOverrule<T> generic type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
See Also
Reference
GripOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace