Autocad Extension Framework Documentation - v20.1
ObjectIdExtensions.GetEntity Method (ObjectId, OpenMode, Boolean, Boolean)
 Gets the entity.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static Entity GetEntity(
	this ObjectId id,
	OpenMode mode = OpenMode.ForRead,
	bool openErased = false,
	bool forceOpenOnLockedLayer = false
)
<ExtensionAttribute>
Public Shared Function GetEntity (
	id As ObjectId,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional openErased As Boolean = false,
	Optional forceOpenOnLockedLayer As Boolean = false
) As Entity
public:
[ExtensionAttribute]
static Entity^ GetEntity(
	ObjectId id,
	OpenMode mode = OpenMode::ForRead,
	bool openErased = false,
	bool forceOpenOnLockedLayer = false
)
[<ExtensionAttribute>]
static member GetEntity :
        id : ObjectId *
        ?mode : OpenMode *
        ?openErased : bool *
        ?forceOpenOnLockedLayer : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _openErased = defaultArg openErased false
        let _forceOpenOnLockedLayer = defaultArg forceOpenOnLockedLayer false
*)
-> Entity
Parameters
id
Type: ObjectId
The identifier.
mode (Optional)
Type: OpenMode
The mode.
openErased (Optional)
Type: System.Boolean
if set to true [open erased].
forceOpenOnLockedLayer (Optional)
Type: System.Boolean
if set to true [force open on locked layer].
Return Value
Type: Entity
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ObjectId. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdExtensions Class
GetEntity Overload
Autodesk.AutoCAD.DatabaseServices Namespace