AcExtentionLibrary - v20.1
Autodesk.AutoCAD.ApplicationServices Namespace
 Namespace containing ApplicationServices that are windows platform specific.
Classes
Class | Description
ApplicationExtensions
DocumentExtensions
Preferences
StringExtensions
TransactionManagerExtensions