AcExtentionLibrary - v20.1
DBObjectExtensions.GetExtensionDictionaryId Method
 Gets the extension dictionary identifier.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static ObjectId GetExtensionDictionaryId(
	this DBObject dbObj
)
<ExtensionAttribute>
Public Shared Function GetExtensionDictionaryId (
	dbObj As DBObject
) As ObjectId
public:
[ExtensionAttribute]
static ObjectId GetExtensionDictionaryId(
	DBObject^ dbObj
)
[<ExtensionAttribute>]
static member GetExtensionDictionaryId :
        dbObj : DBObject -> ObjectId
Parameters
dbObj
Type: DBObject
The database object.
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace