AcExtensionLibrary - v20.1
SupportPath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.SupportPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterConfigPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterDescPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterStyleSheetPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.ToolPalettePath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public class SupportPath
Public Class SupportPath
public ref class SupportPath
type SupportPath =  class end
The SupportPath type exposes the following members.
Constructors
Name | Description
SupportPath
 Initializes a new instance of the SupportPath class.
Top
Methods
Name | Description
Add
 Adds the specified path.
Clear
 Clears this instance.
Contains
 Determines whether [contains] [the specified path].
GetPaths
 Gets the paths.
Insert
 Inserts the specified index.
Remove
 Removes the specified path.
RemoveAll
 Removes all.
RemoveAt
 Removes at.
RemoveRange
 Removes the range.
SaveChanges
 Saves the changes.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace