AcExtentionLibrary - v20.1
TransactedSysytemVariables Constructor (Transaction)
 Initializes a new instance of the TransactedSysytemVariables class.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public TransactedSysytemVariables(
	Transaction trx
)
Public Sub New (
	trx As Transaction
)
public:
TransactedSysytemVariables(
	Transaction^ trx
)
new :
        trx : Transaction -> TransactedSysytemVariables
Parameters
trx
Type: Transaction
The TRX.
See Also
Reference
TransactedSysytemVariables Class
TransactedSysytemVariables Overload
Autodesk.AutoCAD.Runtime Namespace