AcExtensionLibrary - v20.1
AcadDirectory.Inequality Operator
 Implements the operator !=.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static bool operator !=(
	AcadDirectory acadDir1,
	AcadDirectory acadDir2
)
Public Shared Operator <> (
	acadDir1 As AcadDirectory,
	acadDir2 As AcadDirectory
) As Boolean
public:
static bool operator !=(
	AcadDirectory^ acadDir1,
	AcadDirectory^ acadDir2
)
static let inline (<>)
        acadDir1 : AcadDirectory *
        acadDir2 : AcadDirectory  : bool
Parameters
acadDir1
Type: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.AcadDirectory
The acad dir1.
acadDir2
Type: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.AcadDirectory
The acad dir2.
Return Value
Type: Boolean
 The result of the operator.
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace