AcExtentionLibrary - v20.1
AcadDirectory Properties
The AcadDirectory type exposes the following members.
Properties
Name | Description
Exists
 Gets a value indicating whether this AcadDirectory is exists.
Name
 Gets the name.
Path
 Gets the path.
Top
See Also
Reference
AcadDirectory Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace