AcExtensionLibrary - v20.1
Settings.SystemVariables.SAVETIME Property
 Gets or sets the savetime.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short SAVETIME { get; set; }
Public Property SAVETIME As Short
	Get
	Set
public:
property short SAVETIME {
	short get ();
	void set (short value);
}
member SAVETIME : int16 with get, set
Property Value
Type: Int16
 The savetime.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace