Autocad Extension Framework Documentation - v20.1
CommandClass.Doc Property
 Gets the document.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public Document Doc { get; }
Public ReadOnly Property Doc As Document
	Get
public:
virtual property Document^ Doc {
	Document^ get () sealed;
}
abstract Doc : Document with get
override Doc : Document with get
Property Value
Type: Document
 The document.
Implements
ICommandClass.Doc
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace