AcExtentionLibrary - v20.1
DatabaseExtensions.CurrentSpace Method
Overload List
Name | Description
CurrentSpace(Database, OpenMode)
 Currents the space.
CurrentSpace(Database, Transaction, OpenMode)
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=41311.msg464457#msg464457
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace