Autocad Extension Framework Documentation - v20.1
DatabaseExtensions.TextStyleTable Method (Database, OpenMode)
 Texts the style table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static TextStyleTable TextStyleTable(
	this Database database,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function TextStyleTable (
	database As Database,
	Optional openMode As OpenMode = OpenMode.ForRead
) As TextStyleTable
public:
[ExtensionAttribute]
static TextStyleTable^ TextStyleTable(
	Database^ database,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member TextStyleTable :
        database : Database *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> TextStyleTable
Parameters
database
Type: Database
The database.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: TextStyleTable
TextStyleTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
TextStyleTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace