Autocad Extension Framework Documentation - v20.1
DBObjectExtensions Class
 Extension class for DBObject object
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.DBObjectExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class DBObjectExtensions
<ExtensionAttribute>
Public NotInheritable Class DBObjectExtensions
[ExtensionAttribute]
public ref class DBObjectExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type DBObjectExtensions =  class end
The DBObjectExtensions type exposes the following members.
Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
GetExtensionDictionary
 Gets the extension dictionary.
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
HasExtensionDictionary
 Determines whether [has extension dictionary].
TryGetExtensionDictionaryId
 Tries the get extension dictionary ObjectId.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace