Autocad Extension Framework Documentation - v20.1
TextScaling Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public enum TextScaling
Public Enumeration TextScaling
public enum class TextScaling
type TextScaling
Members
Member name | Value | Description
None | 0 |  The none
UseNonAnnotative | 1 |  The use non annotative
UseAnnotative | 2 |  The use annotative
UseAndScaleNonAnnotative | 3 |  The use and scale non annotative
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace