Autocad Extension Framework Documentation - v20.1
StringExtensions.Matches Method
 Matcheses the specified pattern.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static bool Matches(
	this string str,
	string pattern,
	bool ignoreCase = true
)
<ExtensionAttribute>
Public Shared Function Matches (
	str As String,
	pattern As String,
	Optional ignoreCase As Boolean = true
) As Boolean
public:
[ExtensionAttribute]
static bool Matches(
	String^ str,
	String^ pattern,
	bool ignoreCase = true
)
[<ExtensionAttribute>]
static member Matches :
        str : string *
        pattern : string *
        ?ignoreCase : bool
(* Defaults:
        let _ignoreCase = defaultArg ignoreCase true
*)
-> bool
Parameters
str
Type: System.String
The string.
pattern
Type: System.String
The pattern.
ignoreCase (Optional)
Type: System.Boolean
if set to true [ignore case].
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type String. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
StringExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace