AcMgd Extension Library- v20.1
DisplayScrollBars Properties
The DisplayScrollBars type exposes the following members.
Properties
Name | Description
Display
 Gets or sets a value indicating whether this DisplayScrollBars is display.
Top
See Also
Reference
DisplayScrollBars Class
Autodesk.AutoCAD.ApplicationServices.PreferencesDisplay Namespace