AcExtensionLibrary - v20.1
TextStyleTableExtensions.GetShapeFileTableRecords Method
Overload List
Name | Description
GetShapeFileTableRecords(TextStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
GetShapeFileTableRecords(TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
Top
See Also
Reference
TextStyleTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace