AcMgd Extension Library- v20.1
TextStyleTableExtensions.GetShapeFileTableRecords Method (TextStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the shape file table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static IEnumerable<TextStyleTableRecord> GetShapeFileTableRecords(
	this TextStyleTable symbolTbl,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter.None
)
<ExtensionAttribute>
Public Shared Function GetShapeFileTableRecords (
	symbolTbl As TextStyleTable,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional filter As SymbolTableRecordFilter = SymbolTableRecordFilter.None
) As IEnumerable(Of TextStyleTableRecord)
public:
[ExtensionAttribute]
static IEnumerable<TextStyleTableRecord^>^ GetShapeFileTableRecords(
	TextStyleTable^ symbolTbl,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	SymbolTableRecordFilter filter = SymbolTableRecordFilter::None
)
[<ExtensionAttribute>]
static member GetShapeFileTableRecords :
        symbolTbl : TextStyleTable *
        trx : Transaction *
        ?mode : OpenMode *
        ?filter : SymbolTableRecordFilter
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _filter = defaultArg filter SymbolTableRecordFilter.None
*)
-> IEnumerable<TextStyleTableRecord>
Parameters
symbolTbl
Type: TextStyleTable
The symbol table.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
filter (Optional)
Type: Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilter
The filter.
Return Value
Type: IEnumerable<TextStyleTableRecord>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TextStyleTable. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TextStyleTableExtensions Class
GetShapeFileTableRecords Overload
Autodesk.AutoCAD.DatabaseServices Namespace