AcMgd Extension Library- v20.1
Settings.SystemVariables.CURSORSIZE Property
 Gets or sets the cursorsize.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0
Syntax
public short CURSORSIZE { get; set; }
Public Property CURSORSIZE As Short
	Get
	Set
public:
property short CURSORSIZE {
	short get ();
	void set (short value);
}
member CURSORSIZE : int16 with get, set
Property Value
Type: Int16
 The cursorsize.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace