Autocad Extension Framework Documentation - v20.1
GripOverrule<T> Class
 Grip
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Overrule
 GripOverrule
 Autodesk.AutoCAD.DatabaseServices.GripOverrule<T>
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public abstract class GripOverrule<T> : GripOverrule
where T : Entity
Public MustInherit Class GripOverrule(Of T As Entity)
	Inherits GripOverrule
generic<typename T>
where T : Entity
public ref class GripOverrule abstract : public GripOverrule
[<AbstractClassAttribute>]
type GripOverrule<'T when 'T : Entity> =
    class
        inherit GripOverrule
    end
Type Parameters
T
The GripOverrule<T> type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace