Autocad Extension Framework Documentation - v20.1
ObjectIdExtensions.GetEntity Method
Overload List
Name | Description
GetEntity<T>(ObjectId, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity(ObjectId, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity<T>(ObjectId, Transaction, OpenMode, Boolean, Boolean)
 Gets the entity.
GetEntity(ObjectId, Transaction, OpenMode, Boolean, Boolean)
 Gets the entity.
Top
See Also
Reference
ObjectIdExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace