AcExtensionLibrary - v20.1
SymbolTableExtensions Class
 Extension Methods for SymbolTable class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.SymbolTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static class SymbolTableExtensions
<ExtensionAttribute>
Public NotInheritable Class SymbolTableExtensions
[ExtensionAttribute]
public ref class SymbolTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type SymbolTableExtensions =  class end
The SymbolTableExtensions type exposes the following members.
Methods
Name | Description
GetErasedObjectIds
 Gets the erased object ids.
GetObjectIds
 Gets the object ids of the SymbolTable.
Top
Remarks
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace