AcExtentionLibrary - v20.1
DatabaseExtensions.DimStyleTable Method (Database, Transaction, OpenMode)
 Dims the style table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0
Syntax
public static DimStyleTable DimStyleTable(
	this Database database,
	Transaction transaction,
	OpenMode openMode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function DimStyleTable (
	database As Database,
	transaction As Transaction,
	Optional openMode As OpenMode = OpenMode.ForRead
) As DimStyleTable
public:
[ExtensionAttribute]
static DimStyleTable^ DimStyleTable(
	Database^ database,
	Transaction^ transaction,
	OpenMode openMode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member DimStyleTable :
        database : Database *
        transaction : Transaction *
        ?openMode : OpenMode
(* Defaults:
        let _openMode = defaultArg openMode OpenMode.ForRead
*)
-> DimStyleTable
Parameters
database
Type: Database
The database.
transaction
Type: Transaction
The transaction.
openMode (Optional)
Type: OpenMode
The openMode.
Return Value
Type: DimStyleTable
DimStyleTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
Examples
[CommandMethod("DimStyleTableTrx")]
public void DimStyleTableTrx()
{
    using (Transaction trx = Db.TransactionManager.StartTransaction())
    {
        DimStyleTable dt = Db.DimStyleTable(trx);
        Ed.WriteLine(dt.ObjectId);
    }
}
<CommandMethod("DimStyleTableTrx")>
Public Sub DimStyleTableTrx()
    Using trx As Transaction = Db.TransactionManager.StartTransaction
        Dim dt As DimStyleTable = Db.DimStyleTable(trx)
        Ed.WriteLine(dt.ObjectId)
    End Using
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
DatabaseExtensions Class
DimStyleTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace