Autocad Extension Framework Documentation
BlockReferenceExtensions.GetEffectiveName Method
Overload List
Name | Description
GetEffectiveName(BlockReference)
 Gets the name of the effective.
GetEffectiveName(BlockReference, Transaction)
 Gets the name of the effective.
Top
See Also
Reference
BlockReferenceExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace