Autocad Extension Framework Documentation
Settings.SystemVariables.Item Property
 Gets or sets the Object with the specified name.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public virtual Object this[
	string name
] { get; set; }
Public Overridable Default Property Item (
	name As String
) As Object
	Get
	Set
public:
virtual property Object^ default[String^ name] {
	Object^ get (String^ name);
	void set (String^ name, Object^ value);
}
abstract Item : Object with get, set
override Item : Object with get, set
Parameters
name
Type: System.String
The name.
Property Value
Type: Object
 The Object.
Return Value
Type: Object
Exceptions
Exception | Condition
ArgumentNullException | {0} is Empty or Null
ArgumentException |  InvalidName or
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace