Autocad Extension Framework Documentation
Point3dExtension Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.Geometry.Point3dExtension
Namespace: Autodesk.AutoCAD.Geometry
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class Point3dExtension
<ExtensionAttribute>
Public NotInheritable Class Point3dExtension
[ExtensionAttribute]
public ref class Point3dExtension abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type Point3dExtension =  class end
The Point3dExtension type exposes the following members.
Methods
Name | Description
ToPoint2D
 To the point2 d.
Top
See Also
Reference
Autodesk.AutoCAD.Geometry Namespace