Autocad Extension Framework Documentation
DatabaseExtensions.LayoutDictionary Method (Database, Transaction, OpenMode, Boolean)
 Layouts the dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static LayoutDictionary LayoutDictionary(
	this Database db,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false
)
<ExtensionAttribute>
Public Shared Function LayoutDictionary (
	db As Database,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false
) As LayoutDictionary
public:
[ExtensionAttribute]
static LayoutDictionary^ LayoutDictionary(
	Database^ db,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false
)
[<ExtensionAttribute>]
static member LayoutDictionary :
        db : Database *
        trx : Transaction *
        ?mode : OpenMode *
        ?includingErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
*)
-> LayoutDictionary
Parameters
db
Type: Database
The database.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
Return Value
Type: LayoutDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
LayoutDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace