Autocad Extension Framework Documentation
DatabaseExtensions.RegAppTable Method (Database, OpenMode)
 Regs the application table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static RegAppTable RegAppTable(
	this Database db,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function RegAppTable (
	db As Database,
	Optional mode As OpenMode = OpenMode.ForRead
) As RegAppTable
public:
[ExtensionAttribute]
static RegAppTable^ RegAppTable(
	Database^ db,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member RegAppTable :
        db : Database *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> RegAppTable
Parameters
db
Type: Database
The database.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: RegAppTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
RegAppTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace