Autocad Extension Framework Documentation
ICommandClass Interface
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public interface ICommandClass
Public Interface ICommandClass
public interface class ICommandClass
type ICommandClass =  interface end
The ICommandClass type exposes the following members.
Properties
Name | Description
Db
 Gets the database.
Doc
 Gets the document.
Ed
 Gets the ed.
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace