Autocad Extension Framework Documentation
ICommandClass Properties
The ICommandClass type exposes the following members.
Properties
Name | Description
Db
 Gets the database.
Doc
 Gets the document.
Ed
 Gets the ed.
Top
See Also
Reference
ICommandClass Interface
Autodesk.AutoCAD.Runtime Namespace