Autocad Extension Framework Documentation
SymbolTableRecordExtensions Methods
The SymbolTableRecordExtensions type exposes the following members.
Methods
Name | Description
Names
 Nameses the specified source.
Top
See Also
Reference
SymbolTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace