Autocad Extension Framework Documentation
BlockTableExtensions.GetBlockTableRecords Method
Overload List
Name | Description
GetBlockTableRecords(BlockTable, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
GetBlockTableRecords(BlockTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the block table records.
Top
See Also
Reference
BlockTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace