Autocad Extension Framework Documentation
TemporarySystemVariables Constructor
 Initializes a new instance of the TemporarySystemVariables class.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public TemporarySystemVariables()
Public Sub New
public:
TemporarySystemVariables()
new : unit -> TemporarySystemVariables
See Also
Reference
TemporarySystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace