Autocad Extension Framework Documentation
DatabaseExtensions.ContinuousLinetypeId Method
 Continuouses the linetype identifier.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectId ContinuousLinetypeId(
	this Database db
)
<ExtensionAttribute>
Public Shared Function ContinuousLinetypeId (
	db As Database
) As ObjectId
public:
[ExtensionAttribute]
static ObjectId ContinuousLinetypeId(
	Database^ db
)
[<ExtensionAttribute>]
static member ContinuousLinetypeId :
        db : Database -> ObjectId
Parameters
db
Type: Database
The database.
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace