Autocad Extension Framework Documentation
PrinterStyleSheetPath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.SupportPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterStyleSheetPath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class PrinterStyleSheetPath : SupportPath
Public Class PrinterStyleSheetPath
	Inherits SupportPath
public ref class PrinterStyleSheetPath : public SupportPath
type PrinterStyleSheetPath =
    class
        inherit SupportPath
    end
The PrinterStyleSheetPath type exposes the following members.
Constructors
Name | Description
PrinterStyleSheetPath
 Initializes a new instance of the PrinterStyleSheetPath class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace