Autocad Extension Framework Documentation
DatabaseExtensions.DimStyleTable Method
Overload List
Name | Description
DimStyleTable(Database, OpenMode)
 Dims the style table.
DimStyleTable(Database, Transaction, OpenMode)
 Dims the style table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace