Autocad Extension Framework Documentation
OsnapOverrule<T> Class
 ObjectOverule
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Overrule
 OsnapOverrule
 Autodesk.AutoCAD.DatabaseServices.OsnapOverrule<T>
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public abstract class OsnapOverrule<T> : OsnapOverrule
where T : Entity
Public MustInherit Class OsnapOverrule(Of T As Entity)
	Inherits OsnapOverrule
generic<typename T>
where T : Entity
public ref class OsnapOverrule abstract : public OsnapOverrule
[<AbstractClassAttribute>]
type OsnapOverrule<'T when 'T : Entity> =
    class
        inherit OsnapOverrule
    end
Type Parameters
T
The OsnapOverrule<T> type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace