Autocad Extension Framework Documentation
SymbolTableExtensions.ImportSymbolTableRecord<T> Method
 Imports the symbol table record.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectId ImportSymbolTableRecord<T>(
	this Database targetDb,
	string sourceFile,
	DuplicateRecordCloning cloningStyle,
	string recordName
)
where T : SymbolTable
<ExtensionAttribute>
Public Shared Function ImportSymbolTableRecord(Of T As SymbolTable) (
	targetDb As Database,
	sourceFile As String,
	cloningStyle As DuplicateRecordCloning,
	recordName As String
) As ObjectId
public:
[ExtensionAttribute]
generic<typename T>
where T : SymbolTable
static ObjectId ImportSymbolTableRecord(
	Database^ targetDb,
	String^ sourceFile,
	DuplicateRecordCloning cloningStyle,
	String^ recordName
)
[<ExtensionAttribute>]
static member ImportSymbolTableRecord :
        targetDb : Database *
        sourceFile : string *
        cloningStyle : DuplicateRecordCloning *
        recordName : string -> ObjectId  when 'T : SymbolTable
Parameters
targetDb
Type: Database
The target database.
sourceFile
Type: System.String
The source file.
cloningStyle
Type: DuplicateRecordCloning
The cloning style.
recordName
Type: System.String
Name of the record.
Type Parameters
T
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentException | Requires a concrete type derived from SymbolTable
See Also
Reference
SymbolTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace