Autocad Extension Framework Documentation
PrinterDescPath Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.SupportPath
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.PrinterDescPath
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class PrinterDescPath : SupportPath
Public Class PrinterDescPath
	Inherits SupportPath
public ref class PrinterDescPath : public SupportPath
type PrinterDescPath =
    class
        inherit SupportPath
    end
The PrinterDescPath type exposes the following members.
Constructors
Name | Description
PrinterDescPath
 Initializes a new instance of the PrinterDescPath class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace