Autocad Extension Framework Documentation
DatabaseExtensions.IncrementRevisionNumber Method
 Increments the revision number.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static int IncrementRevisionNumber(
	this Database db
)
<ExtensionAttribute>
Public Shared Function IncrementRevisionNumber (
	db As Database
) As Integer
public:
[ExtensionAttribute]
static int IncrementRevisionNumber(
	Database^ db
)
[<ExtensionAttribute>]
static member IncrementRevisionNumber :
        db : Database -> int
Parameters
db
Type: Database
The database.
Return Value
Type: Int32
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace