Autocad Extension Framework Documentation
ObjectIdExtensions.GetDBObjects Method
Overload List
Name | Description
GetDBObjects<T>(IEnumerable<ObjectId>, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects(IEnumerable<ObjectId>, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects<T>(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean)
 Gets the database objects.
GetDBObjects(IEnumerable<ObjectId>, Transaction, OpenMode, Boolean)
 Gets the database objects.
Top
See Also
Reference
ObjectIdExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace