Autocad Extension Framework Documentation
DatabaseExtensions.ViewportTable Method (Database, Transaction, OpenMode)
 Viewports the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ViewportTable ViewportTable(
	this Database db,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function ViewportTable (
	db As Database,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead
) As ViewportTable
public:
[ExtensionAttribute]
static ViewportTable^ ViewportTable(
	Database^ db,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member ViewportTable :
        db : Database *
        trx : Transaction *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> ViewportTable
Parameters
db
Type: Database
The database.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: ViewportTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
ViewportTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace