Autocad Extension Framework Documentation
Settings.SystemVariables.FILEDIA Property
 Gets or sets a value indicating whether this Settings.SystemVariables is filedia.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public bool FILEDIA { get; set; }
Public Property FILEDIA As Boolean
	Get
	Set
public:
property bool FILEDIA {
	bool get ();
	void set (bool value);
}
member FILEDIA : bool with get, set
Property Value
Type: Boolean
true if filedia; otherwise, false.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace