Autocad Extension Framework Documentation
DatabaseExtensions.LayerTable Method
Overload List
Name | Description
LayerTable(Database, OpenMode)
 Layers the table.
LayerTable(Database, Transaction, OpenMode)
 Layers the table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace