Autocad Extension Framework Documentation
DBDictionaryExtensions.GetEntries<T> Method (DBDictionary, OpenMode, Boolean)
 Gets the entries.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static IEnumerable<T> GetEntries<T>(
	this DBDictionary dic,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false
)
where T : DBObject
<ExtensionAttribute>
Public Shared Function GetEntries(Of T As DBObject) (
	dic As DBDictionary,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false
) As IEnumerable(Of T)
public:
[ExtensionAttribute]
generic<typename T>
where T : DBObject
static IEnumerable<T>^ GetEntries(
	DBDictionary^ dic,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false
)
[<ExtensionAttribute>]
static member GetEntries :
        dic : DBDictionary *
        ?mode : OpenMode *
        ?includingErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
*)
-> IEnumerable<'T>  when 'T : DBObject
Parameters
dic
Type: DBDictionary
The dic.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
Type Parameters
T
Return Value
Type: IEnumerable<T>
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBDictionary. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBDictionaryExtensions Class
GetEntries Overload
Autodesk.AutoCAD.DatabaseServices Namespace