Autocad Extension Framework Documentation
CommandClass Properties
The CommandClass type exposes the following members.
Properties
Name | Description
Db
 Gets the database.
Doc
 Gets the document.
Ed
 Gets the ed.
Top
See Also
Reference
CommandClass Class
Autodesk.AutoCAD.Runtime Namespace