Autocad Extension Framework Documentation
DatabaseExtensions.GroupDictionary Method (Database, Transaction, OpenMode, Boolean)
 Groups the dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static GroupDictionary GroupDictionary(
	this Database db,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead,
	bool includingErased = false
)
<ExtensionAttribute>
Public Shared Function GroupDictionary (
	db As Database,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead,
	Optional includingErased As Boolean = false
) As GroupDictionary
public:
[ExtensionAttribute]
static GroupDictionary^ GroupDictionary(
	Database^ db,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead,
	bool includingErased = false
)
[<ExtensionAttribute>]
static member GroupDictionary :
        db : Database *
        trx : Transaction *
        ?mode : OpenMode *
        ?includingErased : bool
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
        let _includingErased = defaultArg includingErased false
*)
-> GroupDictionary
Parameters
db
Type: Database
The database.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
includingErased (Optional)
Type: System.Boolean
if set to true [including erased].
Return Value
Type: GroupDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
GroupDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace