Autocad Extension Framework Documentation
AllowedClassFilter.AddAllowedClass Method
 Adds the allowed class.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public void AddAllowedClass(
	Type type
)
Public Sub AddAllowedClass (
	type As Type
)
public:
void AddAllowedClass(
	Type^ type
)
member AddAllowedClass :
        type : Type -> unit
Parameters
type
Type: System.Type
The type.
See Also
Reference
AllowedClassFilter Class
Autodesk.AutoCAD.EditorInput Namespace