Autocad Extension Framework Documentation
Settings.SystemVariables.TEXTSTYLE Property
 Gets or sets the textstyle.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public string TEXTSTYLE { get; set; }
Public Property TEXTSTYLE As String
	Get
	Set
public:
property String^ TEXTSTYLE {
	String^ get ();
	void set (String^ value);
}
member TEXTSTYLE : string with get, set
Property Value
Type: String
 The textstyle.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace