Autocad Extension Framework Documentation
DBDictionaryExtensions Class
 Extension class for DBDictionary object
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.DBDictionaryExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class DBDictionaryExtensions
<ExtensionAttribute>
Public NotInheritable Class DBDictionaryExtensions
[ExtensionAttribute]
public ref class DBDictionaryExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type DBDictionaryExtensions =  class end
Methods
Name | Description
GetEntries<T>(DBDictionary, OpenMode, Boolean)
 Gets the entries.
GetEntries<T>(DBDictionary, Transaction, OpenMode, Boolean)
 Gets the entries.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace