Autocad Extension Framework Documentation
Settings Properties
The Settings type exposes the following members.
Properties
Name | Description
Variables
 Gets the variables.
Top
See Also
Reference
Settings Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace