Autocad Extension Framework Documentation
EditorExtensions.GetSelection Method
Overload List
Name | Description
GetSelection(Editor, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, PromptSelectionOptions, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, SelectionFilter, AllowedClassFilter)
 Gets the selection.
GetSelection(Editor, PromptSelectionOptions, SelectionFilter, AllowedClassFilter)
 Gets the selection.
Top
See Also
Reference
EditorExtensions Class
Autodesk.AutoCAD.EditorInput Namespace