Autocad Extension Framework Documentation
WrapperDBDictionary<T>.GetEnumerator Method
 Gets the enumerator.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public IEnumerator<T> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of T)
public:
virtual IEnumerator<T>^ GetEnumerator() sealed
abstract GetEnumerator : unit -> IEnumerator<'T>
override GetEnumerator : unit -> IEnumerator<'T>
Return Value
Type: IEnumerator<T>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
WrapperDBDictionary<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace