Autocad Extension Framework Documentation
TypedValueExtensions.ToResultTypedValue Method (Point3d)
 To the result typed value.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static TypedValue ToResultTypedValue(
	this Point3d value
)
<ExtensionAttribute>
Public Shared Function ToResultTypedValue (
	value As Point3d
) As TypedValue
public:
[ExtensionAttribute]
static TypedValue ToResultTypedValue(
	Point3d value
)
[<ExtensionAttribute>]
static member ToResultTypedValue :
        value : Point3d -> TypedValue
Parameters
value
Type: Point3d
The value.
Return Value
Type: TypedValue
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Point3d. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TypedValueExtensions Class
ToResultTypedValue Overload
Autodesk.AutoCAD.DatabaseServices Namespace