Autocad Extension Framework Documentation
BlockReferenceExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.BlockReferenceExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class BlockReferenceExtensions
<ExtensionAttribute>
Public NotInheritable Class BlockReferenceExtensions
[ExtensionAttribute]
public ref class BlockReferenceExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type BlockReferenceExtensions =  class end
Methods
Name | Description
GetAttributeReferenceDictionary(BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
GetAttributeReferenceDictionary(BlockReference, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute reference dictionary.
GetAttributeReferences(BlockReference, OpenMode, Boolean, Boolean)
 Gets the attribute references.
GetAttributeReferences(BlockReference, Transaction, OpenMode, Boolean, Boolean)
 Gets the attribute references.
GetEffectiveBlockTableRecord(BlockReference)
 Gets the effective block table record.
GetEffectiveBlockTableRecord(BlockReference, Transaction)
 Gets the effective block table record.
GetEffectiveName(BlockReference)
 Gets the name of the effective.
GetEffectiveName(BlockReference, Transaction)
 Gets the name of the effective.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace