Autocad Extension Framework Documentation
ObjectIdCollectionExtensions.ToObjectIdCollection Method (IEnumerable<DBObject>)
 To the object identifier collection.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectIdCollection ToObjectIdCollection(
	this IEnumerable<DBObject> source
)
<ExtensionAttribute>
Public Shared Function ToObjectIdCollection (
	source As IEnumerable(Of DBObject)
) As ObjectIdCollection
public:
[ExtensionAttribute]
static ObjectIdCollection^ ToObjectIdCollection(
	IEnumerable<DBObject^>^ source
)
[<ExtensionAttribute>]
static member ToObjectIdCollection :
        source : IEnumerable<DBObject> -> ObjectIdCollection
Parameters
source
Type: System.Collections.Generic.IEnumerable<DBObject>
The source.
Return Value
Type: ObjectIdCollection
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type IEnumerable<DBObject>. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ObjectIdCollectionExtensions Class
ToObjectIdCollection Overload
Autodesk.AutoCAD.DatabaseServices Namespace