Autocad Extension Framework Documentation
Settings.SystemVariables.GROUPDISPLAYMODE Property
 Gets or sets the groupdisplaymode.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public short GROUPDISPLAYMODE { get; set; }
Public Property GROUPDISPLAYMODE As Short
	Get
	Set
public:
property short GROUPDISPLAYMODE {
	short get ();
	void set (short value);
}
member GROUPDISPLAYMODE : int16 with get, set
Property Value
Type: Int16
 The groupdisplaymode.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace