Autocad Extension Framework Documentation
PerDocData Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.Runtime.PerDocData
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class PerDocData : IDisposable
Public Class PerDocData
	Implements IDisposable
public ref class PerDocData : IDisposable
type PerDocData =
    class
        interface IDisposable
    end
The PerDocData type exposes the following members.
Constructors
Name | Description
PerDocData
 Initializes a new instance of the PerDocData class.
Top
Methods
Name | Description
Create
 Creates the specified document.
Dispose
 Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.Runtime Namespace