Autocad Extension Framework Documentation
SymbolTableExtensions Methods
The SymbolTableExtensions type exposes the following members.
Methods
Name | Description
GetObjectIds
 Gets the object ids.
ImportSymbolTableRecord<T>
 Imports the symbol table record.
ImportSymbolTableRecords<T>
 Imports the symbol table records.
Top
See Also
Reference
SymbolTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace