Autocad Extension Framework Documentation
AllowedClassFilter Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.EditorInput.AllowedClassFilter
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class AllowedClassFilter
Public Class AllowedClassFilter
public ref class AllowedClassFilter
type AllowedClassFilter =  class end
The AllowedClassFilter type exposes the following members.
Constructors
Name | Description
AllowedClassFilter
 Initializes a new instance of the AllowedClassFilter class.
Top
Methods
Name | Description
AddAllowedClass
 Adds the allowed class.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.EditorInput Namespace