Autocad Extension Framework Documentation
DBObjectExtensions.GetExtensionDictionary Method
 Gets the extension dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static DBDictionary GetExtensionDictionary(
	this DBObject dbObj
)
<ExtensionAttribute>
Public Shared Function GetExtensionDictionary (
	dbObj As DBObject
) As DBDictionary
public:
[ExtensionAttribute]
static DBDictionary^ GetExtensionDictionary(
	DBObject^ dbObj
)
[<ExtensionAttribute>]
static member GetExtensionDictionary :
        dbObj : DBObject -> DBDictionary
Parameters
dbObj
Type: DBObject
The database object.
Return Value
Type: DBDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type DBObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DBObjectExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace