Autocad Extension Framework Documentation
DatabaseExtensions.BlockTable Method
Overload List
Name | Description
BlockTable(Database, OpenMode)
 Blocks the table.
BlockTable(Database, Transaction, OpenMode)
 Opens the BlockTable
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace