Autocad Extension Framework Documentation
SymbolTableRecordFilterExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.SymbolTableRecordFilterExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class SymbolTableRecordFilterExtensions
<ExtensionAttribute>
Public NotInheritable Class SymbolTableRecordFilterExtensions
[ExtensionAttribute]
public ref class SymbolTableRecordFilterExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type SymbolTableRecordFilterExtensions =  class end
The SymbolTableRecordFilterExtensions type exposes the following members.
Methods
Name | Description
IsSet
 Determines whether the specified test flag is set.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace