Autocad Extension Framework Documentation
EditorExtensions.WriteLine Method (Editor, Single)
 Writes the line.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void WriteLine(
	this Editor ed,
	float value
)
<ExtensionAttribute>
Public Shared Sub WriteLine (
	ed As Editor,
	value As Single
)
public:
[ExtensionAttribute]
static void WriteLine(
	Editor^ ed,
	float value
)
[<ExtensionAttribute>]
static member WriteLine :
        ed : Editor *
        value : float32 -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: System.Single
The value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
WriteLine Overload
Autodesk.AutoCAD.EditorInput Namespace