Autocad Extension Framework Documentation
EnterpriseMenuFile Properties
The EnterpriseMenuFile type exposes the following members.
Properties
Name | Description
Path
 Gets or sets the path.
Top
See Also
Reference
EnterpriseMenuFile Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace