Autocad Extension Framework Documentation
DatabaseExtensions.AddToRevisionNumber Method
 Adds to revision number.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static int AddToRevisionNumber(
	this Database db,
	int number
)
<ExtensionAttribute>
Public Shared Function AddToRevisionNumber (
	db As Database,
	number As Integer
) As Integer
public:
[ExtensionAttribute]
static int AddToRevisionNumber(
	Database^ db,
	int number
)
[<ExtensionAttribute>]
static member AddToRevisionNumber :
        db : Database *
        number : int -> int
Parameters
db
Type: Database
The database.
number
Type: System.Int32
The number.
Return Value
Type: Int32
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace