Autocad Extension Framework Documentation
OsnapMode Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
[FlagsAttribute]
public enum OsnapMode
<FlagsAttribute>
Public Enumeration OsnapMode
[FlagsAttribute]
public enum class OsnapMode
[<FlagsAttribute>]
type OsnapMode
Members
Member name | Value | Description
None | 0 |  The none
Endpoint | 1 |  The endpoint
Midpoint | 2 |  The midpoint
Center | 4 |  The center
Node | 8 |  The node
Quadrant | 16 |  The quadrant
Intersection | 32 |  The intersection
Insertion | 64 |  The insertion
Perpendicular | 128 |  The perpendicular
Tangent | 256 |  The tangent
Nearest | 512 |  The nearest
Quick | 1024 |  The quick
ApparentIntersection | 2048 |  The apparent intersection
Extension | 4096 |  The extension
Parallel | 8192 |  The parallel
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace