Autocad Extension Framework Documentation
DatabaseExtensions.BlockTable Method (Database, OpenMode)
 Blocks the table.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static BlockTable BlockTable(
	this Database db,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function BlockTable (
	db As Database,
	Optional mode As OpenMode = OpenMode.ForRead
) As BlockTable
public:
[ExtensionAttribute]
static BlockTable^ BlockTable(
	Database^ db,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member BlockTable :
        db : Database *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> BlockTable
Parameters
db
Type: Database
The database.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: BlockTable
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
BlockTable Overload
Autodesk.AutoCAD.DatabaseServices Namespace