Autocad Extension Framework Documentation
SymbolTableExtensions.ImportSymbolTableRecords<T> Method
 Imports the symbol table records.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static bool ImportSymbolTableRecords<T>(
	this Database targetDb,
	string sourceFile,
	DuplicateRecordCloning cloningStyle,
	params string[] recordNames
)
where T : SymbolTable
<ExtensionAttribute>
Public Shared Function ImportSymbolTableRecords(Of T As SymbolTable) (
	targetDb As Database,
	sourceFile As String,
	cloningStyle As DuplicateRecordCloning,
	ParamArray recordNames As String()
) As Boolean
public:
[ExtensionAttribute]
generic<typename T>
where T : SymbolTable
static bool ImportSymbolTableRecords(
	Database^ targetDb,
	String^ sourceFile,
	DuplicateRecordCloning cloningStyle,
	... array<String^>^ recordNames
)
[<ExtensionAttribute>]
static member ImportSymbolTableRecords :
        targetDb : Database *
        sourceFile : string *
        cloningStyle : DuplicateRecordCloning *
        recordNames : string[] -> bool  when 'T : SymbolTable
Parameters
targetDb
Type: Database
The target database.
sourceFile
Type: System.String
The source file.
cloningStyle
Type: DuplicateRecordCloning
The cloning style.
recordNames
Type: System.String[]
The record names.
Type Parameters
T
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentException | Requires a concrete type derived from SymbolTable
See Also
Reference
SymbolTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace