Autocad Extension Framework Documentation
ApplicationExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.ApplicationExtensions
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class ApplicationExtensions
Public NotInheritable Class ApplicationExtensions
public ref class ApplicationExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ApplicationExtensions =  class end
See Also
Reference
Autodesk.AutoCAD.ApplicationServices Namespace