Autocad Extension Framework Documentation
GroupDictionary Methods
The GroupDictionary type exposes the following members.
Extension Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
 (Defined by DBObjectExtensions.)
GetEntries<T>(OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetEntries<T>(Transaction, OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetExtensionDictionary
 Gets the extension dictionary.
 (Defined by DBObjectExtensions.)
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
 (Defined by DBObjectExtensions.)
HasExtensionDictionary
 Determines whether [has extension dictionary].
 (Defined by DBObjectExtensions.)
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
TryGetExtensionDictionaryId
 Tries the get extension dictionary identifier.
 (Defined by DBObjectExtensions.)
Top
See Also
Reference
GroupDictionary Class
Autodesk.AutoCAD.DatabaseServices Namespace