Autocad Extension Framework Documentation
BlockReferenceExtensions.GetEffectiveName Method (BlockReference)
 Gets the name of the effective.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static string GetEffectiveName(
	this BlockReference blockref
)
<ExtensionAttribute>
Public Shared Function GetEffectiveName (
	blockref As BlockReference
) As String
public:
[ExtensionAttribute]
static String^ GetEffectiveName(
	BlockReference^ blockref
)
[<ExtensionAttribute>]
static member GetEffectiveName :
        blockref : BlockReference -> string
Parameters
blockref
Type: BlockReference
The blockref.
Return Value
Type: String
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type BlockReference. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
BlockReferenceExtensions Class
GetEffectiveName Overload
Autodesk.AutoCAD.DatabaseServices Namespace