Autocad Extension Framework Documentation
EnviromentVariables.ACAD Property
 Gets or sets the acad.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static string ACAD { get; set; }
Public Shared Property ACAD As String
	Get
	Set
public:
static property String^ ACAD {
	String^ get ();
	void set (String^ value);
}
static member ACAD : string with get, set
Property Value
Type: String
 The acad.
See Also
Reference
EnviromentVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace