Autocad Extension Framework Documentation
DatabaseExtensions.PlotSettingsDBDictionary Method (Database, Transaction, OpenMode)
 Plots the settings database dictionary.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static DBDictionary PlotSettingsDBDictionary(
	this Database db,
	Transaction trx,
	OpenMode mode = OpenMode.ForRead
)
<ExtensionAttribute>
Public Shared Function PlotSettingsDBDictionary (
	db As Database,
	trx As Transaction,
	Optional mode As OpenMode = OpenMode.ForRead
) As DBDictionary
public:
[ExtensionAttribute]
static DBDictionary^ PlotSettingsDBDictionary(
	Database^ db,
	Transaction^ trx,
	OpenMode mode = OpenMode::ForRead
)
[<ExtensionAttribute>]
static member PlotSettingsDBDictionary :
        db : Database *
        trx : Transaction *
        ?mode : OpenMode
(* Defaults:
        let _mode = defaultArg mode OpenMode.ForRead
*)
-> DBDictionary
Parameters
db
Type: Database
The database.
trx
Type: Transaction
The TRX.
mode (Optional)
Type: OpenMode
The mode.
Return Value
Type: DBDictionary
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
Exception
See Also
Reference
DatabaseExtensions Class
PlotSettingsDBDictionary Overload
Autodesk.AutoCAD.DatabaseServices Namespace