Autocad Extension Framework Documentation
AnnotationScaleExtensions Class
 Extension Method class for AnnotationScales
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.AnnotationScaleExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class AnnotationScaleExtensions
<ExtensionAttribute>
Public NotInheritable Class AnnotationScaleExtensions
[ExtensionAttribute]
public ref class AnnotationScaleExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type AnnotationScaleExtensions =  class end
The AnnotationScaleExtensions type exposes the following members.
Methods
Name | Description
GetScaleFactor
 Returns Scale Factor
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace