Autocad Extension Framework Documentation
BlockTableRecordExtensions.GetAllBlockReferenceIds Method
Overload List
Name | Description
GetAllBlockReferenceIds(BlockTableRecord, Boolean, Boolean)
 Gets all block reference ids.
GetAllBlockReferenceIds(BlockTableRecord, Transaction, Boolean, Boolean)
 Method for getting all blockreference Ids
Top
See Also
Reference
BlockTableRecordExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace