Autocad Extension Framework Documentation
AllowedClassFilter Constructor
 Initializes a new instance of the AllowedClassFilter class.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public AllowedClassFilter(
	params Type[] types
)
Public Sub New (
	ParamArray types As Type()
)
public:
AllowedClassFilter(
	... array<Type^>^ types
)
new :
        types : Type[] -> AllowedClassFilter
Parameters
types
Type: System.Type[]
The types.
See Also
Reference
AllowedClassFilter Class
Autodesk.AutoCAD.EditorInput Namespace