Autocad Extension Framework Documentation
PerDocData.Dispose Method
 Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
Namespace: Autodesk.AutoCAD.Runtime
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
Implements
IDisposable.Dispose()
See Also
Reference
PerDocData Class
Autodesk.AutoCAD.Runtime Namespace