Autocad Extension Framework Documentation
WrapperDBDictionary<T> Methods
The WrapperDBDictionary<T> generic type exposes the following members.
Methods
Name | Description
GetEnumerator
 Gets the enumerator.
Top
Extension Methods
Name | Description
ExtensionDictionaryContains
 Extensions the dictionary contains.
 (Defined by DBObjectExtensions.)
GetEntries<T>(OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetEntries<T>(Transaction, OpenMode, Boolean) | Overloaded.
 Gets the entries.
 (Defined by DBDictionaryExtensions.)
GetExtensionDictionary
 Gets the extension dictionary.
 (Defined by DBObjectExtensions.)
GetExtensionDictionaryId
 Gets the extension dictionary identifier.
 (Defined by DBObjectExtensions.)
HasExtensionDictionary
 Determines whether [has extension dictionary].
 (Defined by DBObjectExtensions.)
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
TryGetExtensionDictionaryId
 Tries the get extension dictionary identifier.
 (Defined by DBObjectExtensions.)
Top
See Also
Reference
WrapperDBDictionary<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace