Autocad Extension Framework Documentation
BlockTableExtensions.GetUserDefinedBlockTableRecords Method
Overload List
Name | Description
GetUserDefinedBlockTableRecords(BlockTable, OpenMode)
 Gets the user defined block table records.
GetUserDefinedBlockTableRecords(BlockTable, Transaction, OpenMode)
 Gets the user defined block table records.
Top
See Also
Reference
BlockTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace