Autocad Extension Framework Documentation
DrawableOverrule<T> Class
 Drawable
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 DisposableWrapper
 RXObject
 Overrule
 DrawableOverrule
 Autodesk.AutoCAD.DatabaseServices.DrawableOverrule<T>
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public abstract class DrawableOverrule<T> : DrawableOverrule
where T : Entity
Public MustInherit Class DrawableOverrule(Of T As Entity)
	Inherits DrawableOverrule
generic<typename T>
where T : Entity
public ref class DrawableOverrule abstract : public DrawableOverrule
[<AbstractClassAttribute>]
type DrawableOverrule<'T when 'T : Entity> =
    class
        inherit DrawableOverrule
    end
Type Parameters
T
The DrawableOverrule<T> type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace