Autocad Extension Framework Documentation
TransactionManagerExtensions.StarLockedTransaction Method (TransactionManager)
 Stars the locked transaction.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static LockedTransaction StarLockedTransaction(
	this TransactionManager tm
)
<ExtensionAttribute>
Public Shared Function StarLockedTransaction (
	tm As TransactionManager
) As LockedTransaction
public:
[ExtensionAttribute]
static LockedTransaction^ StarLockedTransaction(
	TransactionManager^ tm
)
[<ExtensionAttribute>]
static member StarLockedTransaction :
        tm : TransactionManager -> LockedTransaction
Parameters
tm
Type: TransactionManager
The tm.
Return Value
Type: LockedTransaction
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TransactionManager. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TransactionManagerExtensions Class
StarLockedTransaction Overload
Autodesk.AutoCAD.ApplicationServices Namespace