Autocad Extension Framework Documentation
Settings Constructor
Initializes a new instance of the Settings class
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public Settings()
Public Sub New
public:
Settings()
new : unit -> Settings
See Also
Reference
Settings Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace