Autocad Extension Framework Documentation
Settings.SystemVariables.INSUNITS Property
 Gets or sets the insunits.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public UnitsValue INSUNITS { get; set; }
Public Property INSUNITS As UnitsValue
	Get
	Set
public:
property UnitsValue INSUNITS {
	UnitsValue get ();
	void set (UnitsValue value);
}
member INSUNITS : UnitsValue with get, set
Property Value
Type: UnitsValue
 The insunits.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace