Autocad Extension Framework Documentation
ProxyEntityExtensions.IsErasable Method
 Determines whether this instance is erasable.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static bool IsErasable(
	this ProxyEntity proxy
)
<ExtensionAttribute>
Public Shared Function IsErasable (
	proxy As ProxyEntity
) As Boolean
public:
[ExtensionAttribute]
static bool IsErasable(
	ProxyEntity^ proxy
)
[<ExtensionAttribute>]
static member IsErasable :
        proxy : ProxyEntity -> bool
Parameters
proxy
Type: ProxyEntity
The proxy.
Return Value
Type: Boolean
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ProxyEntity. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ProxyEntityExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace