Autocad Extension Framework Documentation
ToolPalettePath.DefaultPath Property
 Gets the default path.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static string DefaultPath { get; }
Public Shared ReadOnly Property DefaultPath As String
	Get
public:
static property String^ DefaultPath {
	String^ get ();
}
static member DefaultPath : string with get
Property Value
Type: String
 The default path.
See Also
Reference
ToolPalettePath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace