Autocad Extension Framework Documentation
DocumentExtensions Methods
The DocumentExtensions type exposes the following members.
Methods
Name | Description
CreatePreviewIcon
 Creates the preview icon.
Save
 Author: Tony Tanzillo Source: http://www.theswamp.org/index.php?topic=42016.msg471429#msg471429
SendCancel
 Sends the cancel.
SendCommand
 Sends the command.
Top
See Also
Reference
DocumentExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace