Autocad Extension Framework Documentation
DrawableOverrule<T> Properties
The DrawableOverrule<T> generic type exposes the following members.
Properties
Name | Description
Status
 Gets or sets the status.
Top
See Also
Reference
DrawableOverrule<T> Class
Autodesk.AutoCAD.DatabaseServices Namespace