Autocad Extension Framework Documentation
DatabaseExtensions.StandardMLStyle Method (Database, Transaction)
 Standards the ml style.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static ObjectId StandardMLStyle(
	this Database db,
	Transaction trx
)
<ExtensionAttribute>
Public Shared Function StandardMLStyle (
	db As Database,
	trx As Transaction
) As ObjectId
public:
[ExtensionAttribute]
static ObjectId StandardMLStyle(
	Database^ db,
	Transaction^ trx
)
[<ExtensionAttribute>]
static member StandardMLStyle :
        db : Database *
        trx : Transaction -> ObjectId
Parameters
db
Type: Database
The database.
trx
Type: Transaction
The TRX.
Return Value
Type: ObjectId
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
StandardMLStyle Overload
Autodesk.AutoCAD.DatabaseServices Namespace