Autocad Extension Framework Documentation
AcadDirectory Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.ApplicationServices.PreferencesFiles.AcadDirectory
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public class AcadDirectory : IEquatable<AcadDirectory>
Public Class AcadDirectory
	Implements IEquatable(Of AcadDirectory)
public ref class AcadDirectory : IEquatable<AcadDirectory^>
type AcadDirectory =
    class
        interface IEquatable<AcadDirectory>
    end
The AcadDirectory type exposes the following members.
Constructors
Name | Description
AcadDirectory
 Initializes a new instance of the AcadDirectory class.
Top
Properties
Name | Description
Exists
 Gets a value indicating whether this AcadDirectory is exists.
Name
 Gets the name.
Path
 Gets the path.
Top
Methods
Name | Description
Equals(Object)
 Determines whether the specified Object, is equal to this instance.
 (Overrides Object.Equals(Object).)
Equals(AcadDirectory)
 Equalses the specified other.
GetHashCode
 Returns a hash code for this instance.
 (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Equality
 Implements the operator ==.
Inequality
 Implements the operator !=.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace