Autocad Extension Framework Documentation
TransactionManagerExtensions.StarLockedTransaction Method
Overload List
Name | Description
StarLockedTransaction(TransactionManager)
 Stars the locked transaction.
StarLockedTransaction(TransactionManager, DocumentLockMode, String, String, Boolean)
 Stars the locked transaction.
Top
See Also
Reference
TransactionManagerExtensions Class
Autodesk.AutoCAD.ApplicationServices Namespace