Autocad Extension Framework Documentation
TemplateDWGPath Properties
The TemplateDWGPath type exposes the following members.
Properties
Name | Description
Path
 Gets or sets the path.
Top
See Also
Reference
TemplateDWGPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace