Autocad Extension Framework Documentation
TransactionManagerExtensions.StarLockedTransaction Method (TransactionManager, DocumentLockMode, String, String, Boolean)
 Stars the locked transaction.
Namespace: Autodesk.AutoCAD.ApplicationServices
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static LockedTransaction StarLockedTransaction(
	this TransactionManager tm,
	DocumentLockMode lockMode,
	string globalCommandName,
	string localCommandName,
	bool promptIfFails
)
<ExtensionAttribute>
Public Shared Function StarLockedTransaction (
	tm As TransactionManager,
	lockMode As DocumentLockMode,
	globalCommandName As String,
	localCommandName As String,
	promptIfFails As Boolean
) As LockedTransaction
public:
[ExtensionAttribute]
static LockedTransaction^ StarLockedTransaction(
	TransactionManager^ tm,
	DocumentLockMode lockMode,
	String^ globalCommandName,
	String^ localCommandName,
	bool promptIfFails
)
[<ExtensionAttribute>]
static member StarLockedTransaction :
        tm : TransactionManager *
        lockMode : DocumentLockMode *
        globalCommandName : string *
        localCommandName : string *
        promptIfFails : bool -> LockedTransaction
Parameters
tm
Type: TransactionManager
The tm.
lockMode
Type: DocumentLockMode
The lock mode.
globalCommandName
Type: System.String
Name of the global command.
localCommandName
Type: System.String
Name of the local command.
promptIfFails
Type: System.Boolean
if set to true [prompt if fails].
Return Value
Type: LockedTransaction
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type TransactionManager. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
TransactionManagerExtensions Class
StarLockedTransaction Overload
Autodesk.AutoCAD.ApplicationServices Namespace