Autocad Extension Framework Documentation
ExtensionApplication Methods
The ExtensionApplication type exposes the following members.
Methods
Name | Description
Initialize
 Initializes this instance.
Terminate
 Terminates this instance.
Top
Extension Methods
Name | Description
ToResultTypedValue
 To the result typed value.
 (Defined by TypedValueExtensions.)
Top
See Also
Reference
ExtensionApplication Class
Autodesk.AutoCAD.Runtime Namespace