Autocad Extension Framework Documentation
AnnotationScaleExtensions Methods
The AnnotationScaleExtensions type exposes the following members.
Methods
Name | Description
GetScaleFactor
 Returns Scale Factor
Top
See Also
Reference
AnnotationScaleExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace