Autocad Extension Framework Documentation
DatabaseExtensions.TableStyleDBDictionary Method
Overload List
Name | Description
TableStyleDBDictionary(Database, OpenMode)
 Tables the style database dictionary.
TableStyleDBDictionary(Database, Transaction, OpenMode)
 Tables the style database dictionary.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace