Autocad Extension Framework Documentation
EditorExtensions.Write Method (Editor, Char[], Int32, Int32)
 Writes the specified subarray of Unicode characters to the CommandLine
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void Write(
	this Editor ed,
	char[] buffer,
	int index,
	int count
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	buffer As Char(),
	index As Integer,
	count As Integer
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	array<wchar_t>^ buffer,
	int index,
	int count
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        buffer : char[] *
        index : int *
        count : int -> unit
Parameters
ed
Type: Editor
Extension method of Editor
buffer
Type: System.Char[]
An array of Unicode characters.
index
Type: System.Int32
The starting position in buffer.
count
Type: System.Int32
The number of characters to write.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Exceptions
Exception | Condition
ArgumentNullException | Thrown if buffer is null
ArgumentOutOfRangeException | Thrown if index is less than zero.
ArgumentException | Thrown if index plus count specify a position that is not within buffer.
ArgumentOutOfRangeException | Thrown if index is less than zero.
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace