Autocad Extension Framework Documentation
EditorExtensions.Write Method (Editor, ObjectId)
 Writes the specified value.
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void Write(
	this Editor ed,
	ObjectId value
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	value As ObjectId
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	ObjectId value
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        value : ObjectId -> unit
Parameters
ed
Type: Editor
The ed.
value
Type: ObjectId
The value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace