Autocad Extension Framework Documentation
DimStyleTableExtensions Methods
Methods
Name | Description
GetDimStyleTableRecords(DimStyleTable, OpenMode, SymbolTableRecordFilter)
 Gets the dim style table records.
GetDimStyleTableRecords(DimStyleTable, Transaction, OpenMode, SymbolTableRecordFilter)
 Gets the dim style table records.
Top
See Also
Reference
DimStyleTableExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace