Autocad Extension Framework Documentation
DatabaseExtensions.RevisionNumber Method
 Revisions the number.
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static int RevisionNumber(
	this Database db
)
<ExtensionAttribute>
Public Shared Function RevisionNumber (
	db As Database
) As Integer
public:
[ExtensionAttribute]
static int RevisionNumber(
	Database^ db
)
[<ExtensionAttribute>]
static member RevisionNumber :
        db : Database -> int
Parameters
db
Type: Database
The database.
Return Value
Type: Int32
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Database. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace