Autocad Extension Framework Documentation
SymbolTableRecordFilter Enumeration
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
[FlagsAttribute]
public enum SymbolTableRecordFilter
<FlagsAttribute>
Public Enumeration SymbolTableRecordFilter
[FlagsAttribute]
public enum class SymbolTableRecordFilter
[<FlagsAttribute>]
type SymbolTableRecordFilter
Members
Member name | Value | Description
None | 0 |  The none
IncludedErased | 1 |  The included erased
IncludeDependent | 2 |  The include dependent
IncludedErasedAndDependent | 3 |  The included erased and dependent
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace