Autocad Extension Framework Documentation
DatabaseExtensions.LinetypeTable Method
Overload List
Name | Description
LinetypeTable(Database, OpenMode)
 Linetypes the table.
LinetypeTable(Database, Transaction, OpenMode)
 Linetypes the table.
Top
See Also
Reference
DatabaseExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace