Autocad Extension Framework Documentation
TypedValueExtensions.ToResultTypedValue Method
Overload List
Name | Description
ToResultTypedValue(ObjectId)
 To the result typed value.
ToResultTypedValue(Point2d)
 To the result typed value.
ToResultTypedValue(Point3d)
 To the result typed value.
ToResultTypedValue(Double)
 To the result typed value.
ToResultTypedValue(Int16)
 To the result typed value.
ToResultTypedValue(Int32)
 To the result typed value.
ToResultTypedValue(Int64)
 To the result typed value.
ToResultTypedValue(Object)
 To the result typed value.
ToResultTypedValue(String)
 To the result typed value.
Top
See Also
Reference
TypedValueExtensions Class
Autodesk.AutoCAD.DatabaseServices Namespace