Autocad Extension Framework Documentation
SupportPath.Add Method
 Adds the specified path.
Namespace: Autodesk.AutoCAD.ApplicationServices.PreferencesFiles
Assembly: AcMgdExtensions (in AcMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public void Add(
	string path
)
Public Sub Add (
	path As String
)
public:
virtual void Add(
	String^ path
) sealed
abstract Add :
        path : string -> unit
override Add :
        path : string -> unit
Parameters
path
Type: System.String
The path.
See Also
Reference
SupportPath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace