Autocad Extension Framework Documentation
ToolPalettePath Properties
The ToolPalettePath type exposes the following members.
Properties
Name | Description
DefaultPath
 Gets the default path.
Top
See Also
Reference
ToolPalettePath Class
Autodesk.AutoCAD.ApplicationServices.PreferencesFiles Namespace