Autocad Extension Framework Documentation
Settings.SystemVariables.CVPORT Property
 Gets or sets the cvport.
Namespace: Autodesk.AutoCAD.ApplicationServices.Core
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public short CVPORT { get; set; }
Public Property CVPORT As Short
	Get
	Set
public:
property short CVPORT {
	short get ();
	void set (short value);
}
member CVPORT : int16 with get, set
Property Value
Type: Int16
 The cvport.
See Also
Reference
Settings.SystemVariables Class
Autodesk.AutoCAD.ApplicationServices.Core Namespace