Autocad Extension Framework Documentation
EditorExtensions.Write Method (Editor, Boolean)
 Writes the text representation of the specified Boolean val to the CommandLine
Namespace: Autodesk.AutoCAD.EditorInput
Assembly: AcCoreMgdExtensions (in AcCoreMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static void Write(
	this Editor ed,
	bool value
)
<ExtensionAttribute>
Public Shared Sub Write (
	ed As Editor,
	value As Boolean
)
public:
[ExtensionAttribute]
static void Write(
	Editor^ ed,
	bool value
)
[<ExtensionAttribute>]
static member Write :
        ed : Editor *
        value : bool -> unit
Parameters
ed
Type: Editor
Extension method of Editor
value
Type: System.Boolean
The val to write.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Editor. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EditorExtensions Class
Write Overload
Autodesk.AutoCAD.EditorInput Namespace