Autocad Extension Framework Documentation
SymbolTableExtensions Class
Inheritance Hierarchy
System.Object
 Autodesk.AutoCAD.DatabaseServices.SymbolTableExtensions
Namespace: Autodesk.AutoCAD.DatabaseServices
Assembly: AcDbMgdExtensions (in AcDbMgdExtensions.dll) Version: 1.0.0.0 (1.0.0.0)
Syntax
public static class SymbolTableExtensions
<ExtensionAttribute>
Public NotInheritable Class SymbolTableExtensions
[ExtensionAttribute]
public ref class SymbolTableExtensions abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
[<ExtensionAttribute>]
type SymbolTableExtensions =  class end
The SymbolTableExtensions type exposes the following members.
Methods
Name | Description
GetObjectIds
 Gets the object ids.
ImportSymbolTableRecord<T>
 Imports the symbol table record.
ImportSymbolTableRecords<T>
 Imports the symbol table records.
Top
See Also
Reference
Autodesk.AutoCAD.DatabaseServices Namespace